MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_adc.h
/**
  **********************************************************************************************************************
  * @file    stm32c5xx_ll_adc.h
  * @brief   Header file of ADC LL module.
  **********************************************************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  **********************************************************************************************************************
  */

/* Define to prevent recursive inclusion -----------------------------------------------------------------------------*/
#ifndef STM32C5XX_LL_ADC_H
#define STM32C5XX_LL_ADC_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ----------------------------------------------------------------------------------------------------------*/
#include "stm32c5xx.h"

/** @addtogroup STM32C5xx_LL_Driver
  * @{
  */

#if defined(ADC1) || defined(ADC2) || defined(ADC3)

/** @defgroup ADC_LL ADC
  * @{
  */

/* Private types -----------------------------------------------------------------------------------------------------*/
/* Private variables -------------------------------------------------------------------------------------------------*/

/* Private constants -------------------------------------------------------------------------------------------------*/
/** @defgroup ADC_LL_Private_Constants ADC Private Constants
  * @{
  */

/* Internal mask for ADC group regular sequencer.
To select into literal LL_ADC_REG_RANK_x the relevant bits for:
- sequencer register offset
- sequencer rank bits position into the selected register */
/* Internal register offset for ADC group regular sequencer configuration (offset placed into a spare area of
literal definition) */
#define LL_ADC_SQR1_REGOFFSET           (0x00000000UL)
#define LL_ADC_SQR2_REGOFFSET           (0x00000100UL)
#define LL_ADC_SQR3_REGOFFSET           (0x00000200UL)
#define LL_ADC_SQR4_REGOFFSET           (0x00000300UL)

#define LL_ADC_REG_SQRX_REGOFFSET_MASK  (LL_ADC_SQR1_REGOFFSET\
                                         | LL_ADC_SQR2_REGOFFSET | LL_ADC_SQR3_REGOFFSET | LL_ADC_SQR4_REGOFFSET)
#define LL_ADC_SQRX_REGOFFSET_POS       (8UL) /* Position of bits ADC_SQRx_REGOFFSET
                                        in LL_ADC_REG_SQRX_REGOFFSET_MASK */
#define LL_ADC_REG_RANK_ID_SQRX_MASK    (LL_ADC_CHANNEL_ID_NB_MASK_POSBIT0)

/* Internal mask for ADC group injected sequencer.
To select into literal LL_ADC_INJ_RANK_x the relevant bits for:
- data register offset
- sequencer rank bits position into the selected register */
/* Internal register offset for ADC group injected data register (offset placed into a spare area of
literal definition) */
#define LL_ADC_JDR1_REGOFFSET           (0x00000000UL)
#define LL_ADC_JDR2_REGOFFSET           (0x00000100UL)
#define LL_ADC_JDR3_REGOFFSET           (0x00000200UL)
#define LL_ADC_JDR4_REGOFFSET           (0x00000300UL)

#define LL_ADC_INJ_JDRX_REGOFFSET_MASK  (LL_ADC_JDR1_REGOFFSET\
                                         | LL_ADC_JDR2_REGOFFSET | LL_ADC_JDR3_REGOFFSET | LL_ADC_JDR4_REGOFFSET)
#define LL_ADC_INJ_RANK_ID_JSQR_MASK    (LL_ADC_CHANNEL_ID_NB_MASK_POSBIT0)
#define LL_ADC_JDRX_REGOFFSET_POS       (8UL) /* Position of bits ADC_JDRx_REGOFFSET in
                                        LL_ADC_INJ_JDRX_REGOFFSET_MASK */

/* Internal mask for ADC group regular trigger.
To select into literal LL_ADC_REG_TRIG_x the relevant bits for:
- regular trigger source
- regular trigger edge */
#define LL_ADC_REG_TRIG_EDGE_DEFAULT    (ADC_CFGR1_EXTEN_0) /* Trigger edge set to rising edge (default setting
                                        for compatibility with some ADC on other STM32 series having this setting
                                        set by HW default value) */

/* Mask containing trigger source masks for each of possible trigger edge selection duplicated with shifts [0; 4; 8; 12]
corresponding to {SW start; ext trigger; ext trigger; ext trigger}. */
#define LL_ADC_REG_TRIG_SOURCE_MASK     (((LL_ADC_REG_TRIG_SOFTWARE & ADC_CFGR1_EXTSEL) << (4U * 0UL)) | \
                                         ((ADC_CFGR1_EXTSEL)                            << (4U * 1UL)) | \
                                         ((ADC_CFGR1_EXTSEL)                            << (4U * 2UL)) | \
                                         ((ADC_CFGR1_EXTSEL)                            << (4U * 3UL))  )

/* Mask containing trigger edge masks for each of possible trigger edge selection duplicated with shifts [0; 4; 8; 12]
corresponding to {SW start; ext trigger; ext trigger; ext trigger}. */
#define LL_ADC_REG_TRIG_EDGE_MASK       (((LL_ADC_REG_TRIG_SOFTWARE & ADC_CFGR1_EXTEN) << (4U * 0UL)) | \
                                         ((LL_ADC_REG_TRIG_EDGE_DEFAULT)               << (4U * 1UL)) | \
                                         ((LL_ADC_REG_TRIG_EDGE_DEFAULT)               << (4U * 2UL)) | \
                                         ((LL_ADC_REG_TRIG_EDGE_DEFAULT)               << (4U * 3UL))  )

/* Internal mask for ADC group injected trigger:
To select into literal LL_ADC_INJ_TRIG_x the relevant bits for:
- injected trigger source
- injected trigger edge */
#define LL_ADC_INJ_TRIG_EDGE_DEFAULT    (ADC_JSQR_JEXTEN_0) /* Trigger edge set to rising edge (default setting for
                                        compatibility with some ADC on other STM32 series having this setting
                                        set by HW default value) */

/* Mask containing trigger source masks for each of possible trigger edge selection duplicated with shifts [0; 4; 8; 12]
corresponding to {SW start; ext trigger; ext trigger; ext trigger}. */
#define LL_ADC_INJ_TRIG_SOURCE_MASK     (((LL_ADC_INJ_TRIG_SOFTWARE & ADC_JSQR_JEXTSEL) << (4U * 0UL)) | \
                                         ((ADC_JSQR_JEXTSEL)                            << (4U * 1UL)) | \
                                         ((ADC_JSQR_JEXTSEL)                            << (4U * 2UL)) | \
                                         ((ADC_JSQR_JEXTSEL)                            << (4U * 3UL))  )

/* Mask containing trigger edge masks for each of possible trigger edge selection duplicated with shifts [0; 4; 8; 12]
corresponding to {SW start; ext trigger; ext trigger; ext trigger}. */
#define LL_ADC_INJ_TRIG_EDGE_MASK       (((LL_ADC_INJ_TRIG_SOFTWARE & ADC_JSQR_JEXTEN) << (4U * 0UL)) | \
                                         ((LL_ADC_INJ_TRIG_EDGE_DEFAULT)               << (4U * 1UL)) | \
                                         ((LL_ADC_INJ_TRIG_EDGE_DEFAULT)               << (4U * 2UL)) | \
                                         ((LL_ADC_INJ_TRIG_EDGE_DEFAULT)               << (4U * 3UL))  )

/* Internal mask for ADC channel.
To select into literal LL_ADC_CHANNEL_LUT[] the relevant bits for:
- channel identifier defined by bitfield
- channel sampling time defined by SMPRx register offset and SMPx bits positions into SMPRx register */
#define LL_ADC_CHANNEL_ID_BITFIELD_MASK (ADC_AWD2CR_AWDCH)
#define LL_ADC_CHANNEL_ID_NB_MASK_POSBIT0 (ADC_SQR2_SQ5) /* Aligned on register LSB, equivalent to shift in register:
                                        (LL_ADC_CH_NUMBER_MASK >> [Position of bitfield "LL_ADC_CH_NUMBER_MASK"] */

