MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_adc.h
#define LL_ADC_CH_EXTERNAL         (0x00000000UL) /* Marker of external channel */
#define LL_ADC_CH_INTERNAL_ADC1    (0x00000400UL) /* Marker of internal channel of ADC1 */
#define LL_ADC_CH_INTERNAL_ADC2    (0x00000800UL) /* Marker of internal channel of ADC2 */
#define LL_ADC_CH_INTERNAL_ADC3    (0x00001000UL) /* Marker of internal channel of ADC3 */

/* Internal mask for specific virtual channel: */
#define LL_ADC_CH_NUMBER_RANGE_MAX      (13UL) /* ADC channel number max value */
#define ADC_CH_NONE_NUMBER              (LL_ADC_CH_NUMBER_RANGE_MAX + 1UL)
#define ADC_CH_ALL_NUMBER               (LL_ADC_CH_NUMBER_RANGE_MAX + 2UL)

#define LL_ADC_CH_NUMBER_MASK           (0x0000001FUL) /* Mask of channel number region in LL_ADC_CHANNEL_X
                                        bitfield (values as decimal number in range [0; 255]) */
#define LL_ADC_CH_INTERNAL_MASK         (0x0000FF00UL) /* Mask of internal channel region in LL_ADC_CHANNEL_X
                                        bitfield (values as bitfield for each config) */

/* Internal register offset for ADC channel sampling time configuration */
/* (offset placed into a spare area of literal definition) */
#define LL_ADC_CH_SMPR1_REGOFFSET       (0x00000000UL)
#define LL_ADC_CH_SMPR2_REGOFFSET       (0x02000000UL)
#define LL_ADC_CH_SMPRX_REGOFFSET_MASK  (LL_ADC_CH_SMPR1_REGOFFSET | LL_ADC_CH_SMPR2_REGOFFSET)
#define LL_ADC_CH_SMPRX_REGOFFSET_POS   (25UL) /* Position of bitfield ADC_SMPRx_REGOFFSET
                                        in LL_ADC_CH_SMPRX_REGOFFSET_MASK */
#define LL_ADC_CH_SMPX_BITOFFSET_MASK   (0x01F00000UL)
#define LL_ADC_CH_SMPX_BITOFFSET_POS    (20UL) /* Position of bitfield LL_ADC_CH_SMPX_BITOFFSET_MASK in register */

/* Definition of channels ID bitfield information to be inserted into channels literals definition */
#define LL_ADC_CHANNEL_0_BITFIELD       (ADC_AWD2CR_AWDCH_0)
#define LL_ADC_CHANNEL_1_BITFIELD       (ADC_AWD2CR_AWDCH_1)
#define LL_ADC_CHANNEL_2_BITFIELD       (ADC_AWD2CR_AWDCH_2)
#define LL_ADC_CHANNEL_3_BITFIELD       (ADC_AWD2CR_AWDCH_3)
#define LL_ADC_CHANNEL_4_BITFIELD       (ADC_AWD2CR_AWDCH_4)
#define LL_ADC_CHANNEL_5_BITFIELD       (ADC_AWD2CR_AWDCH_5)
#define LL_ADC_CHANNEL_6_BITFIELD       (ADC_AWD2CR_AWDCH_6)
#define LL_ADC_CHANNEL_7_BITFIELD       (ADC_AWD2CR_AWDCH_7)
#define LL_ADC_CHANNEL_8_BITFIELD       (ADC_AWD2CR_AWDCH_8)
#define LL_ADC_CHANNEL_9_BITFIELD       (ADC_AWD2CR_AWDCH_9)
#define LL_ADC_CHANNEL_10_BITFIELD      (ADC_AWD2CR_AWDCH_10)
#define LL_ADC_CHANNEL_11_BITFIELD      (ADC_AWD2CR_AWDCH_11)
#define LL_ADC_CHANNEL_12_BITFIELD      (ADC_AWD2CR_AWDCH_12)
#define LL_ADC_CHANNEL_13_BITFIELD      (ADC_AWD2CR_AWDCH_13)
#define LL_ADC_CHANNEL_NONE_BITFIELD    (0x00000000UL)
#define LL_ADC_CHANNEL_ALL_BITFIELD     (ADC_AWD2CR_AWDCH)

/* Definition of channels sampling time information to be inserted into channels literals definition */
#define LL_ADC_CHANNEL_0_SMP            (LL_ADC_CH_SMPR1_REGOFFSET | (( 0UL) << LL_ADC_CH_SMPX_BITOFFSET_POS))
#define LL_ADC_CHANNEL_1_SMP            (LL_ADC_CH_SMPR1_REGOFFSET | (( 3UL) << LL_ADC_CH_SMPX_BITOFFSET_POS))
#define LL_ADC_CHANNEL_2_SMP            (LL_ADC_CH_SMPR1_REGOFFSET | (( 6UL) << LL_ADC_CH_SMPX_BITOFFSET_POS))
#define LL_ADC_CHANNEL_3_SMP            (LL_ADC_CH_SMPR1_REGOFFSET | (( 9UL) << LL_ADC_CH_SMPX_BITOFFSET_POS))
#define LL_ADC_CHANNEL_4_SMP            (LL_ADC_CH_SMPR1_REGOFFSET | ((12UL) << LL_ADC_CH_SMPX_BITOFFSET_POS))
#define LL_ADC_CHANNEL_5_SMP            (LL_ADC_CH_SMPR1_REGOFFSET | ((15UL) << LL_ADC_CH_SMPX_BITOFFSET_POS))
#define LL_ADC_CHANNEL_6_SMP            (LL_ADC_CH_SMPR1_REGOFFSET | ((18UL) << LL_ADC_CH_SMPX_BITOFFSET_POS))
#define LL_ADC_CHANNEL_7_SMP            (LL_ADC_CH_SMPR1_REGOFFSET | ((21UL) << LL_ADC_CH_SMPX_BITOFFSET_POS))
#define LL_ADC_CHANNEL_8_SMP            (LL_ADC_CH_SMPR1_REGOFFSET | ((24UL) << LL_ADC_CH_SMPX_BITOFFSET_POS))
#define LL_ADC_CHANNEL_9_SMP            (LL_ADC_CH_SMPR1_REGOFFSET | ((27UL) << LL_ADC_CH_SMPX_BITOFFSET_POS))
#define LL_ADC_CHANNEL_10_SMP           (LL_ADC_CH_SMPR2_REGOFFSET | (( 0UL) << LL_ADC_CH_SMPX_BITOFFSET_POS))
#define LL_ADC_CHANNEL_11_SMP           (LL_ADC_CH_SMPR2_REGOFFSET | (( 3UL) << LL_ADC_CH_SMPX_BITOFFSET_POS))
#define LL_ADC_CHANNEL_12_SMP           (LL_ADC_CH_SMPR2_REGOFFSET | (( 6UL) << LL_ADC_CH_SMPX_BITOFFSET_POS))
#define LL_ADC_CHANNEL_13_SMP           (LL_ADC_CH_SMPR2_REGOFFSET | (( 9UL) << LL_ADC_CH_SMPX_BITOFFSET_POS))
#define LL_ADC_CHANNEL_NONE_SMP         (LL_ADC_CH_SMPR1_REGOFFSET) /* Channel virtual without any register */
#define LL_ADC_CHANNEL_ALL_SMP          (LL_ADC_CH_SMPR1_REGOFFSET) /* Channel virtual without any register */

/* Definition of ADC channel look up table containing channels information */
static const uint32_t LL_ADC_CHANNEL_LUT[] =
{
  (LL_ADC_CHANNEL_0_SMP   | LL_ADC_CHANNEL_0_BITFIELD),     /*!< ADC channel ADCx_IN0  */
  (LL_ADC_CHANNEL_1_SMP   | LL_ADC_CHANNEL_1_BITFIELD),     /*!< ADC channel ADCx_IN1  */
  (LL_ADC_CHANNEL_2_SMP   | LL_ADC_CHANNEL_2_BITFIELD),     /*!< ADC channel ADCx_IN2  */
  (LL_ADC_CHANNEL_3_SMP   | LL_ADC_CHANNEL_3_BITFIELD),     /*!< ADC channel ADCx_IN3  */
  (LL_ADC_CHANNEL_4_SMP   | LL_ADC_CHANNEL_4_BITFIELD),     /*!< ADC channel ADCx_IN4  */
  (LL_ADC_CHANNEL_5_SMP   | LL_ADC_CHANNEL_5_BITFIELD),     /*!< ADC channel ADCx_IN5  */
  (LL_ADC_CHANNEL_6_SMP   | LL_ADC_CHANNEL_6_BITFIELD),     /*!< ADC channel ADCx_IN6  */
  (LL_ADC_CHANNEL_7_SMP   | LL_ADC_CHANNEL_7_BITFIELD),     /*!< ADC channel ADCx_IN7  */
  (LL_ADC_CHANNEL_8_SMP   | LL_ADC_CHANNEL_8_BITFIELD),     /*!< ADC channel ADCx_IN8  */
  (LL_ADC_CHANNEL_9_SMP   | LL_ADC_CHANNEL_9_BITFIELD),     /*!< ADC channel ADCx_IN9  */
  (LL_ADC_CHANNEL_10_SMP  | LL_ADC_CHANNEL_10_BITFIELD),    /*!< ADC channel ADCx_IN10 */
  (LL_ADC_CHANNEL_11_SMP  | LL_ADC_CHANNEL_11_BITFIELD),    /*!< ADC channel ADCx_IN11 */
  (LL_ADC_CHANNEL_12_SMP  | LL_ADC_CHANNEL_12_BITFIELD),    /*!< ADC channel ADCx_IN12 */
  (LL_ADC_CHANNEL_13_SMP  | LL_ADC_CHANNEL_13_BITFIELD),    /*!< ADC channel ADCx_IN13 */
  (LL_ADC_CHANNEL_NONE_SMP | LL_ADC_CHANNEL_NONE_BITFIELD), /*!< ADC channel virtual (no channel) */
  (LL_ADC_CHANNEL_ALL_SMP  | LL_ADC_CHANNEL_ALL_BITFIELD),  /*!< ADC channel virtual (all channels) */
};

/* Internal mask for ADC mode single or differential ended.
To select into literals LL_ADC_IN_SINGLE_ENDED or LL_ADC_IN_DIFFERENTIAL the relevant bits for (concatenation of
multiple bits used in different registers):
- ADC calibration: calibration start, calibration factor get or set
- ADC channels: set each ADC channel ending mode */
#define LL_ADC_SGLDIFF_CAL_START_MASK   (ADC_CR_ADCALDIF)
#define LL_ADC_SGLDIFF_CAL_FACTOR_MASK  (ADC_CALFACT_CALFACT)
#define LL_ADC_SGLDIFF_CH_MASK          (LL_ADC_CHANNEL_ID_BITFIELD_MASK)
#define LL_ADC_SGLDIFF_CH_SHIFT_MASK    (ADC_CALFACT_CALFACT_4 | ADC_CALFACT_CALFACT_3) /* Value to perform
                                        shift when single mode is selected, shift value out of channels bits range. */
#define LL_ADC_SGLDIFF_CAL_F_BIT_D_MASK (0x00010000UL) /* Selection of 1 bit to discriminate differential mode:
                                        mask of bit */
#define LL_ADC_SGLDIFF_CAL_F_BIT_D_POS  (16UL)          /* Selection of 1 bit to discriminate differential mode:
                                        position of bit */
#define LL_ADC_SGLDIFF_CAL_F_BIT_D_SHIFT4 (LL_ADC_SGLDIFF_CAL_F_BIT_D_POS - 4UL) /* Shift of bit
                                        LL_ADC_SGLDIFF_CAL_F_BIT_D to perform a shift of 4 ranks */

#define LL_ADC_AWD_CH_NB_MASK           (ADC_CFGR1_AWD1CH)
#define LL_ADC_AWD_CH_NB_BITOFFSET_POS  (ADC_CFGR1_AWD1CH_Pos)

/* Internal register offset for ADC analog watchdog channel configuration */
#define LL_ADC_AWD_CR1_REGOFFSET        (0x00000000UL)
#define LL_ADC_AWD_CR2_REGOFFSET        (0x01000000UL)
#define LL_ADC_AWD_CR3_REGOFFSET        (0x02000000UL)

/* Register offset gap between AWD1 and AWD2-AWD3 configuration registers (Set separately as ADC_AWD_CRX_REGOFFSET
to spare 32 bits space */
#define LL_ADC_AWD_CR12_REGOFFSETGAP_MASK (ADC_AWD2CR_AWDCH_0)
#define LL_ADC_AWD_CR12_REGOFFSETGAP_VAL  (0x00000024UL)

