MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_adc.h
#define LL_ADC_AWD_CRX_REGOFFSET_MASK   (LL_ADC_AWD_CR1_REGOFFSET | LL_ADC_AWD_CR2_REGOFFSET | LL_ADC_AWD_CR3_REGOFFSET)

#define LL_ADC_AWD_CR1_CHANNEL_MASK     (ADC_CFGR1_AWD1CH | ADC_CFGR1_JAWD1EN | ADC_CFGR1_AWD1EN | ADC_CFGR1_AWD1SGL)
#define LL_ADC_AWD_CHANNEL_MASK         (LL_ADC_CH_NUMBER_MASK)
#define LL_ADC_AWD_CR23_CHANNEL_MASK    (ADC_AWD2CR_AWDCH)
#define LL_ADC_AWD_CR_ALL_CHANNEL_MASK  (LL_ADC_AWD_CR1_CHANNEL_MASK | LL_ADC_AWD_CR23_CHANNEL_MASK)

#define LL_ADC_AWD_CRX_REGOFFSET_POS    (24UL) /* Position of bits ADC_AWD_CRx_REGOFFSET
                                        in LL_ADC_AWD_CRX_REGOFFSET_MASK */

/* Internal register offset for ADC analog watchdog threshold configuration */
#define LL_ADC_AWD_TR1_REGOFFSET        (LL_ADC_AWD_CR1_REGOFFSET)
#define LL_ADC_AWD_TR2_REGOFFSET        (LL_ADC_AWD_CR2_REGOFFSET)
#define LL_ADC_AWD_TR3_REGOFFSET        (LL_ADC_AWD_CR3_REGOFFSET)
#define LL_ADC_AWD_TRX_REGOFFSET_MASK   (LL_ADC_AWD_TR1_REGOFFSET | LL_ADC_AWD_TR2_REGOFFSET | LL_ADC_AWD_TR3_REGOFFSET)
#define LL_ADC_AWD_TRX_REGOFFSET_POS    (LL_ADC_AWD_CRX_REGOFFSET_POS)  /* Position of bits ADC_TRx_REGOFFSET
                                        in LL_ADC_AWD_TRX_REGOFFSET_MASK */

#define LL_ADC_AWD_TRX_BIT_HIGH_MASK    (0x00010000UL) /* Selection of 1 bit to discriminate threshold high:
                                        mask of bit */
#define LL_ADC_AWD_TRX_BIT_HIGH_POS     (16UL)         /* Selection of 1 bit to discriminate threshold high:
                                        position of bit */
#define LL_ADC_AWD_TRX_BIT_HIGH_SHIFT4  (LL_ADC_AWD_TRX_BIT_HIGH_POS - 4UL) /* Shift of bit ADC_AWD_TRX_BIT_HIGH
                                        to position to perform a shift of 4 ranks */

/* Internal mask for ADC offset: Internal register offset for ADC offset number configuration */
#define LL_ADC_OFR1_REGOFFSET           (0x00000000UL)
#define LL_ADC_OFR2_REGOFFSET           (0x00000001UL)
#define LL_ADC_OFR3_REGOFFSET           (0x00000002UL)
#define LL_ADC_OFR4_REGOFFSET           (0x00000003UL)
#define LL_ADC_OFRX_REGOFFSET_MASK      (LL_ADC_OFR1_REGOFFSET\
                                         | LL_ADC_OFR2_REGOFFSET | LL_ADC_OFR3_REGOFFSET | LL_ADC_OFR4_REGOFFSET)

#define LL_ADC_GAIN_COMPENSATION_DIV    (4096UL) /* ADC divisor for gain compensation coefficient */

/* ADC registers bits groups */
#define LL_ADC_CR_BITS_PROPERTY_RS      (ADC_CR_ADCAL | ADC_CR_JADSTP | ADC_CR_ADSTP | ADC_CR_JADSTART \
                                         | ADC_CR_ADSTART | ADC_CR_ADDIS | ADC_CR_ADEN) /* ADC register CR bits with
                                        HW property "rs": Software can read as well as set these bitfields,
                                        writing '0' has no effect on the bit value. */

/* Internal mask for ADC channel internal path */
#define LL_ADC_COMMON_PATH_INTERNAL_MASK (ADCC_CCR_VREFEN | ADCC_CCR_TSEN)  /*!< ADC measurement path
                                        to internal channel mask in LL_ADC_CHANNEL bitfield */
#define LL_ADC_PATH_INTERNAL_POS        (16UL) /*!< ADC measurement path to internal channel position
                                        in LL_ADC_CHANNEL_x bitfield */
#define LL_ADC_PATH_INTERNAL_MASK       (LL_ADC_PATH_INTERNAL_OR_MASK << LL_ADC_PATH_INTERNAL_POS) /*!< ADC measurement
                                        path to internal channel mask in LL_ADC_CHANNEL bitfield */

/* ADC internal channels related definitions */
/* Internal voltage reference VrefInt */
#define LL_ADC_VREFINT_CAL_ADDR         ((const uint16_t*) (0x08FFF810UL)) /* Internal voltage reference, address of
                                        parameter VREFINT_CAL: On this STM32 series, VrefInt ADC raw data acquired at
                                        Vref+ = LL_ADC_VREFINT_CAL_VREF (tolerance: +-10 mVolt). */
#define LL_ADC_VREFINT_CAL_VREF         (3300UL)                     /* Analog voltage reference (Vref+) value with
                                        which VrefInt has been calibrated in production
                                        (tolerance: +-10 mVolt) (unit: mVolt). */
/* Temperature sensor */
#define LL_ADC_TEMPSENSOR_CAL1_ADDR     ((const uint16_t*) (0x08FFF814UL)) /* Internal temperature sensor, address of
                                        parameter TS_CAL1: On this STM32 series, temperature sensor ADC raw data
                                        acquired at temperature LL_ADC_TEMPSENSOR_CAL1_TEMP,
                                        Vref+ = LL_ADC_TEMPSENSOR_CAL_VREF (tolerance: +-10 mVolt). */
#define LL_ADC_TEMPSENSOR_CAL2_ADDR     ((const uint16_t*) (0x08FFF818UL)) /* Internal temperature sensor, address of
                                        parameter TS_CAL2: On this STM32 series, temperature sensor ADC raw data
                                        acquired at temperature LL_ADC_TEMPSENSOR_CAL2_TEMP,
                                        Vref+ = LL_ADC_TEMPSENSOR_CAL_VREF (tolerance: +-10 mVolt). */
#define LL_ADC_TEMPSENSOR_CAL1_TEMP     (30L) /* Internal temperature sensor, temperature
                                        at which temperature sensor has been calibrated in production for data
                                        into LL_ADC_TEMPSENSOR_CAL1_ADDR (tolerance: +-5 DegC) (unit: DegC). */
#define LL_ADC_TEMPSENSOR_CAL2_TEMP     (140L) /* Internal temperature sensor, temperature
                                        at which temperature sensor has been calibrated in production for data
                                        into LL_ADC_TEMPSENSOR_CAL2_ADDR (tolerance: +-5 DegC) (unit: DegC). */
#define LL_ADC_TEMPSENSOR_CAL_VREF      (3300UL) /* Analog voltage reference (Vref+) value
                                        with which temperature sensor has been calibrated in production
                                        (tolerance: +-10 mVolt) (unit: mVolt). */
#define LL_ADC_TEMPSENSOR_CAL_VREFANALOG LL_ADC_TEMPSENSOR_CAL_VREF /* Legacy definition of temp. sensor calibration */

/**
  * @}
  */

/* Private macros ----------------------------------------------------------------------------------------------------*/
/** @defgroup ADC_LL_Private_Macros ADC Private Macros
  * @{
  */

/**
  * @brief  Driver macro reserved for internal use: isolate bits with the
  *         selected mask and shift them to the register LSB
  *         (shift mask on register position bit 0).
  * @param  bits Bits in register 32 bits
  * @param  mask Mask in register 32 bits
  * @retval Bits in register 32 bits
  */
#define LL_ADC_MASK_SHIFT(bits, mask) \
  (((bits) & (mask)) >> STM32_POSITION_VAL((mask)))

/**
  * @brief  Driver macro reserved for internal use: set a pointer to
  *         a register from a register basis from which an offset
  *         is applied.
  * @param  reg Register basis from which the offset is applied.
  * @param  reg_offset Offset to be applied (unit: number of registers).
  * @retval Pointer to register address
  */
#define LL_ADC_PTR_REG_OFFSET(reg, reg_offset) \
  ((__IO uint32_t *)((uint32_t) ((uint32_t)(&(reg)) + ((reg_offset) << 2UL))))

/**
  * @brief Helper macro to access the ADC instance corresponding index in channel
  *        look up table LL_ADC_CHANNEL_LUT[].
  * @param channel ADC channel
  * @retval look-up table index
  */
#define LL_ADC_CHANNEL_LUT_INDEX(channel) \
  ((LL_ADC_CHANNEL_INTERNAL_TO_EXTERNAL(channel) == (LL_ADC_CHANNEL_0   )) ?  0UL : \
   (LL_ADC_CHANNEL_INTERNAL_TO_EXTERNAL(channel) == (LL_ADC_CHANNEL_1   )) ?  1UL : \
   (LL_ADC_CHANNEL_INTERNAL_TO_EXTERNAL(channel) == (LL_ADC_CHANNEL_2   )) ?  2UL : \
   (LL_ADC_CHANNEL_INTERNAL_TO_EXTERNAL(channel) == (LL_ADC_CHANNEL_3   )) ?  3UL : \
   (LL_ADC_CHANNEL_INTERNAL_TO_EXTERNAL(channel) == (LL_ADC_CHANNEL_4   )) ?  4UL : \
   (LL_ADC_CHANNEL_INTERNAL_TO_EXTERNAL(channel) == (LL_ADC_CHANNEL_5   )) ?  5UL : \
   (LL_ADC_CHANNEL_INTERNAL_TO_EXTERNAL(channel) == (LL_ADC_CHANNEL_6   )) ?  6UL : \
   (LL_ADC_CHANNEL_INTERNAL_TO_EXTERNAL(channel) == (LL_ADC_CHANNEL_7   )) ?  7UL : \
   (LL_ADC_CHANNEL_INTERNAL_TO_EXTERNAL(channel) == (LL_ADC_CHANNEL_8   )) ?  8UL : \
   (LL_ADC_CHANNEL_INTERNAL_TO_EXTERNAL(channel) == (LL_ADC_CHANNEL_9   )) ?  9UL : \
   (LL_ADC_CHANNEL_INTERNAL_TO_EXTERNAL(channel) == (LL_ADC_CHANNEL_10  )) ? 10UL : \
   (LL_ADC_CHANNEL_INTERNAL_TO_EXTERNAL(channel) == (LL_ADC_CHANNEL_11  )) ? 11UL : \
   (LL_ADC_CHANNEL_INTERNAL_TO_EXTERNAL(channel) == (LL_ADC_CHANNEL_12  )) ? 12UL : \
   (LL_ADC_CHANNEL_INTERNAL_TO_EXTERNAL(channel) == (LL_ADC_CHANNEL_13  )) ? 13UL : \
   (LL_ADC_CHANNEL_INTERNAL_TO_EXTERNAL(channel) == (LL_ADC_CHANNEL_NONE)) ? 14UL : \
   (LL_ADC_CHANNEL_INTERNAL_TO_EXTERNAL(channel) == (LL_ADC_CHANNEL_ALL )) ? 15UL : \
   14UL)

/**
  * @brief Helper macro to remap internal channels to their alternative channel number
  *        when they are shared on several instances
  *       (set from main instance definition to alternate instance definition).
  * @param instance ADC instance
  * @param channel ADC channel
  * @retval Remapped channel if applicable, else same channel as input
  */
#define LL_ADC_REMAP_CHANNEL_INTERNAL_SET(instance, channel) (channel)

/**
  * @brief Helper macro to remap internal channels to their alternative channel number
  *        when they are shared on several instances
  *       (set from alternate instance definition to main instance definition).
  * @param instance ADC instance
  * @param channel ADC channel
  * @retval Remapped channel if applicable, else same channel as input
  */
#define LL_ADC_REMAP_CHANNEL_INTERNAL_GET(instance, channel) (channel)

/**
  * @}
  */

