MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_adc.h
/* Exported types ----------------------------------------------------------------------------------------------------*/

/* Exported constants ------------------------------------------------------------------------------------------------*/
/** @defgroup ADC_LL_Exported_Constants LL ADC Constants
  * @{
  */

/** @defgroup ADC_LL_EC_HELPER_MACRO  Definitions of constants used by helper macro
  * @{
  */
#define LL_ADC_TEMPERATURE_CALC_ERROR   ((int16_t)0x7FFF) /*!< Temperature calculation error using helper macro
                                        @ref LL_ADC_CALC_TEMPERATURE(), due to issue on calibration parameters.
                                        This value is coded on 16 bits (to fit on signed word or double word)
                                        and corresponds to an inconsistent temperature value. */
/**
  * @}
  */

/** @defgroup ADC_LL_EC_FLAG ADC flags
  * @brief    Flags defines which can be used with LL_ADC_ReadReg function
  * @{
  */
#define LL_ADC_FLAG_ADRDY               ADC_ISR_ADRDY      /*!< ADC flag instance ready */
#define LL_ADC_FLAG_EOC                 ADC_ISR_EOC        /*!< ADC flag group regular end of unitary conversion */
#define LL_ADC_FLAG_EOS                 ADC_ISR_EOS        /*!< ADC flag group regular end of sequence conversions */
#define LL_ADC_FLAG_OVR                 ADC_ISR_OVR        /*!< ADC flag group regular overrun */
#define LL_ADC_FLAG_EOSMP               ADC_ISR_EOSMP      /*!< ADC flag group regular end of sampling phase */
#define LL_ADC_FLAG_JEOC                ADC_ISR_JEOC       /*!< ADC flag group injected end of unitary conversion */
#define LL_ADC_FLAG_JEOS                ADC_ISR_JEOS       /*!< ADC flag group injected end of sequence conversions */
#define LL_ADC_FLAG_AWD1                ADC_ISR_AWD1       /*!< ADC flag analog watchdog 1 out of window event */
#define LL_ADC_FLAG_AWD2                ADC_ISR_AWD2       /*!< ADC flag analog watchdog 2 out of window event */
#define LL_ADC_FLAG_AWD3                ADC_ISR_AWD3       /*!< ADC flag analog watchdog 3 out of window event */
#define LL_ADC_FLAG_LDORDY              ADC_ISR_LDORDY     /*!< ADC flag internal voltage regulator (LDO) ready */

#define LL_ADC_FLAG_ALL                 (LL_ADC_FLAG_ADRDY \
                                         | LL_ADC_FLAG_EOC | LL_ADC_FLAG_EOS | LL_ADC_FLAG_OVR | LL_ADC_FLAG_EOSMP \
                                         | LL_ADC_FLAG_JEOC | LL_ADC_FLAG_JEOS \
                                         | LL_ADC_FLAG_AWD1 | LL_ADC_FLAG_AWD2 | LL_ADC_FLAG_AWD3 \
                                         | LL_ADC_FLAG_LDORDY) /*!< ADC all flags */

#define LL_ADC_FLAG_ADRDY_MST           ADCC_CSR_ADRDY_MST  /*!< ADC flag multimode master instance ready */
#define LL_ADC_FLAG_ADRDY_SLV           ADCC_CSR_ADRDY_SLV  /*!< ADC flag multimode slave instance ready */
#define LL_ADC_FLAG_EOC_MST             ADCC_CSR_EOC_MST    /*!< ADC flag multimode master group regular end
                                        of unitary conversion */
#define LL_ADC_FLAG_EOC_SLV             ADCC_CSR_EOC_SLV    /*!< ADC flag multimode slave group regular end
                                        of unitary conversion */
#define LL_ADC_FLAG_EOS_MST             ADCC_CSR_EOS_MST    /*!< ADC flag multimode master group regular end
                                        of sequence conversions */
#define LL_ADC_FLAG_EOS_SLV             ADCC_CSR_EOS_SLV    /*!< ADC flag multimode slave group regular end
                                        of sequence conversions */
#define LL_ADC_FLAG_OVR_MST             ADCC_CSR_OVR_MST    /*!< ADC flag multimode master group regular overrun */
#define LL_ADC_FLAG_OVR_SLV             ADCC_CSR_OVR_SLV    /*!< ADC flag multimode slave group regular overrun */
#define LL_ADC_FLAG_EOSMP_MST           ADCC_CSR_EOSMP_MST  /*!< ADC flag multimode master group regular end
                                        of sampling phase */
#define LL_ADC_FLAG_EOSMP_SLV           ADCC_CSR_EOSMP_SLV  /*!< ADC flag multimode slave group regular end
                                        of sampling phase */
#define LL_ADC_FLAG_JEOC_MST            ADCC_CSR_JEOC_MST   /*!< ADC flag multimode master group injected end
                                        of unitary conversion */
#define LL_ADC_FLAG_JEOC_SLV            ADCC_CSR_JEOC_SLV   /*!< ADC flag multimode slave group injected end
                                        of unitary conversion */
#define LL_ADC_FLAG_JEOS_MST            ADCC_CSR_JEOS_MST   /*!< ADC flag multimode master group injected end
                                        of sequence conversions */
#define LL_ADC_FLAG_JEOS_SLV            ADCC_CSR_JEOS_SLV   /*!< ADC flag multimode slave group injected end
                                        of sequence conversions */
#define LL_ADC_FLAG_AWD1_MST            ADCC_CSR_AWD1_MST   /*!< ADC flag multimode master analog watchdog 1
                                        of the ADC master */
#define LL_ADC_FLAG_AWD1_SLV            ADCC_CSR_AWD1_SLV   /*!< ADC flag multimode slave analog watchdog 1
                                        of the ADC slave */
#define LL_ADC_FLAG_AWD2_MST            ADCC_CSR_AWD2_MST   /*!< ADC flag multimode master analog watchdog 2
                                        of the ADC master */
#define LL_ADC_FLAG_AWD2_SLV            ADCC_CSR_AWD2_SLV   /*!< ADC flag multimode slave analog watchdog 2
                                        of the ADC slave */
#define LL_ADC_FLAG_AWD3_MST            ADCC_CSR_AWD3_MST   /*!< ADC flag multimode master analog watchdog 3
                                        of the ADC master */
#define LL_ADC_FLAG_AWD3_SLV            ADCC_CSR_AWD3_SLV   /*!< ADC flag multimode slave analog watchdog 3
                                        of the ADC slave */
#define LL_ADC_FLAG_LDORDY_MST          ADCC_CSR_LDORDY_MST /*!< ADC flag internal voltage regulator (LDO) ready
                                        of the ADC master */
#define LL_ADC_FLAG_LDORDY_SLV          ADCC_CSR_LDORDY_SLV /*!< ADC flag internal voltage regulator (LDO) ready
                                        of the ADC slave */
/**
  * @}
  */

/** @defgroup ADC_LL_EC_IT ADC interruptions for configuration (interruption enable or disable)
  * @brief    IT defines which can be used with LL_ADC_ReadReg and  LL_ADC_WriteReg functions
  * @{
  */
#define LL_ADC_IT_ADRDY                 ADC_IER_ADRDYIE    /*!< ADC interruption instance ready */
#define LL_ADC_IT_EOC                   ADC_IER_EOCIE      /*!< ADC interruption group regular end of
                                        unitary conversion */
#define LL_ADC_IT_EOS                   ADC_IER_EOSIE      /*!< ADC interruption group regular end of
                                        sequence conversions */
#define LL_ADC_IT_OVR                   ADC_IER_OVRIE      /*!< ADC interruption group regular overrun */
#define LL_ADC_IT_EOSMP                 ADC_IER_EOSMPIE    /*!< ADC interruption group regular end of
                                        sampling phase */
#define LL_ADC_IT_JEOC                  ADC_IER_JEOCIE     /*!< ADC interruption group injected end of
                                        unitary conversion */
#define LL_ADC_IT_JEOS                  ADC_IER_JEOSIE     /*!< ADC interruption group injected end of
                                        sequence conversions */
#define LL_ADC_IT_AWD1                  ADC_IER_AWD1IE     /*!< ADC interruption analog watchdog 1 */
#define LL_ADC_IT_AWD2                  ADC_IER_AWD2IE     /*!< ADC interruption analog watchdog 2 */
#define LL_ADC_IT_AWD3                  ADC_IER_AWD3IE     /*!< ADC interruption analog watchdog 3 */
#define LL_ADC_IT_LDORDY                ADC_IER_LDORDYIE   /*!< ADC interruption ADC internal voltage regulator(LDO) */

#define LL_ADC_IT_ALL                   (LL_ADC_IT_ADRDY \
                                         | LL_ADC_IT_EOC | LL_ADC_IT_EOS | LL_ADC_IT_OVR | LL_ADC_IT_EOSMP \
                                         | LL_ADC_IT_JEOC | LL_ADC_IT_JEOS \
                                         | LL_ADC_IT_AWD1 | LL_ADC_IT_AWD2 | LL_ADC_IT_AWD3 \
                                         | LL_ADC_IT_LDORDY) /*!< ADC all interruptions */
/**
  * @}
  */

