MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_adc.h
/** @defgroup ADC_LL_EC_REGISTERS  ADC registers compliant with specific purpose
  * @{
  */
/* List of ADC registers intended to be used (most commonly) with             */
/* DMA transfer.                                                              */
/* Refer to function @ref LL_ADC_DMA_GetRegAddr().                            */
#define LL_ADC_DMA_REG_REGULAR_DATA     (0x00000000UL)    /* ADC group regular conversion data register
                                        (corresponding to register DR) to be used with ADC configured in independent
                                        mode.
                                        Without DMA transfer, register accessed by LL function
                                        @ref LL_ADC_REG_ReadConversionData32() and
                                        other functions @ref LL_ADC_REG_ReadConversionDatax() */
#if defined(ADC_MULTIMODE_SUPPORT)
#define LL_ADC_DMA_REG_MM_REGULAR_PACK_DATA (0x00000001UL)  /* ADC multimode group regular conversion data register
                                        (corresponding to register CDR) to be used with ADC configured in multimode
                                        (availability depending on STM32 devices).
                                        Register with data packing: ADC master and slave data are concatenated
                                        in a single register, therefore constraint on data width.
                                        Data width depends on multimode configuration (refer to literals
                                        LL_ADC_MULTI_REG_DMA_RES_x).
                                        Without DMA transfer, register accessed by LL function
                                        @ref LL_ADC_REG_ReadMultiConversionData32() */

#define LL_ADC_DMA_REG_MM_REGULAR_UNPACK_DATA (0x00000002UL) /* ADC multimode group regular conversion data register
                                        (corresponding to register CDR2) to be used with ADC configured in multimode
                                        (availability depending on STM32 devices).
                                        Register without data packing: ADC master and slave data are alternatively set
                                        in full register width 32 bits, therefore no constraint on data width.
                                        Register intended to be used only with DMA transfer. */
#endif /* ADC_MULTIMODE_SUPPORT */
/**
  * @}
  */

/** @defgroup ADC_LL_EC_COMMON_PATH_INTERNAL  ADC common - Measurement path to internal channels
  * @{
  */
/* Note: Other measurement paths to internal channels can be available (connections to other peripherals).
         If not listed below, they do not require any specific path enable. In this case, access to measurement path
         is done only by selecting the corresponding ADC internal channel. */
#define LL_ADC_PATH_INTERNAL_NONE       (0x00000000UL)     /*!< ADC measurement paths all disabled */
#define LL_ADC_PATH_INTERNAL_VREFINT    (ADCC_CCR_VREFEN)  /*!< ADC measurement path to internal channel VrefInt */
#define LL_ADC_PATH_INTERNAL_TEMPSENSOR (ADCC_CCR_TSEN)    /*!< ADC measurement path to internal channel
                                        temperature sensor */
/**
  * @}
  */

/** @defgroup ADC_LL_EC_RESOLUTION  ADC instance - Resolution
  * @{
  */
#define LL_ADC_RESOLUTION_12B           (0x00000000UL) /*!< ADC resolution 12 bit */
#define LL_ADC_RESOLUTION_10B           (ADC_CFGR1_RES_0)  /*!< ADC resolution 10 bit */
#define LL_ADC_RESOLUTION_8B            (ADC_CFGR1_RES_1)  /*!< ADC resolution 8 bit */
#define LL_ADC_RESOLUTION_6B            (ADC_CFGR1_RES_1 | ADC_CFGR1_RES_0) /*!< ADC resolution 6 bit */
/**
  * @}
  */

/** @defgroup ADC_LL_EC_LEFT_BIT_SHIFT   ADC left bit shift
  * @{
  */
#define LL_ADC_LEFT_BIT_SHIFT_NONE      (0x00000000UL)                              /*!< ADC conversion data not
                                        shifted (alignment right) */
#define LL_ADC_LEFT_BIT_SHIFT_1         (ADC_CFGR2_LSHIFT_0)                        /*!< ADC conversion data shift
                                        left of 1 bit (data multiplied by 2). */
#define LL_ADC_LEFT_BIT_SHIFT_2         (ADC_CFGR2_LSHIFT_1)                        /*!< ADC conversion data shift
                                        left of 2 bits (data multiplied by 4). */
#define LL_ADC_LEFT_BIT_SHIFT_3         (ADC_CFGR2_LSHIFT_1 | ADC_CFGR2_LSHIFT_0)   /*!< ADC conversion data shift
                                        left of 3 bits (data multiplied by 8). */
#define LL_ADC_LEFT_BIT_SHIFT_4         (ADC_CFGR2_LSHIFT_2)                        /*!< ADC conversion data shift
                                        left of 4 bits (data multiplied by 16). */
#define LL_ADC_LEFT_BIT_SHIFT_5         (ADC_CFGR2_LSHIFT_2 | ADC_CFGR2_LSHIFT_0)   /*!< ADC conversion data shift
                                        left of 5 bits (data multiplied by 32). */
#define LL_ADC_LEFT_BIT_SHIFT_6         (ADC_CFGR2_LSHIFT_2 | ADC_CFGR2_LSHIFT_1)   /*!< ADC conversion data shift
                                        left of 6 bits (data multiplied by 64). */
#define LL_ADC_LEFT_BIT_SHIFT_7         (ADC_CFGR2_LSHIFT_2 | ADC_CFGR2_LSHIFT_1 \
                                         | ADC_CFGR2_LSHIFT_0)                      /*!< ADC conversion data shift
                                        left of 7 bits (data multiplied by 128). */
#define LL_ADC_LEFT_BIT_SHIFT_8         (ADC_CFGR2_LSHIFT_3)                        /*!< ADC conversion data shift
                                        left of 8 bits (data multiplied by 256). */
#define LL_ADC_LEFT_BIT_SHIFT_9         (ADC_CFGR2_LSHIFT_3 | ADC_CFGR2_LSHIFT_0)   /*!< ADC conversion data shift
                                        left of 9 bits (data multiplied by 512). */
#define LL_ADC_LEFT_BIT_SHIFT_10        (ADC_CFGR2_LSHIFT_3 | ADC_CFGR2_LSHIFT_1)   /*!< ADC conversion data shift
                                        left of 10 bits (data multiplied by 1024). */
#define LL_ADC_LEFT_BIT_SHIFT_11        (ADC_CFGR2_LSHIFT_3 | ADC_CFGR2_LSHIFT_1 \
                                         | ADC_CFGR2_LSHIFT_0)                      /*!< ADC conversion data shift
                                        left of 11 bits (data multiplied by 2048). */
#define LL_ADC_LEFT_BIT_SHIFT_12        (ADC_CFGR2_LSHIFT_3 | ADC_CFGR2_LSHIFT_2)   /*!< ADC conversion data shift
                                        left of 12 bits (data multiplied by 4096). */
#define LL_ADC_LEFT_BIT_SHIFT_13        (ADC_CFGR2_LSHIFT_3 | ADC_CFGR2_LSHIFT_2 \
                                         | ADC_CFGR2_LSHIFT_0)                      /*!< ADC conversion data shift
                                        left of 13 bits (data multiplied by 8192). */
#define LL_ADC_LEFT_BIT_SHIFT_14        (ADC_CFGR2_LSHIFT_3 | ADC_CFGR2_LSHIFT_2 \
                                         | ADC_CFGR2_LSHIFT_1)                      /*!< ADC conversion data shift
                                        left of 14 bits (data multiplied by 16384). */
#define LL_ADC_LEFT_BIT_SHIFT_15        (ADC_CFGR2_LSHIFT_3 | ADC_CFGR2_LSHIFT_2 \
                                         | ADC_CFGR2_LSHIFT_1 | ADC_CFGR2_LSHIFT_0) /*!< ADC conversion data shift
                                        left of 15 bits (data multiplied by 32768). */
/**
  * @}
  */

/** @defgroup ADC_LL_EC_LP_MODE  ADC instance - Low power mode
  * @{
  */
#define LL_ADC_LP_MODE_NONE             (0x00000000UL)      /*!< No ADC low power mode activated */
#define LL_ADC_LP_AUTOWAIT              (ADC_CFGR1_AUTDLY)  /*!< ADC low power mode auto delay: Dynamic low power
                                        mode, ADC conversions are performed only when necessary (when previous
                                        ADC conversion data is read). See description with
                                        function @ref LL_ADC_SetLowPowerMode(). */
/**
  * @}
  */

/** @defgroup ADC_LL_EC_SAMPLING_MODE  ADC instance - Sampling mode
  * @{
  */
#define LL_ADC_SAMPLING_MODE_NORMAL     (0x00000000UL) /*!< ADC conversions sampling phase duration
                                        is defined using @ref ADC_LL_EC_CHANNEL_SAMPLINGTIME. */
#define LL_ADC_SAMPLING_MODE_BULB       (ADC_CFGR2_BULB) /*!< ADC conversions sampling phase starts immediately
                                        after end of conversion, stops upon trigger event.
                                        Note: first conversion is using minimal sampling time
                                             (see @ref ADC_LL_EC_CHANNEL_SAMPLINGTIME).
                                        Note: Usable only if conversions from ADC group regular (not ADC group injected)
                                              and not in continuous mode. */
#define LL_ADC_SAMPLING_MODE_TRIGGER_CTRL (ADC_CFGR2_SMPTRIG) /*!< ADC conversions sampling phase is controlled
                                        by trigger events: trigger rising edge starts sampling,
                                        trigger falling edge stops sampling and start conversion.
                                        Note: Usable only if conversions from ADC group regular (not ADC group injected)
                                              and not in continuous mode. */
/**
  * @}
  */

/** @defgroup ADC_LL_EC_GROUPS  ADC instance - Groups
  * @{
  */
#define LL_ADC_GROUP_REGULAR            (0x00000001UL) /*!< ADC group regular (available on all STM32 devices) */
#define LL_ADC_GROUP_INJECTED           (0x00000002UL) /*!< ADC group injected (not available on all STM32 devices)*/
#define LL_ADC_GROUP_REGULAR_INJECTED   (0x00000003UL) /*!< ADC both groups regular and injected */
#define LL_ADC_GROUP_NONE               (0x00000000UL) /*!< ADC group none */
/**
  * @}
  */

