MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_adc.h
/** @defgroup ADC_LL_EC_CHANNEL  ADC instance - Channel number
  * @{
  */
#define LL_ADC_CHANNEL_0                (0UL \
                                         | LL_ADC_CH_EXTERNAL | LL_ADC_PATH_INTERNAL_NONE) /*!< Channel ADCx_IN0 */
#define LL_ADC_CHANNEL_1                (1UL \
                                         | LL_ADC_CH_EXTERNAL | LL_ADC_PATH_INTERNAL_NONE) /*!< Channel ADCx_IN1 */
#define LL_ADC_CHANNEL_2                (2UL \
                                         | LL_ADC_CH_EXTERNAL | LL_ADC_PATH_INTERNAL_NONE) /*!< Channel ADCx_IN2 */
#define LL_ADC_CHANNEL_3                (3UL \
                                         | LL_ADC_CH_EXTERNAL | LL_ADC_PATH_INTERNAL_NONE) /*!< Channel ADCx_IN3 */
#define LL_ADC_CHANNEL_4                (4UL \
                                         | LL_ADC_CH_EXTERNAL | LL_ADC_PATH_INTERNAL_NONE) /*!< Channel ADCx_IN4 */
#define LL_ADC_CHANNEL_5                (5UL \
                                         | LL_ADC_CH_EXTERNAL | LL_ADC_PATH_INTERNAL_NONE) /*!< Channel ADCx_IN5 */
#define LL_ADC_CHANNEL_6                (6UL \
                                         | LL_ADC_CH_EXTERNAL | LL_ADC_PATH_INTERNAL_NONE) /*!< Channel ADCx_IN6 */
#define LL_ADC_CHANNEL_7                (7UL \
                                         | LL_ADC_CH_EXTERNAL | LL_ADC_PATH_INTERNAL_NONE) /*!< Channel ADCx_IN7 */
#define LL_ADC_CHANNEL_8                (8UL \
                                         | LL_ADC_CH_EXTERNAL | LL_ADC_PATH_INTERNAL_NONE) /*!< Channel ADCx_IN8 */
#define LL_ADC_CHANNEL_9                (9UL \
                                         | LL_ADC_CH_EXTERNAL | LL_ADC_PATH_INTERNAL_NONE) /*!< Channel ADCx_IN9 */
#define LL_ADC_CHANNEL_10               (10UL \
                                         | LL_ADC_CH_EXTERNAL | LL_ADC_PATH_INTERNAL_NONE) /*!< Channel ADCx_IN10 */
#define LL_ADC_CHANNEL_11               (11UL \
                                         | LL_ADC_CH_EXTERNAL | LL_ADC_PATH_INTERNAL_NONE) /*!< Channel ADCx_IN11 */
#define LL_ADC_CHANNEL_12               (12UL \
                                         | LL_ADC_CH_EXTERNAL | LL_ADC_PATH_INTERNAL_NONE) /*!< Channel ADCx_IN12 */
#define LL_ADC_CHANNEL_13               (13UL \
                                         | LL_ADC_CH_EXTERNAL | LL_ADC_PATH_INTERNAL_NONE) /*!< Channel ADCx_IN13 */
#define LL_ADC_CHANNEL_VREFINT          (13UL \
                                         | LL_ADC_CH_INTERNAL_ADC1 \
                                         | LL_ADC_PATH_INTERNAL_VREFINT) /*!< ADC channel to VrefInt (internal
                                        voltage reference).*/
#define LL_ADC_CHANNEL_TEMPSENSOR       (12UL \
                                         | LL_ADC_CH_INTERNAL_ADC1 \
                                         | LL_ADC_PATH_INTERNAL_TEMPSENSOR) /*!< ADC internal channel */
#define LL_ADC_CHANNEL_NONE             (ADC_CH_NONE_NUMBER      \
                                         | LL_ADC_CH_EXTERNAL       \
                                         | LL_ADC_PATH_INTERNAL_NONE) /*!< ADC no channel */
#define LL_ADC_CHANNEL_ALL              (ADC_CH_ALL_NUMBER       \
                                         | LL_ADC_CH_EXTERNAL       \
                                         | LL_ADC_PATH_INTERNAL_NONE) /*!< ADC all channels */
/**
  * @}
  */

/** @defgroup ADC_LL_EC_REG_TRIGGER_SOURCE  ADC group regular - Trigger source
  * @note     Triggers from timers capture compare are input capture or output capture.
  * @{
  */
#define LL_ADC_REG_TRIG_SOFTWARE        (0x00000000UL) /*!< ADC group regular conversion trigger internal: SW start. */
#define LL_ADC_REG_TRIG_EXTI11          (LL_ADC_REG_TRIG_EDGE_DEFAULT) /*!< ADC group regular conversion
                                        trigger from periph: EXTI line 11 */
#define LL_ADC_REG_TRIG_TIM1_OC1        (ADC_CFGR1_EXTSEL_0 \
                                         | LL_ADC_REG_TRIG_EDGE_DEFAULT) /*!< ADC group regular conversion
                                        trigger from periph: TIM1 channel 1 */
#define LL_ADC_REG_TRIG_TIM1_OC2        (ADC_CFGR1_EXTSEL_1 \
                                         | LL_ADC_REG_TRIG_EDGE_DEFAULT) /*!< ADC group regular conversion
                                        trigger from periph: TIM1 channel 2 */
#define LL_ADC_REG_TRIG_TIM1_OC3        (ADC_CFGR1_EXTSEL_1 | ADC_CFGR1_EXTSEL_0 \
                                         | LL_ADC_REG_TRIG_EDGE_DEFAULT) /*!< ADC group regular conversion
                                        trigger from periph: TIM1 channel 3 */
#define LL_ADC_REG_TRIG_TIM1_TRGO       (ADC_CFGR1_EXTSEL_2 \
                                         | LL_ADC_REG_TRIG_EDGE_DEFAULT) /*!< ADC group regular conversion
                                        trigger from periph: TIM1 TRGO */
#define LL_ADC_REG_TRIG_TIM1_TRGO2      (ADC_CFGR1_EXTSEL_2 | ADC_CFGR1_EXTSEL_0 \
                                         | LL_ADC_REG_TRIG_EDGE_DEFAULT) /*!< ADC group regular conversion
                                        trigger from periph: TIM1 TRGO2 */
#define LL_ADC_REG_TRIG_TIM2_OC2        (ADC_CFGR1_EXTSEL_2 | ADC_CFGR1_EXTSEL_1 \
                                         | LL_ADC_REG_TRIG_EDGE_DEFAULT) /*!< ADC group regular conversion
                                        trigger from periph: TIM2 channel 2 */
#define LL_ADC_REG_TRIG_TIM2_TRGO       (ADC_CFGR1_EXTSEL_2 | ADC_CFGR1_EXTSEL_1 \
                                         | ADC_CFGR1_EXTSEL_0 \
                                         | LL_ADC_REG_TRIG_EDGE_DEFAULT) /*!< ADC group regular conversion
                                        trigger from periph: TIM2 TRGO */
#if defined(STM32C591xx) || defined(STM32C593xx) || defined(STM32C5A3xx)
#define LL_ADC_REG_TRIG_TIM3_TRGO       (ADC_CFGR1_EXTSEL_3 \
                                         | LL_ADC_REG_TRIG_EDGE_DEFAULT) /*!< ADC group regular conversion
                                        trigger from periph: TIM3 TRGO */
#define LL_ADC_REG_TRIG_TIM4_TRGO       (ADC_CFGR1_EXTSEL_3 | ADC_CFGR1_EXTSEL_0 \
                                         | LL_ADC_REG_TRIG_EDGE_DEFAULT) /*!< ADC group regular conversion
                                        trigger from periph: TIM4 TRGO */
#endif /* STM32C591xx, STM32C593xx, STM32C5A3xx */
#define LL_ADC_REG_TRIG_TIM5_OC4        (ADC_CFGR1_EXTSEL_3 | ADC_CFGR1_EXTSEL_1 \
                                         | LL_ADC_REG_TRIG_EDGE_DEFAULT) /*!< ADC group regular conversion
                                        trigger from periph: TIM5 channel 4 */
#define LL_ADC_REG_TRIG_TIM5_TRGO       (ADC_CFGR1_EXTSEL_3 | ADC_CFGR1_EXTSEL_1 | ADC_CFGR1_EXTSEL_0 \
                                         | LL_ADC_REG_TRIG_EDGE_DEFAULT) /*!< ADC group regular conversion
                                        trigger from periph: TIM15 TRGO */
#define LL_ADC_REG_TRIG_TIM6_TRGO       (ADC_CFGR1_EXTSEL_3 | ADC_CFGR1_EXTSEL_2 \
                                         | LL_ADC_REG_TRIG_EDGE_DEFAULT) /*!< ADC group regular conversion
                                        trigger from periph: TIM6 TRGO */
#define LL_ADC_REG_TRIG_TIM8_TRGO       (ADC_CFGR1_EXTSEL_3 | ADC_CFGR1_EXTSEL_2 | ADC_CFGR1_EXTSEL_0 \
                                         | LL_ADC_REG_TRIG_EDGE_DEFAULT) /*!< ADC group regular conversion
                                        trigger from periph: TIM8 TRGO */
#define LL_ADC_REG_TRIG_TIM8_TRGO2      (ADC_CFGR1_EXTSEL_3 | ADC_CFGR1_EXTSEL_2 | ADC_CFGR1_EXTSEL_1 \
                                         | LL_ADC_REG_TRIG_EDGE_DEFAULT) /*!< ADC group regular conversion
                                        trigger from periph: TIM8 TRGO2 */
#define LL_ADC_REG_TRIG_TIM15_TRGO      (ADC_CFGR1_EXTSEL_3 | ADC_CFGR1_EXTSEL_2 \
                                         | ADC_CFGR1_EXTSEL_1 | ADC_CFGR1_EXTSEL_0 \
                                         | LL_ADC_REG_TRIG_EDGE_DEFAULT) /*!< ADC group regular conversion
                                        trigger from periph: TIM15 TRGO */
#if defined(LPTIM1)
#define LL_ADC_REG_TRIG_LPTIM1_OC1      (ADC_CFGR1_EXTSEL_4 \
                                         | LL_ADC_REG_TRIG_EDGE_DEFAULT) /*!< ADC group regular conversion
                                        trigger from periph: LPTIM1 channel 1 */
#endif /* LPTIM1 */
#if defined(STM32C591xx) || defined(STM32C593xx) || defined(STM32C5A3xx)
#define LL_ADC_REG_TRIG_TIM3_OC4        (ADC_CFGR1_EXTSEL_4 | ADC_CFGR1_EXTSEL_0 \
                                         | LL_ADC_REG_TRIG_EDGE_DEFAULT) /*!< ADC group regular conversion
                                        trigger from periph: TIM3 channel 4 */
#define LL_ADC_REG_TRIG_TIM4_OC4        (ADC_CFGR1_EXTSEL_4 | ADC_CFGR1_EXTSEL_1 \
                                         | LL_ADC_REG_TRIG_EDGE_DEFAULT) /*!< ADC group regular conversion
                                        trigger from periph: TIM4 channel 4 */
#endif /* STM32C591xx, STM32C593xx, STM32C5A3xx */
/**
  * @}
  */

/** @defgroup ADC_LL_EC_REG_TRIGGER_EDGE  ADC group regular - Trigger edge
  * @{
  */
#define LL_ADC_REG_TRIG_RISING          (ADC_CFGR1_EXTEN_0)   /*!< ADC group regular conversion
                                        trigger polarity set to rising edge */
#define LL_ADC_REG_TRIG_FALLING         (ADC_CFGR1_EXTEN_1)   /*!< ADC group regular conversion
                                        trigger polarity set to falling edge */
#define LL_ADC_REG_TRIG_RISING_FALLING  (ADC_CFGR1_EXTEN_1 | ADC_CFGR1_EXTEN_0)  /*!< ADC group regular conversion
                                        trigger polarity set to both rising and falling edges */
/**
  * @}
  */

/** @defgroup ADC_LL_EC_REG_CONTINUOUS_MODE  ADC group regular - Continuous mode
  * @{
  */
#define LL_ADC_REG_CONV_SINGLE          (0x00000000UL)   /*!< ADC conversions performed in single mode:
                                        conversions start from a trigger, are performed for each channel of
                                        the sequence, then stop. */
#define LL_ADC_REG_CONV_CONTINUOUS      (ADC_CFGR1_CONT) /*!< ADC conversions performed in continuous mode:
                                        conversions start from a trigger, are performed for each channel of
                                        the sequence, then restart automatically. */
/**
  * @}
  */

/** @defgroup ADC_LL_EC_REG_DATA_TRANSFER_MODE  ADC group regular - Data transfer mode of ADC conversion data
  * @{
  */
#define LL_ADC_REG_DR_TRANSFER          (0x00000000UL) /*!< ADC conversions are not transferred (available in
                                        data register only) */
#define LL_ADC_REG_DMA_TRANSFER_NONE    (LL_ADC_REG_DR_TRANSFER) /*!< ADC conversion data are
                                        not transferred by (available in data register only) */
#define LL_ADC_REG_DMA_TRANSFER_LIMITED (ADC_CFGR1_DMNGT_0) /*!< ADC conversion data are transferred by DMA,
                                        in limited mode (one shot mode): DMA transfer requests are stopped
                                        when number of DMA data transfers (number of ADC conversions) is reached.
                                        This ADC mode is intended to be used with DMA mode non-circular. */
#define LL_ADC_REG_DMA_TRANSFER_UNLIMITED (ADC_CFGR1_DMNGT_1 | ADC_CFGR1_DMNGT_0) /*!< ADC conversion data are
                                        transferred by DMA, in unlimited mode: DMA transfer requests are unlimited,
                                        whatever number of DMA data transferred(number of ADC conversions).
                                        This ADC mode is intended to be used with DMA mode circular. */
/**
  * @}
  */

/** @defgroup ADC_LL_EC_REG_OVR_DATA_BEHAVIOR  ADC group regular - Overrun behavior on conversion data
  * @note     Overrun occurs when conversion is completed while conversion data in data register (from previous
  *           conversion) has not been fetched (by CPU or DMA).
  * @{
  */
#define LL_ADC_REG_OVR_DATA_PRESERVED   (0x00000000UL)      /*!< ADC group regular behavior in case of overrun:
                                        data preserved.
                                        Note: an internal FIFO of 8 elements in enabled in this mode. Overrun occurs
                                              when the FIFO overflows. FIFO is emptied by successive reads of
                                              data register. */
#define LL_ADC_REG_OVR_DATA_OVERWRITTEN (ADC_CFGR1_OVRMOD)  /*!< ADC group regular behavior in case of overrun:
                                        data overwritten */
/**
  * @}
  */

/** @defgroup ADC_LL_EC_REG_SEQ_SCAN_LENGTH  ADC group regular - Sequencer scan length
  * @{
  */
#define LL_ADC_REG_SEQ_SCAN_DISABLE        (0x00000000UL) /*!< ADC group regular sequencer disable (equivalent to
                                        sequencer of 1 rank: ADC conversion on only 1 channel) */
#define LL_ADC_REG_SEQ_SCAN_ENABLE_2RANKS  (ADC_SQR1_LEN_0) /*!< ADC group regular sequencer enable
                                        with 2 ranks in the sequence */
#define LL_ADC_REG_SEQ_SCAN_ENABLE_3RANKS  (ADC_SQR1_LEN_1) /*!< ADC group regular sequencer enable
                                        with 3 ranks in the sequence */
#define LL_ADC_REG_SEQ_SCAN_ENABLE_4RANKS  (ADC_SQR1_LEN_1 | ADC_SQR1_LEN_0) /*!< ADC group regular sequencer enable
                                        with 4 ranks in the sequence */
#define LL_ADC_REG_SEQ_SCAN_ENABLE_5RANKS  (ADC_SQR1_LEN_2) /*!< ADC group regular sequencer enable
                                        with 5 ranks in the sequence */
#define LL_ADC_REG_SEQ_SCAN_ENABLE_6RANKS  (ADC_SQR1_LEN_2| ADC_SQR1_LEN_0) /*!< ADC group regular sequencer enable
                                        with 6 ranks in the sequence */
#define LL_ADC_REG_SEQ_SCAN_ENABLE_7RANKS  (ADC_SQR1_LEN_2 | ADC_SQR1_LEN_1) /*!< ADC group regular sequencer enable
                                        with 7 ranks in the sequence */
#define LL_ADC_REG_SEQ_SCAN_ENABLE_8RANKS  (ADC_SQR1_LEN_2 | ADC_SQR1_LEN_1 \
                                            | ADC_SQR1_LEN_0) /*!< ADC group regular sequencer enable
                                        with 8 ranks in the sequence */
#define LL_ADC_REG_SEQ_SCAN_ENABLE_9RANKS  (ADC_SQR1_LEN_3) /*!< ADC group regular sequencer enable
                                        with 9 ranks in the sequence */
#define LL_ADC_REG_SEQ_SCAN_ENABLE_10RANKS (ADC_SQR1_LEN_3| ADC_SQR1_LEN_0) /*!< ADC group regular sequencer enable
                                        with 10 ranks in the sequence */
#define LL_ADC_REG_SEQ_SCAN_ENABLE_11RANKS (ADC_SQR1_LEN_3| ADC_SQR1_LEN_1) /*!< ADC group regular sequencer enable
                                        with 11 ranks in the sequence */
#define LL_ADC_REG_SEQ_SCAN_ENABLE_12RANKS (ADC_SQR1_LEN_3| ADC_SQR1_LEN_1 \
                                            | ADC_SQR1_LEN_0) /*!< ADC group regular sequencer enable
                                        with 12 ranks in the sequence */
#define LL_ADC_REG_SEQ_SCAN_ENABLE_13RANKS (ADC_SQR1_LEN_3 | ADC_SQR1_LEN_2) /*!< ADC group regular sequencer enable
                                        with 13 ranks in the sequence */
#define LL_ADC_REG_SEQ_SCAN_ENABLE_14RANKS (ADC_SQR1_LEN_3 | ADC_SQR1_LEN_2 \
                                            | ADC_SQR1_LEN_0) /*!< ADC group regular sequencer enable
                                        with 14 ranks in the sequence */
#define LL_ADC_REG_SEQ_SCAN_ENABLE_15RANKS (ADC_SQR1_LEN_3 | ADC_SQR1_LEN_2 \
                                            | ADC_SQR1_LEN_1) /*!< ADC group regular sequencer enable
                                        with 15 ranks in the sequence */
#define LL_ADC_REG_SEQ_SCAN_ENABLE_16RANKS (ADC_SQR1_LEN_3 | ADC_SQR1_LEN_2 \
                                            | ADC_SQR1_LEN_1 | ADC_SQR1_LEN_0) /*!< ADC group regular sequencer enable
                                        with 16 ranks in the sequence */
/**
  * @}
  */

/** @defgroup ADC_LL_EC_REG_SEQ_DISCONT_MODE  ADC group regular - Sequencer discontinuous mode
  * @{
  */
#define LL_ADC_REG_SEQ_DISCONT_DISABLE  (0x00000000UL)                               /*!< ADC group regular sequencer
                                        discontinuous mode disabled */
#define LL_ADC_REG_SEQ_DISCONT_1RANK    (ADC_CFGR1_DISCEN)                           /*!< ADC group regular sequencer
                                        discontinuous mode enabled with sequence interruption every rank */
#define LL_ADC_REG_SEQ_DISCONT_2RANKS   (ADC_CFGR1_DISCNUM_0 | ADC_CFGR1_DISCEN)     /*!< ADC group regular sequencer
                                        discontinuous mode enabled with sequence interruption every 2 ranks */
#define LL_ADC_REG_SEQ_DISCONT_3RANKS   (ADC_CFGR1_DISCNUM_1 | ADC_CFGR1_DISCEN)     /*!< ADC group regular sequencer
                                        discontinuous mode enabled with sequence interruption every 3 ranks */
#define LL_ADC_REG_SEQ_DISCONT_4RANKS   (ADC_CFGR1_DISCNUM_1 | ADC_CFGR1_DISCNUM_0 \
                                         | ADC_CFGR1_DISCEN)                          /*!< ADC group regular sequencer
                                        discontinuous mode enabled with sequence interruption every 4 ranks */
#define LL_ADC_REG_SEQ_DISCONT_5RANKS   (ADC_CFGR1_DISCNUM_2 | ADC_CFGR1_DISCEN)     /*!< ADC group regular sequencer
                                        discontinuous mode enabled with sequence interruption every 5 ranks */
#define LL_ADC_REG_SEQ_DISCONT_6RANKS   (ADC_CFGR1_DISCNUM_2 | ADC_CFGR1_DISCNUM_0 \
                                         | ADC_CFGR1_DISCEN)                          /*!< ADC group regular sequencer
                                        discontinuous mode enabled with sequence interruption every 6 ranks */
#define LL_ADC_REG_SEQ_DISCONT_7RANKS   (ADC_CFGR1_DISCNUM_2 | ADC_CFGR1_DISCNUM_1 \
                                         | ADC_CFGR1_DISCEN)                          /*!< ADC group regular sequencer
                                        discontinuous mode enabled with sequence interruption every 7 ranks */
#define LL_ADC_REG_SEQ_DISCONT_8RANKS   (ADC_CFGR1_DISCNUM_2 | ADC_CFGR1_DISCNUM_1 \
                                         | ADC_CFGR1_DISCNUM_0 | ADC_CFGR1_DISCEN)    /*!< ADC group regular sequencer
                                        discontinuous mode enabled with sequence interruption every 8 ranks */
/**
  * @}
  */

/** @defgroup ADC_LL_EC_REG_SEQ_RANKS  ADC group regular - Sequencer ranks
  * @{
  */
#define LL_ADC_REG_RANK_1               (LL_ADC_SQR1_REGOFFSET | ADC_SQR1_SQ1_Pos)  /*!< ADC group regular sequencer
                                        rank 1 */
#define LL_ADC_REG_RANK_2               (LL_ADC_SQR1_REGOFFSET | ADC_SQR1_SQ2_Pos)  /*!< ADC group regular sequencer
                                        rank 2 */
#define LL_ADC_REG_RANK_3               (LL_ADC_SQR1_REGOFFSET | ADC_SQR1_SQ3_Pos)  /*!< ADC group regular sequencer
                                        rank 3 */
#define LL_ADC_REG_RANK_4               (LL_ADC_SQR1_REGOFFSET | ADC_SQR1_SQ4_Pos)  /*!< ADC group regular sequencer
                                        rank 4 */
#define LL_ADC_REG_RANK_5               (LL_ADC_SQR2_REGOFFSET | ADC_SQR2_SQ5_Pos)  /*!< ADC group regular sequencer
                                        rank 5 */
#define LL_ADC_REG_RANK_6               (LL_ADC_SQR2_REGOFFSET | ADC_SQR2_SQ6_Pos)  /*!< ADC group regular sequencer
                                        rank 6 */
#define LL_ADC_REG_RANK_7               (LL_ADC_SQR2_REGOFFSET | ADC_SQR2_SQ7_Pos)  /*!< ADC group regular sequencer
                                        rank 7 */
#define LL_ADC_REG_RANK_8               (LL_ADC_SQR2_REGOFFSET | ADC_SQR2_SQ8_Pos)  /*!< ADC group regular sequencer
                                        rank 8 */
#define LL_ADC_REG_RANK_9               (LL_ADC_SQR2_REGOFFSET | ADC_SQR2_SQ9_Pos)  /*!< ADC group regular sequencer
                                        rank 9 */
#define LL_ADC_REG_RANK_10              (LL_ADC_SQR3_REGOFFSET | ADC_SQR3_SQ10_Pos) /*!< ADC group regular sequencer
                                        rank 10 */
#define LL_ADC_REG_RANK_11              (LL_ADC_SQR3_REGOFFSET | ADC_SQR3_SQ11_Pos) /*!< ADC group regular sequencer
                                        rank 11 */
#define LL_ADC_REG_RANK_12              (LL_ADC_SQR3_REGOFFSET | ADC_SQR3_SQ12_Pos) /*!< ADC group regular sequencer
                                        rank 12 */
#define LL_ADC_REG_RANK_13              (LL_ADC_SQR3_REGOFFSET | ADC_SQR3_SQ13_Pos) /*!< ADC group regular sequencer
                                        rank 13 */
#define LL_ADC_REG_RANK_14              (LL_ADC_SQR3_REGOFFSET | ADC_SQR3_SQ14_Pos) /*!< ADC group regular sequencer
                                        rank 14 */
#define LL_ADC_REG_RANK_15              (LL_ADC_SQR4_REGOFFSET | ADC_SQR4_SQ15_Pos) /*!< ADC group regular sequencer
                                        rank 15 */
#define LL_ADC_REG_RANK_16              (LL_ADC_SQR4_REGOFFSET | ADC_SQR4_SQ16_Pos) /*!< ADC group regular sequencer
                                        rank 16 */
/**
  * @}
  */

