MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_adc.h
/** @defgroup ADC_LL_EC_INJ_TRIGGER_SOURCE  ADC group injected - Trigger source
  * @note     Triggers from timers capture compare are input capture or output capture.
  * @{
  */
#define LL_ADC_INJ_TRIG_SOFTWARE        (0x00000000UL) /*!< ADC group injected conversion trigger internal: SW start. */
#define LL_ADC_INJ_TRIG_EXTI15          (LL_ADC_INJ_TRIG_EDGE_DEFAULT) /*!< ADC group injected conversion
                                        trigger from periph: EXTI line 15  */
#define LL_ADC_INJ_TRIG_TIM1_OC4        (ADC_JSQR_JEXTSEL_0 \
                                         | LL_ADC_INJ_TRIG_EDGE_DEFAULT) /*!< ADC group injected conversion
                                        trigger from periph: TIM1 channel 4  */
#define LL_ADC_INJ_TRIG_TIM1_TRGO       (ADC_JSQR_JEXTSEL_1 \
                                         | LL_ADC_INJ_TRIG_EDGE_DEFAULT) /*!< ADC group injected conversion
                                        trigger from periph: TIM1 TRGO  */
#define LL_ADC_INJ_TRIG_TIM1_TRGO2      (ADC_JSQR_JEXTSEL_1 | ADC_JSQR_JEXTSEL_0 \
                                         | LL_ADC_INJ_TRIG_EDGE_DEFAULT) /*!< ADC group injected conversion
                                        trigger from periph: TIM1 TRGO2  */
#define LL_ADC_INJ_TRIG_TIM2_OC1        (ADC_JSQR_JEXTSEL_2 \
                                         | LL_ADC_INJ_TRIG_EDGE_DEFAULT) /*!< ADC group injected conversion
                                        trigger from periph: TIM2 channel 1  */
#define LL_ADC_INJ_TRIG_TIM2_TRGO       (ADC_JSQR_JEXTSEL_2 | ADC_JSQR_JEXTSEL_0 \
                                         | LL_ADC_INJ_TRIG_EDGE_DEFAULT) /*!< ADC group injected conversion
                                        trigger from periph: TIM2 TRGO  */
#if defined(STM32C591xx) || defined(STM32C593xx) || defined(STM32C5A3xx)
#define LL_ADC_INJ_TRIG_TIM3_TRGO       (ADC_JSQR_JEXTSEL_2 | ADC_JSQR_JEXTSEL_1 \
                                         | LL_ADC_INJ_TRIG_EDGE_DEFAULT) /*!< ADC group injected conversion
                                        trigger from periph: TIM3 TRGO  */
#define LL_ADC_INJ_TRIG_TIM4_TRGO       (ADC_JSQR_JEXTSEL_2 | ADC_JSQR_JEXTSEL_1 \
                                         | ADC_JSQR_JEXTSEL_0 \
                                         | LL_ADC_INJ_TRIG_EDGE_DEFAULT) /*!< ADC group injected conversion
                                        trigger from periph: TIM4 TRGO  */
#define LL_ADC_INJ_TRIG_TIM3_OC3        (ADC_JSQR_JEXTSEL_3 \
                                         | LL_ADC_INJ_TRIG_EDGE_DEFAULT) /*!< ADC group injected conversion
                                        trigger from periph: TIM3 channel 3  */
#endif /* STM32C591xx, STM32C593xx, STM32C5A3xx */
#define LL_ADC_INJ_TRIG_TIM5_OC1        (ADC_JSQR_JEXTSEL_3 | ADC_JSQR_JEXTSEL_1 \
                                         | LL_ADC_INJ_TRIG_EDGE_DEFAULT) /*!< ADC group injected conversion
                                        trigger from periph: TIM5 channel 1  */
#define LL_ADC_INJ_TRIG_TIM5_OC2        (ADC_JSQR_JEXTSEL_3 | ADC_JSQR_JEXTSEL_1 \
                                         | ADC_JSQR_JEXTSEL_0 \
                                         | LL_ADC_INJ_TRIG_EDGE_DEFAULT) /*!< ADC group injected conversion
                                        trigger from periph: TIM5 channel 2  */
#define LL_ADC_INJ_TRIG_TIM5_OC3        (ADC_JSQR_JEXTSEL_3 | ADC_JSQR_JEXTSEL_2 \
                                         | LL_ADC_INJ_TRIG_EDGE_DEFAULT) /*!< ADC group injected conversion
                                        trigger from periph: TIM5 channel 3  */
#define LL_ADC_INJ_TRIG_TIM5_TRGO       (ADC_JSQR_JEXTSEL_3 | ADC_JSQR_JEXTSEL_2 \
                                         | ADC_JSQR_JEXTSEL_0 \
                                         | LL_ADC_INJ_TRIG_EDGE_DEFAULT) /*!< ADC group injected conversion
                                        trigger from periph: TIM15 TRGO  */
#define LL_ADC_INJ_TRIG_TIM7_TRGO       (ADC_JSQR_JEXTSEL_3 | ADC_JSQR_JEXTSEL_2 \
                                         | ADC_JSQR_JEXTSEL_1 \
                                         | LL_ADC_INJ_TRIG_EDGE_DEFAULT) /*!< ADC group injected conversion
                                        trigger from periph: TIM7 TRGO  */
#define LL_ADC_INJ_TRIG_TIM8_OC4        (ADC_JSQR_JEXTSEL_3 | ADC_JSQR_JEXTSEL_2 \
                                         | ADC_JSQR_JEXTSEL_1 | ADC_JSQR_JEXTSEL_0 \
                                         | LL_ADC_INJ_TRIG_EDGE_DEFAULT) /*!< ADC group injected conversion
                                        trigger from periph: TIM8 channel 4  */
#define LL_ADC_INJ_TRIG_TIM8_TRGO       (ADC_JSQR_JEXTSEL_4 \
                                         | LL_ADC_INJ_TRIG_EDGE_DEFAULT) /*!< ADC group injected conversion
                                        trigger from periph: TIM8 TRGO  */
#define LL_ADC_INJ_TRIG_TIM8_TRGO2      (ADC_JSQR_JEXTSEL_4 | ADC_JSQR_JEXTSEL_0 \
                                         | LL_ADC_INJ_TRIG_EDGE_DEFAULT) /*!< ADC group injected conversion
                                        trigger from periph: TIM8 TRGO2  */
#define LL_ADC_INJ_TRIG_TIM12_TRGO      (ADC_JSQR_JEXTSEL_4 | ADC_JSQR_JEXTSEL_1 \
                                         | LL_ADC_INJ_TRIG_EDGE_DEFAULT) /*!< ADC group injected conversion
                                        trigger from periph: TIM12 TRGO  */
#define LL_ADC_INJ_TRIG_TIM15_TRGO      (ADC_JSQR_JEXTSEL_4 | ADC_JSQR_JEXTSEL_1 \
                                         | ADC_JSQR_JEXTSEL_0 \
                                         | LL_ADC_INJ_TRIG_EDGE_DEFAULT) /*!< ADC group injected conversion
                                        trigger from periph: TIM15 TRGO  */
#if defined(LPTIM1)
#define LL_ADC_INJ_TRIG_LPTIM1_OC1      (ADC_JSQR_JEXTSEL_4 | ADC_JSQR_JEXTSEL_2 \
                                         | LL_ADC_INJ_TRIG_EDGE_DEFAULT) /*!< ADC group injected conversion
                                        trigger from periph: LPTIM1 channel 1  */
#endif /* LPTIM1 */
#if defined(STM32C591xx) || defined(STM32C593xx) || defined(STM32C5A3xx)
#define LL_ADC_INJ_TRIG_TIM3_OC1        (ADC_JSQR_JEXTSEL_4 | ADC_JSQR_JEXTSEL_2 \
                                         | ADC_JSQR_JEXTSEL_0 \
                                         | LL_ADC_INJ_TRIG_EDGE_DEFAULT) /*!< ADC group injected conversion
                                        trigger from periph: TIM3 channel 1  */
#endif /* STM32C591xx, STM32C593xx, STM32C5A3xx */
/**
  * @}
  */

