MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_adc.h
/** @defgroup ADC_LL_EC_INJ_TRIGGER_EDGE  ADC group injected - Trigger edge
  * @{
  */
#define LL_ADC_INJ_TRIG_RISING          (ADC_JSQR_JEXTEN_0) /*!< ADC group injected conversion trigger polarity
                                        set to rising edge */
#define LL_ADC_INJ_TRIG_FALLING         (ADC_JSQR_JEXTEN_1) /*!< ADC group injected conversion trigger polarity
                                        set to falling edge */
#define LL_ADC_INJ_TRIG_RISING_FALLING  (ADC_JSQR_JEXTEN_1 | ADC_JSQR_JEXTEN_0) /*!< ADC group injected conversion
                                        trigger polarity set to both rising and falling edges */
/**
  * @}
  */

/** @defgroup ADC_LL_EC_INJ_TRIG_AUTO  ADC group injected - Automatic trigger mode
  * @{
  */
#define LL_ADC_INJ_TRIG_INDEPENDENT     (0x00000000UL)    /*!< ADC group injected conversion trigger independent.
                                        Setting mandatory if ADC group injected injected trigger source is set
                                        to an external trigger. */
#define LL_ADC_INJ_TRIG_FROM_REGULAR    (ADC_CFGR1_JAUTO) /*!< ADC group injected conversion trigger from ADC group
                                        regular. Setting compliant only with group injected trigger source set
                                        to SW start, without any further action on ADC group injected conversion
                                        start or stop: in this case, ADC group injected is controlled only
                                        from ADC group regular. */
/**
  * @}
  */

/** @defgroup ADC_LL_EC_INJ_SEQ_SCAN_LENGTH  ADC group injected - Sequencer scan length
  * @{
  */
#define LL_ADC_INJ_SEQ_SCAN_DISABLE     (0x00000000UL)  /*!< ADC group injected sequencer disable (equivalent to
                                        sequencer of 1 rank: ADC conversion on only 1 channel) */
#define LL_ADC_INJ_SEQ_SCAN_ENABLE_2RANKS (ADC_JSQR_JLEN_0) /*!< ADC group injected sequencer enable with 2 ranks
                                        in the sequence */
#define LL_ADC_INJ_SEQ_SCAN_ENABLE_3RANKS (ADC_JSQR_JLEN_1) /*!< ADC group injected sequencer enable with 3 ranks
                                        in the sequence */
#define LL_ADC_INJ_SEQ_SCAN_ENABLE_4RANKS (ADC_JSQR_JLEN_1 | ADC_JSQR_JLEN_0) /*!< ADC group injected sequencer enable
                                        with 4 ranks in the sequence */
/**
  * @}
  */

/** @defgroup ADC_LL_EC_INJ_SEQ_DISCONT_MODE  ADC group injected - Sequencer discontinuous mode
  * @{
  */
#define LL_ADC_INJ_SEQ_DISCONT_DISABLE  (0x00000000UL)      /*!< ADC group injected sequencer discontinuous mode
                                        disabled */
#define LL_ADC_INJ_SEQ_DISCONT_1RANK    (ADC_CFGR1_JDISCEN) /*!< ADC group injected sequencer discontinuous mode
                                        enabled with sequence interruption every rank */
/**
  * @}
  */

/** @defgroup ADC_LL_EC_INJ_SEQ_RANKS  ADC group injected - Sequencer ranks
  * @{
  */
#define LL_ADC_INJ_RANK_1               (LL_ADC_JDR1_REGOFFSET | ADC_JSQR_JSQ1_Pos) /*!< ADC group
                                        injected sequencer rank 1 */
#define LL_ADC_INJ_RANK_2               (LL_ADC_JDR2_REGOFFSET | ADC_JSQR_JSQ2_Pos) /*!< ADC group
                                        injected sequencer rank 2 */
#define LL_ADC_INJ_RANK_3               (LL_ADC_JDR3_REGOFFSET | ADC_JSQR_JSQ3_Pos) /*!< ADC group
                                        injected sequencer rank 3 */
#define LL_ADC_INJ_RANK_4               (LL_ADC_JDR4_REGOFFSET | ADC_JSQR_JSQ4_Pos) /*!< ADC group
                                        injected sequencer rank 4 */
/**
  * @}
  */

/** @defgroup ADC_LL_EC_CHANNEL_SAMPLINGTIME  Channel - Sampling time
  * @{
  */
#define LL_ADC_SAMPLINGTIME_3CYCLES     (0x00000000UL)         /*!< Sampling time 3 ADC clock cycles */
#define LL_ADC_SAMPLINGTIME_5CYCLES     (ADC_SMPR2_SMP10_0)    /*!< Sampling time 5 ADC clock cycles */
#define LL_ADC_SAMPLINGTIME_8CYCLES     (ADC_SMPR2_SMP10_1)    /*!< Sampling time 8 ADC clock cycles */
#define LL_ADC_SAMPLINGTIME_13CYCLES    (ADC_SMPR2_SMP10_1 \
                                         | ADC_SMPR2_SMP10_0)  /*!< Sampling time 13 ADC clock cycles */
#define LL_ADC_SAMPLINGTIME_25CYCLES    (ADC_SMPR2_SMP10_2)    /*!< Sampling time 25 ADC clock cycles */
#define LL_ADC_SAMPLINGTIME_48CYCLES    (ADC_SMPR2_SMP10_2 \
                                         | ADC_SMPR2_SMP10_0)  /*!< Sampling time 48 ADC clock cycles */
#define LL_ADC_SAMPLINGTIME_139CYCLES   (ADC_SMPR2_SMP10_2 \
                                         | ADC_SMPR2_SMP10_1)  /*!< Sampling time 139 ADC clock cycles */
#define LL_ADC_SAMPLINGTIME_289CYCLES   (ADC_SMPR2_SMP10_2 | ADC_SMPR2_SMP10_1 \
                                         | ADC_SMPR2_SMP10_0) /*!< Sampling time 289 ADC clock cycles */
/**
  * @}
  */

/** @defgroup ADC_LL_EC_CHANNEL_IN_SINGLE_DIFF  Channel - Input mode (single ended, differential)
  * @{
  */
#define LL_ADC_IN_SINGLE_ENDED          (0x0000FFFFUL) /*!< ADC channel input set to single ended
                                        (literal also used to set calibration mode) */
/**
  * @}
  */


/** @defgroup ADC_LL_EC_AWD_NB Analog watchdog - Analog watchdog instance
  * @{
  */
#define LL_ADC_AWD_1                    (LL_ADC_AWD_CR1_CHANNEL_MASK  | LL_ADC_AWD_CR1_REGOFFSET) /*!< ADC analog
                                        watchdog instance 1 */
#define LL_ADC_AWD_2                    (LL_ADC_AWD_CR23_CHANNEL_MASK | LL_ADC_AWD_CR2_REGOFFSET) /*!< ADC analog
                                        watchdog instance 2 */
#define LL_ADC_AWD_3                    (LL_ADC_AWD_CR23_CHANNEL_MASK | LL_ADC_AWD_CR3_REGOFFSET) /*!< ADC analog
                                        watchdog instance 3 */
/**
  * @}
  */

/** @defgroup ADC_LL_EC_AWD_THRESHOLDS  Analog watchdog - Thresholds
  * @{
  */
#define LL_ADC_AWD_THRESHOLD_HIGH       (0x1UL)                     /*!< ADC analog watchdog threshold high */
#define LL_ADC_AWD_THRESHOLD_LOW        (0x0UL)                     /*!< ADC analog watchdog threshold low */
/**
  * @}
  */

/** @defgroup ADC_LL_EC_AWD_FILTERING_CONFIG  Analog watchdog - Filtering config
  * @{
  */
#define LL_ADC_AWD_FILTERING_NONE       (0x00000000UL)      /*!< ADC analog watchdog no filtering, one out-of-window
                                        sample is needed to raise flag or interrupt */
#define LL_ADC_AWD_FILTERING_2SAMPLES   (ADC_AWD1HTR_AWDFILT_0) /*!< ADC analog watchdog 2 consecutives out-of-window
                                        samples are needed to raise flag or interrupt */
#define LL_ADC_AWD_FILTERING_3SAMPLES   (ADC_AWD1HTR_AWDFILT_1) /*!< ADC analog watchdog 3 consecutives out-of-window
                                        samples are needed to raise flag or interrupt */
#define LL_ADC_AWD_FILTERING_4SAMPLES   (ADC_AWD1HTR_AWDFILT_1 | ADC_AWD1HTR_AWDFILT_0) /*!< ADC analog watchdog 4
                                        consecutives out-of-window samples are needed to raise flag or interrupt */
#define LL_ADC_AWD_FILTERING_5SAMPLES   (ADC_AWD1HTR_AWDFILT_2) /*!< ADC analog watchdog 5 consecutives out-of-window
                                        samples are needed to raise flag or interrupt */
#define LL_ADC_AWD_FILTERING_6SAMPLES   (ADC_AWD1HTR_AWDFILT_2 | ADC_AWD1HTR_AWDFILT_0) /*!< ADC analog watchdog 6
                                        consecutives out-of-window samples are needed to raise flag or interrupt */
#define LL_ADC_AWD_FILTERING_7SAMPLES   (ADC_AWD1HTR_AWDFILT_2 | ADC_AWD1HTR_AWDFILT_1) /*!< ADC analog watchdog 7
                                        consecutives out-of-window samples are needed to raise flag or interrupt */
#define LL_ADC_AWD_FILTERING_8SAMPLES   (ADC_AWD1HTR_AWDFILT_2 | ADC_AWD1HTR_AWDFILT_1 \
                                         | ADC_AWD1HTR_AWDFILT_0) /*!< ADC analog watchdog 8 consecutives out-of-window
                                        samples are needed to raise flag or interrupt */
/**
  * @}
  */

/** @defgroup ADC_LL_EC_OVS_INSTANCE  Oversampling - Oversampling instance
  * @{
  */
#define LL_ADC_OVS_1                    (0U) /*!< ADC oversampling instance for standard oversampling:
                                        a single oversampling accumulator is common to regular and injected conversions.
                                        Therefore, settings ratio and shift are common and process is sequential.
                                        For constraints of oversampling on groups regular and injected,
                                        refer to parameters of ADC_LL_EC_OVS_SCOPE. */
/**
  * @}
  */

/** @defgroup ADC_LL_EC_OVS_SCOPE  Oversampling - Oversampling scope
  * @{
  */
#define LL_ADC_OVS_DISABLE              (0x00000000UL) /*!< ADC oversampling disabled. */
#define LL_ADC_OVS_REG_CONTINUED        (ADC_CFGR2_ROVSE) /*!< ADC oversampling on conversions of
                                        ADC group regular.
                                        If ADC group injected conversion insertion within regular sequence: oversampling
                                        on group regular is temporary stopped and, after injected conversion, continued
                                        (oversampling accumulator maintained). */
#define LL_ADC_OVS_REG_RESUMED          (ADC_CFGR2_ROVSM | ADC_CFGR2_ROVSE) /*!< ADC oversampling on conversions of
                                        ADC group regular.
                                        If ADC group injected conversion insertion within regular sequence: after
                                        injected conversion, oversampling on group regular is resumed from start
                                        (oversampler accumulator reset). */
#define LL_ADC_OVS_INJ                  (ADC_CFGR2_JOVSE) /*!< ADC oversampling on conversions of
                                        ADC group injected, in sequential mode:
                                        oversampling conversions sequence sequential, switching data registers
                                        after each oversampling process (all ratio occurrences, shift).
                                        Note: A single oversampling accumulator is common to regular
                                              and injected conversions. Therefore, settings ratio and shift are common
                                              and process is sequential. */
#define LL_ADC_OVS_INJ_REG_RESUMED      (LL_ADC_OVS_REG_RESUMED | LL_ADC_OVS_INJ) /*!< ADC oversampling on conversions
                                        of ADC groups regular and injected.
                                        Combination of LL_ADC_OVS_REG_RESUMED and LL_ADC_OVS_INJ: refer to
                                        description of these parameters.
                                        Note: Can be used only with function @ref LL_ADC_SetOverSamplingScope().
                                              For configuration with accumulator explicit selection,
                                              refer to @ref LL_ADC_SetOverSamplingInstScope(), used with combination
                                              of regular and injected related parameters. */
/**
  * @}
  */

