MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_adc.h
/** @defgroup ADC_LL_EC_OVS_DISCONT_MODE  Oversampling - Discontinuous mode (triggered mode)
  * @{
  */
#define LL_ADC_OVS_CONT                 (0x00000000UL)    /*!< ADC oversampling discontinuous mode: continuous mode
                                        (all conversions of oversampling ratio start from 1 trigger) */
#define LL_ADC_OVS_DISCONT              (ADC_CFGR2_TROVS) /*!< ADC oversampling discontinuous mode: discontinuous
                                        mode (each conversion of oversampling ratio needs a trigger)
                                        Note: Discontinuous mode applied only on group regular oversampling
                                              (not injected oversampling). */
/**
  * @}
  */

/** @defgroup ADC_LL_EC_OVS_SHIFT  Oversampling - Data shift
  * @{
  */
#define LL_ADC_OVS_SHIFT_NONE           (0UL) /*!< ADC oversampling no shift (no division) */
#define LL_ADC_OVS_SHIFT_RIGHT_1        (1UL) /*!< ADC oversampling shift of 1 (division by 2) */
#define LL_ADC_OVS_SHIFT_RIGHT_2        (2UL) /*!< ADC oversampling shift of 2 (division by 4) */
#define LL_ADC_OVS_SHIFT_RIGHT_3        (3UL) /*!< ADC oversampling shift of 3 (division by 8) */
#define LL_ADC_OVS_SHIFT_RIGHT_4        (4UL) /*!< ADC oversampling shift of 4 (division by 16) */
#define LL_ADC_OVS_SHIFT_RIGHT_5        (5UL) /*!< ADC oversampling shift of 5 (division by 32) */
#define LL_ADC_OVS_SHIFT_RIGHT_6        (6UL) /*!< ADC oversampling shift of 6 (division by 64) */
#define LL_ADC_OVS_SHIFT_RIGHT_7        (7UL) /*!< ADC oversampling shift of 7 (division by 128) */
#define LL_ADC_OVS_SHIFT_RIGHT_8        (8UL) /*!< ADC oversampling shift of 8 (division by 256) */
#define LL_ADC_OVS_SHIFT_RIGHT_9        (9UL) /*!< ADC oversampling shift of 9 (division by 512) */
#define LL_ADC_OVS_SHIFT_RIGHT_10       (10UL) /*!< ADC oversampling shift of 10 (division by 1024) */
/**
  * @}
  */

/** @defgroup ADC_LL_EC_OFFSET_NB  ADC instance - Offset number
  * @{
  */
#define LL_ADC_OFFSET_1                 (LL_ADC_OFR1_REGOFFSET) /*!< ADC offset instance 1: ADC channel and offset level
                                        to which the offset programmed will be applied (independently of channel
                                        assigned on ADC group regular or injected sequencer) */
#define LL_ADC_OFFSET_2                 (LL_ADC_OFR2_REGOFFSET) /*!< ADC offset instance 2: ADC channel and offset level
                                        to which the offset programmed will be applied (independently of channel
                                        assigned on ADC group regular or injected sequencer) */
#define LL_ADC_OFFSET_3                 (LL_ADC_OFR3_REGOFFSET) /*!< ADC offset instance 3: ADC channel and offset level
                                        to which the offset programmed will be applied (independently of channel
                                        assigned on ADC group regular or injected sequencer) */
#define LL_ADC_OFFSET_4                 (LL_ADC_OFR4_REGOFFSET) /*!< ADC offset instance 4: ADC channel and offset level
                                        to which the offset programmed will be applied (independently of channel
                                        assigned on ADC group regular or injected sequencer) */
/**
  * @}
  */

/** @defgroup ADC_LL_EC_OFFSET_SIGNED_SATURATION ADC instance - Offset signed saturation mode
  * @{
  */
#define LL_ADC_OFFSET_SIGNED_SATURATION_DISABLE   (0x00000000UL)     /*!< ADC offset signed saturation is disabled
                                        (among ADC selected offset number 1, 2, 3 or 4) */
#define LL_ADC_OFFSET_SIGNED_SATURATION_ENABLE    (ADC_OFCFGR_SSAT)  /*!< ADC offset signed saturation is enabled
                                        (among ADC selected offset number 1, 2, 3 or 4) */
/**
  * @}
  */

/** @defgroup ADC_LL_EC_OFFSET_UNSIGNED_SATURATION ADC instance - Offset unsigned saturation mode
  * @{
  */
#define LL_ADC_OFFSET_UNSIGNED_SATURATION_DISABLE   (0x00000000UL)   /*!< ADC offset unsigned saturation is disabled
                                        (among ADC selected offset number 1, 2, 3 or 4) */
#define LL_ADC_OFFSET_UNSIGNED_SATURATION_ENABLE    (ADC_OFCFGR_USAT)  /*!< ADC offset unsigned saturation is enabled
                                        (among ADC selected offset number 1, 2, 3 or 4) */
/**
  * @}
  */

/** @defgroup ADC_LL_EC_OFFSET_SIGN ADC instance - Offset sign
  * @{
  */
#define LL_ADC_OFFSET_SIGN_NEGATIVE     (0x00000000UL)       /*!< ADC offset is negative
                                        (among ADC selected offset number 1, 2, 3 or 4) */
#define LL_ADC_OFFSET_SIGN_POSITIVE     (ADC_OFCFGR_POSOFF)  /*!< ADC offset is positive
                                        (among ADC selected offset number 1, 2, 3 or 4) */
/**
  * @}
  */

#if defined(ADC_MULTIMODE_SUPPORT)
/** @defgroup ADC_LL_EC_MULTI_MODE  Multimode - Mode
  * @{
  */
#define LL_ADC_MULTI_INDEPENDENT        (0x00000000UL) /*!< ADC dual mode disabled (ADC independent mode) */
#define LL_ADC_MULTI_DUAL_REG_SIMULT    (ADCC_CCR_DUAL_2 | ADCC_CCR_DUAL_1) /*!< ADC dual mode enabled: group regular
                                        simultaneous */
#define LL_ADC_MULTI_DUAL_REG_INTERL    (ADCC_CCR_DUAL_2 | ADCC_CCR_DUAL_1 \
                                         | ADCC_CCR_DUAL_0) /*!< ADC dual mode enabled: Combined group regular
                                        interleaved */
#define LL_ADC_MULTI_DUAL_INJ_SIMULT    (ADCC_CCR_DUAL_2 | ADCC_CCR_DUAL_0) /*!< ADC dual mode enabled: group injected
                                        simultaneous */
#define LL_ADC_MULTI_DUAL_INJ_ALTERN    (ADCC_CCR_DUAL_3 | ADCC_CCR_DUAL_0) /*!< ADC dual mode enabled: group injected
                                        alternate trigger. Works only with external triggers (not SW start) */
#define LL_ADC_MULTI_DUAL_REG_SIM_INJ_SIM (ADCC_CCR_DUAL_0) /*!< ADC dual mode enabled: Combined group regular
                                        simultaneous + group injected simultaneous */
#define LL_ADC_MULTI_DUAL_REG_SIM_INJ_ALT (ADCC_CCR_DUAL_1) /*!< ADC dual mode enabled: Combined group regular
                                        simultaneous + group injected alternate trigger */
#define LL_ADC_MULTI_DUAL_REG_INT_INJ_SIM (ADCC_CCR_DUAL_1 | ADCC_CCR_DUAL_0) /*!< ADC dual mode enabled: Combined
                                        group regular interleaved + group injected simultaneous */
/**
  * @}
  */

