MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_adc.h
/** @defgroup ADC_LL_EC_MULTI_DMA_TRANSFER  Multimode - Data format
  * @{
  */
#define LL_ADC_MULTI_REG_DMA_EACH_ADC   (0x00000000UL)                      /*!< ADC multimode group regular
                                        data format: full range, no data packing.
                                        Intended for cases:
                                        - multimode without DMA transfer
                                        - multimode with DMA transfer in two different buffers.
                                        - high data width (can exceed ADC resolution in case of
                                          oversampling or post-processing) over data packing constraints.
                                        For no data transfer:
                                        - to retrieve conversion data, use @ref LL_ADC_REG_ReadConversionData32()
                                          with each ADC instance.
                                        For data transfer by DMA:
                                        - configure DMA to get data from register DR of ADC instance
                                          with @ref LL_ADC_DMA_GetRegAddr().
                                          Each ADC uses its own DMA channel, with its individual DMA transfer
                                          settings. Therefore, two destination buffers. */
#define LL_ADC_MULTI_REG_DMA_RES_32_16B (ADCC_CCR_DAMDF_1)                  /*!< ADC multimode group regular
                                        data format: full range and 2 data packing on 32 bits.
                                        Intended for cases:
                                        - multimode with DMA transfer in a single buffer.
                                        - high data width (can exceed ADC resolution in case of
                                          oversampling or post-processing) over data packing constraints.
                                        For no data transfer:
                                        - to retrieve conversion data, use @ref LL_ADC_REG_ReadMultiConversionData32()
                                          or @ref LL_ADC_REG_ReadConversionData32() with each ADC instance.
                                        For data transfer by DMA:
                                        - configure DMA to get data from register CDR or CDR2
                                          with @ref LL_ADC_DMA_GetRegAddr().
                                        Note: conversion data in two ADC common instance data registers
                                              (CDR, CDR2) with packing option on 32 bits.
                                              - Register CDR: data packing on 32 bits: ADC master and slave data
                                                are concatenated (data master in [15; 0], data slave in [31; 16]),
                                                therefore data width must be lower than 16 bits (can exceed ADC
                                                resolution with post-processing: oversampling, offset, ...).
                                              - Register CDR2: data of master and slave are alternatively set in full
                                                register width 32 bits, therefore no constraint on data width.
                                                In case of usage with DMA, CDR generates one transfer request
                                                and CDR2 two transfer requests per conversion. */
#define LL_ADC_MULTI_REG_DMA_RES_8B     (ADCC_CCR_DAMDF_1 | ADCC_CCR_DAMDF_0) /*!< ADC multimode group regular
                                        data format: full range and 2 data packing on 16 bits.
                                        Intended for cases:
                                        - multimode with DMA transfer in a single buffer with elements 16 bits.
                                        For no data transfer:
                                        - to retrieve conversion data, use @ref LL_ADC_REG_ReadConversionData32()
                                          with each ADC instance.
                                        For data transfer by DMA:
                                        - configure DMA to get data from register CDR or CDR2
                                          with @ref LL_ADC_DMA_GetRegAddr().
                                        Note: conversion data in two ADC common instance data registers
                                              (CDR, CDR2) with packing option on 16 bits.
                                              - Register CDR: data packing on 16 bits: ADC master and slave data
                                                are concatenated (data master in [7; 0], data slave in [15; 8]),
                                                therefore data width must be lower than 8 bits (can exceed ADC
                                                resolution with post-processing: oversampling, offset, ...).
                                              - Register CDR2: data of master and slave are alternatively set in full
                                                register width 32 bits, therefore no constraint on data width.
                                                In case of usage with DMA, CDR generates one transfer request
                                                and CDR2 two transfer requests per conversion. */
/**
  * @}
  */

/** @defgroup ADC_LL_EC_MULTI_TWOSMP_DELAY  Multimode - Delay between two sampling phases (for mode interleaved)
  * @{
  */
#define LL_ADC_MULTI_TWOSMP_DELAY_1CYCLE (0x00000000UL) /*!< ADC multimode (mode interleaved)
                                        delay between two sampling phases: 1 ADC clock cycle for all resolutions */
#define LL_ADC_MULTI_TWOSMP_DELAY_2CYCLES (ADCC_CCR_DELAY_0) /*!< ADC multimode (mode interleaved)
                                        delay between two sampling phases: 2 ADC clock cycles for all resolutions */
#define LL_ADC_MULTI_TWOSMP_DELAY_3CYCLES (ADCC_CCR_DELAY_1) /*!< ADC multimode (mode interleaved)
                                        delay between two sampling phases: 3 ADC clock cycles for all resolutions */
#define LL_ADC_MULTI_TWOSMP_DELAY_4CYCLES (ADCC_CCR_DELAY_1 | ADCC_CCR_DELAY_0) /*!< ADC multimode (mode interleaved)
                                        delay between two sampling phases: 4 ADC clock cycles for all resolutions */
#define LL_ADC_MULTI_TWOSMP_DELAY_5CYCLES (ADCC_CCR_DELAY_2) /*!< ADC multimode (mode interleaved)
                                        delay between two sampling phases: 5 ADC clock cycles for all resolutions */
#define LL_ADC_MULTI_TWOSMP_DELAY_6CYCLES (ADCC_CCR_DELAY_2 | ADCC_CCR_DELAY_0) /*!< ADC multimode (mode interleaved)
                                        delay between two sampling phases: 6 ADC clock cycles for all resolutions */
#define LL_ADC_MULTI_TWOSMP_DELAY_7CYCLES (ADCC_CCR_DELAY_2 | ADCC_CCR_DELAY_1) /*!< ADC multimode (mode interleaved)
                                        delay between two sampling phases: 7 ADC clock cycles for all resolutions */
#define LL_ADC_MULTI_TWOSMP_DELAY_8CYCLES (ADCC_CCR_DELAY_2 | ADCC_CCR_DELAY_1 \
                                           | ADCC_CCR_DELAY_0) /*!< ADC multimode (mode interleaved
                                        delay between two sampling phases: 8 ADC clock cycles
                                        for resolution 12, 10, 8 bit */
#define LL_ADC_MULTI_TWOSMP_DELAY_9CYCLES (ADCC_CCR_DELAY_3) /*!< ADC multimode (mode interleaved
                                        delay between two sampling phases: 9 ADC clock cycles
                                        for resolution 12, 10, 8 bit */
#define LL_ADC_MULTI_TWOSMP_DELAY_10CYCLES (ADCC_CCR_DELAY_3 | ADCC_CCR_DELAY_0) /*!< ADC multimode (mode interleaved
                                        delay between two sampling phases: 10 ADC clock cycles
                                        for resolution 12, 10 bit */
#define LL_ADC_MULTI_TWOSMP_DELAY_11CYCLES (ADCC_CCR_DELAY_3 | ADCC_CCR_DELAY_1) /*!< ADC multimode (mode interleaved
                                        delay between two sampling phases: 11 ADC clock cycles
                                        for resolution 12, 10 bit */
#define LL_ADC_MULTI_TWOSMP_DELAY_12CYCLES (ADCC_CCR_DELAY_3 | ADCC_CCR_DELAY_1 \
                                            | ADCC_CCR_DELAY_0) /*!< ADC multimode (mode interleaved
                                        delay between two sampling phases: 12 ADC clock cycles for resolution 12 bit */
#define LL_ADC_MULTI_TWOSMP_DELAY_13CYCLES (ADCC_CCR_DELAY_3 | ADCC_CCR_DELAY_2) /*!< ADC multimode (mode interleaved)
                                        delay between two sampling phases: 13 ADC clock cycles for resolution 12 bit */
/**
  * @}
  */

/** @defgroup ADC_LL_EC_MULTI_MASTER_SLAVE  Multimode - ADC master or slave
  * @{
  */
#define LL_ADC_MULTI_MASTER             (ADCC_CDR_RDATA_MST) /*!< In multimode, selection among several ADC instances:
                                        ADC master */
#define LL_ADC_MULTI_SLAVE              (ADCC_CDR_RDATA_SLV) /*!< In multimode, selection among several ADC instances:
                                        ADC slave */
#define LL_ADC_MULTI_MASTER_SLAVE       (ADCC_CDR_RDATA_SLV | ADCC_CDR_RDATA_MST) /*!< In multimode, selection among
                                        several ADC instances: both ADC master and ADC slave */
/**
  * @}
  */

#endif /* ADC_MULTIMODE_SUPPORT */

/** @defgroup ADC_LL_EC_HW_DELAYS  Definitions of ADC hardware constraints delays
  * @note   Only ADC peripheral HW delays are defined in ADC LL driver driver, not timeout values.
  * @note   Timeout values for ADC operations are dependent to device clock configuration (system clock versus
  *         ADC clock), and therefore must be defined in user application.
  *         Indications for estimation of ADC timeout delays, for this STM32 series:
  *         - ADC calibration time: maximum delay is 16384/fADC (refer to device datasheet, parameter "tCAL")
  *         - ADC enable time: maximum delay is 1 conversion cycle (refer to device datasheet, parameter "tSTAB")
  *         - ADC disable time: maximum delay is few ADC clock cycles
  *         - ADC stop conversion time: maximum delay is few ADC clock cycles
  *         - ADC conversion time: duration depending on ADC clock and ADC configuration (refer to device
  *           reference manual, section "Timing")
  * @{
  */
#define LL_ADC_DELAY_INTERNAL_REGUL_STAB_US ( 10UL) /*!< Delay for ADC stabilization time (ADC voltage regulator
                                        start-up time).
                                        Delay set to maximum value (refer to device datasheet,
                                        parameter "tADCVREG_STUP").
                                        Unit: us */

#define LL_ADC_DELAY_VREFINT_STAB_US    (5UL) /*!< Delay for internal voltage reference stabilization time.
                                        Delay set to maximum value (refer to device datasheet,
                                        parameter "tstart_vrefint").
                                        Unit: us */

