MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_adc.h
#define LL_ADC_DELAY_TEMPSENSOR_STAB_US (25UL) /*!< Delay for temperature sensor stabilization time.
                                        Literal set to maximum value (refer to device datasheet, parameter "tSTART").
                                        Unit: us */

#define LL_ADC_DELAY_CALIB_ENABLE_ADC_CYCLES (4UL) /*!< Delay required between ADC end of calibration and ADC enable.
                                        Note: On this STM32 series, a minimum number of ADC clock cycles are required
                                              between ADC end of calibration and ADC enable.
                                              Wait time can be computed in user application by waiting for the
                                              equivalent number of CPU cycles, by taking into account ratio of CPU clock
                                              versus ADC clock prescalers.
                                        Unit: ADC clock cycles. */

/**
  * @}
  */

/**
  * @}
  */

/* Exported macro ----------------------------------------------------------------------------------------------------*/
/** @defgroup ADC_LL_Exported_Macros LL ADC Macros
  * @{
  */

/** @defgroup ADC_LL_EM_WRITE_READ Common write and read registers macro
  * @{
  */

/**
  * @brief  Write a value in ADC register.
  * @param  instance ADC Instance
  * @param  reg Register to be written
  * @param  value Value to be written in the register
  */
#define LL_ADC_WRITE_REG(instance, reg, value) STM32_WRITE_REG((instance)->reg, (value))

/**
  * @brief  Read a value in ADC register.
  * @param  instance ADC Instance
  * @param  reg Register to be read
  * @retval Register value
  */
#define LL_ADC_READ_REG(instance, reg) STM32_READ_REG((instance)->reg)
/**
  * @}
  */

/** @defgroup ADC_LL_EM_HELPER_MACRO ADC helper macro
  * @{
  */

/**
  * @brief  Helper macro to get ADC channel number in decimal format
  *         from literals LL_ADC_CHANNEL_x.
  * @param  channel This parameter can be one of the following values:
  *         @arg @ref LL_ADC_CHANNEL_0
  *         @arg @ref LL_ADC_CHANNEL_1
  *         @arg @ref LL_ADC_CHANNEL_2
  *         @arg @ref LL_ADC_CHANNEL_3
  *         @arg @ref LL_ADC_CHANNEL_4
  *         @arg @ref LL_ADC_CHANNEL_5
  *         @arg @ref LL_ADC_CHANNEL_6
  *         @arg @ref LL_ADC_CHANNEL_7
  *         @arg @ref LL_ADC_CHANNEL_8
  *         @arg @ref LL_ADC_CHANNEL_9
  *         @arg @ref LL_ADC_CHANNEL_10
  *         @arg @ref LL_ADC_CHANNEL_11
  *         @arg @ref LL_ADC_CHANNEL_12
  *         @arg @ref LL_ADC_CHANNEL_13
  *         @arg @ref LL_ADC_CHANNEL_VREFINT         (1)
  *         @arg @ref LL_ADC_CHANNEL_TEMPSENSOR      (1)
  *         @arg @ref LL_ADC_CHANNEL_VDDCORE         (1)
  *         @arg @ref LL_ADC_CHANNEL_OPAMP1_OUT      (1)
  *         @arg @ref LL_ADC_CHANNEL_OPAMP2_OUT      (1)
  *         @arg @ref LL_ADC_CHANNEL_OPAMP3_OUT      (1)
  *         @arg @ref LL_ADC_CHANNEL_VREFINT_ALT     (2)
  *         @arg @ref LL_ADC_CHANNEL_VDDCORE_ALT     (2)
  *         @arg @ref LL_ADC_CHANNEL_OPAMP1_OUT_ALT  (2)
  *         @arg @ref LL_ADC_CHANNEL_OPAMP2_OUT_ALT  (2)
  *         @arg @ref LL_ADC_CHANNEL_VREFINT_ALT2    (3)
  *         @arg @ref LL_ADC_CHANNEL_VDDCORE_ALT2    (3)
  *         @arg @ref LL_ADC_CHANNEL_OPAMP3_OUT_ALT  (3)
  *
  *         (1) On this STM32 series, parameter available only on ADC instance: ADC1.\n
  *         (2) On this STM32 series, parameter available only on ADC instance: ADC2.\n
  *         (3) On this STM32 series, parameter available only on ADC instance: ADC3.\n
  * @note   Example:
  *           LL_ADC_CHANNEL_TO_DECIMAL_NB(LL_ADC_CHANNEL_4)
  *           will return decimal number "4".
  * @note   The input can be a value from functions where a channel
  *         number is returned, either defined with number
  *         or with bitfield (only one bit must be set).
  * @retval Value between Min_Data=0 and Max_Data=13
  */
#define LL_ADC_CHANNEL_TO_DECIMAL_NB(channel)  ((channel) & LL_ADC_CH_NUMBER_MASK)

/**
  * @brief  Helper macro to get ADC channel in literal format LL_ADC_CHANNEL_x
  *         from number in decimal format.
  * @retval Value between Min_Data=0 and Max_Data=13
  * @note   Example:
  *           LL_ADC_DECIMAL_NB_TO_CHANNEL(4)
  *           will return a data equivalent to "LL_ADC_CHANNEL_4".
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_ADC_CHANNEL_0
  *         @arg @ref LL_ADC_CHANNEL_1
  *         @arg @ref LL_ADC_CHANNEL_2
  *         @arg @ref LL_ADC_CHANNEL_3
  *         @arg @ref LL_ADC_CHANNEL_4
  *         @arg @ref LL_ADC_CHANNEL_5
  *         @arg @ref LL_ADC_CHANNEL_6
  *         @arg @ref LL_ADC_CHANNEL_7
  *         @arg @ref LL_ADC_CHANNEL_8
  *         @arg @ref LL_ADC_CHANNEL_9
  *         @arg @ref LL_ADC_CHANNEL_10
  *         @arg @ref LL_ADC_CHANNEL_11
  *         @arg @ref LL_ADC_CHANNEL_12
  *         @arg @ref LL_ADC_CHANNEL_13
  */
#define LL_ADC_DECIMAL_NB_TO_CHANNEL(decimal_nb) (decimal_nb)

/**
  * @brief  Helper macro to determine whether the selected channel
  *         corresponds to literal definitions of driver.
  * @param  channel This parameter can be one of the following values:
  *         @arg @ref LL_ADC_CHANNEL_0
  *         @arg @ref LL_ADC_CHANNEL_1
  *         @arg @ref LL_ADC_CHANNEL_2
  *         @arg @ref LL_ADC_CHANNEL_3
  *         @arg @ref LL_ADC_CHANNEL_4
  *         @arg @ref LL_ADC_CHANNEL_5
  *         @arg @ref LL_ADC_CHANNEL_6
  *         @arg @ref LL_ADC_CHANNEL_7
  *         @arg @ref LL_ADC_CHANNEL_8
  *         @arg @ref LL_ADC_CHANNEL_9
  *         @arg @ref LL_ADC_CHANNEL_10
  *         @arg @ref LL_ADC_CHANNEL_11
  *         @arg @ref LL_ADC_CHANNEL_12
  *         @arg @ref LL_ADC_CHANNEL_13
  *         @arg @ref LL_ADC_CHANNEL_VREFINT         (1)
  *         @arg @ref LL_ADC_CHANNEL_TEMPSENSOR      (1)
  *         @arg @ref LL_ADC_CHANNEL_VDDCORE         (1)
  *         @arg @ref LL_ADC_CHANNEL_OPAMP1_OUT      (1)
  *         @arg @ref LL_ADC_CHANNEL_OPAMP2_OUT      (1)
  *         @arg @ref LL_ADC_CHANNEL_OPAMP3_OUT      (1)
  *         @arg @ref LL_ADC_CHANNEL_VREFINT_ALT     (2)
  *         @arg @ref LL_ADC_CHANNEL_VDDCORE_ALT     (2)
  *         @arg @ref LL_ADC_CHANNEL_OPAMP1_OUT_ALT  (2)
  *         @arg @ref LL_ADC_CHANNEL_OPAMP2_OUT_ALT  (2)
  *         @arg @ref LL_ADC_CHANNEL_VREFINT_ALT2    (3)
  *         @arg @ref LL_ADC_CHANNEL_VDDCORE_ALT2    (3)
  *         @arg @ref LL_ADC_CHANNEL_OPAMP3_OUT_ALT  (3)
  *
  *         (1) On this STM32 series, parameter available only on ADC instance: ADC1.\n
  *         (2) On this STM32 series, parameter available only on ADC instance: ADC2.\n
  *         (3) On this STM32 series, parameter available only on ADC instance: ADC3.\n
  * @note   The different literal definitions of ADC channels are:
  *         - ADC internal channel:
  *           LL_ADC_CHANNEL_VREFINT, LL_ADC_CHANNEL_TEMPSENSOR, ...
  *         - ADC external channel (channel connected to a GPIO pin):
  *           LL_ADC_CHANNEL_1, LL_ADC_CHANNEL_2, ...
  * @note   The channel parameter must be a value defined from literal
  *         definition of a ADC internal channel (LL_ADC_CHANNEL_VREFINT,
  *         LL_ADC_CHANNEL_TEMPSENSOR, ...),
  *         ADC external channel (LL_ADC_CHANNEL_1, LL_ADC_CHANNEL_2, ...),
  *         must not be a value from functions where a channel number is
  *         returned from ADC registers,
  *         because internal and external channels share the same channel
  *         number in ADC registers. The differentiation is made only with
  *         parameters definitions of driver.
  * @retval Value "0" if the channel corresponds to a parameter definition of a ADC external channel
  *         (channel connected to a GPIO pin).
  *         Value "1" if the channel corresponds to a parameter definition of a ADC internal channel.
  */
#define LL_ADC_IS_CHANNEL_INTERNAL(channel) (((channel) & LL_ADC_CH_INTERNAL_MASK) != 0UL)

/**
  * @brief  Helper macro to convert a channel defined from parameter
  *         definition of a ADC internal channel (LL_ADC_CHANNEL_VREFINT,
  *         LL_ADC_CHANNEL_TEMPSENSOR, ...),
  *         to its equivalent parameter definition of a ADC external channel
  *         (LL_ADC_CHANNEL_1, LL_ADC_CHANNEL_2, ...).
  * @param  channel This parameter can be one of the following values:
  *         @arg @ref LL_ADC_CHANNEL_0
  *         @arg @ref LL_ADC_CHANNEL_1
  *         @arg @ref LL_ADC_CHANNEL_2
  *         @arg @ref LL_ADC_CHANNEL_3
  *         @arg @ref LL_ADC_CHANNEL_4
  *         @arg @ref LL_ADC_CHANNEL_5
  *         @arg @ref LL_ADC_CHANNEL_6
  *         @arg @ref LL_ADC_CHANNEL_7
  *         @arg @ref LL_ADC_CHANNEL_8
  *         @arg @ref LL_ADC_CHANNEL_9
  *         @arg @ref LL_ADC_CHANNEL_10
  *         @arg @ref LL_ADC_CHANNEL_11
  *         @arg @ref LL_ADC_CHANNEL_12
  *         @arg @ref LL_ADC_CHANNEL_13
  * @note   The channel parameter can be, additionally to a value
  *         defined from parameter definition of a ADC internal channel
  *         (LL_ADC_CHANNEL_VREFINT, LL_ADC_CHANNEL_TEMPSENSOR, ...),
  *         a value defined from parameter definition of
  *         ADC external channel (LL_ADC_CHANNEL_1, LL_ADC_CHANNEL_2, ...)
  *         or a value from functions where a channel number is returned
  *         from ADC registers.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_ADC_CHANNEL_0
  *         @arg @ref LL_ADC_CHANNEL_1
  *         @arg @ref LL_ADC_CHANNEL_2
  *         @arg @ref LL_ADC_CHANNEL_3
  *         @arg @ref LL_ADC_CHANNEL_4
  *         @arg @ref LL_ADC_CHANNEL_5
  *         @arg @ref LL_ADC_CHANNEL_6
  *         @arg @ref LL_ADC_CHANNEL_7
  *         @arg @ref LL_ADC_CHANNEL_8
  *         @arg @ref LL_ADC_CHANNEL_9
  *         @arg @ref LL_ADC_CHANNEL_10
  *         @arg @ref LL_ADC_CHANNEL_11
  *         @arg @ref LL_ADC_CHANNEL_12
  *         @arg @ref LL_ADC_CHANNEL_13
  */
#define LL_ADC_CHANNEL_INTERNAL_TO_EXTERNAL(channel) ((channel) & LL_ADC_CH_NUMBER_MASK)

/**
  * @brief  Helper macro to get ADC group regular sequencer length in literal format LL_ADC_REG_SEQ_SCAN_x
  *         from number in decimal format.
  * @param  decimal_nb Value between Min_Data=1 and Max_Data=16 for ADC1 or ADC2
  * @note   Example:
  *           LL_ADC_DECIMAL_NB_TO_REG_SEQ_LENGTH(4)
  *           will return a data equivalent to "LL_ADC_REG_SEQ_SCAN_ENABLE_4RANKS".
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_ADC_REG_SEQ_SCAN_DISABLE
  *         @arg @ref LL_ADC_REG_SEQ_SCAN_ENABLE_2RANKS
  *         @arg @ref LL_ADC_REG_SEQ_SCAN_ENABLE_3RANKS
  *         @arg @ref LL_ADC_REG_SEQ_SCAN_ENABLE_4RANKS
  *         @arg @ref LL_ADC_REG_SEQ_SCAN_ENABLE_5RANKS
  *         @arg @ref LL_ADC_REG_SEQ_SCAN_ENABLE_6RANKS
  *         @arg @ref LL_ADC_REG_SEQ_SCAN_ENABLE_7RANKS
  *         @arg @ref LL_ADC_REG_SEQ_SCAN_ENABLE_8RANKS
  *         @arg @ref LL_ADC_REG_SEQ_SCAN_ENABLE_9RANKS
  *         @arg @ref LL_ADC_REG_SEQ_SCAN_ENABLE_10RANKS
  *         @arg @ref LL_ADC_REG_SEQ_SCAN_ENABLE_11RANKS
  *         @arg @ref LL_ADC_REG_SEQ_SCAN_ENABLE_12RANKS
  *         @arg @ref LL_ADC_REG_SEQ_SCAN_ENABLE_13RANKS
  *         @arg @ref LL_ADC_REG_SEQ_SCAN_ENABLE_14RANKS
  *         @arg @ref LL_ADC_REG_SEQ_SCAN_ENABLE_15RANKS
  *         @arg @ref LL_ADC_REG_SEQ_SCAN_ENABLE_16RANKS
  */
#define LL_ADC_DECIMAL_NB_TO_REG_SEQ_LENGTH(decimal_nb) \
  (((decimal_nb) - 1UL) << ADC_SQR1_LEN_Pos)

/**
  * @brief  Helper macro to get ADC group regular sequencer length in decimal format
  *         from literal format LL_ADC_REG_SEQ_SCAN_x.
  * @param  seq_length Can be one of the following values:
  *         @arg @ref LL_ADC_REG_SEQ_SCAN_DISABLE
  *         @arg @ref LL_ADC_REG_SEQ_SCAN_ENABLE_2RANKS
  *         @arg @ref LL_ADC_REG_SEQ_SCAN_ENABLE_3RANKS
  *         @arg @ref LL_ADC_REG_SEQ_SCAN_ENABLE_4RANKS
  *         @arg @ref LL_ADC_REG_SEQ_SCAN_ENABLE_5RANKS
  *         @arg @ref LL_ADC_REG_SEQ_SCAN_ENABLE_6RANKS
  *         @arg @ref LL_ADC_REG_SEQ_SCAN_ENABLE_7RANKS
  *         @arg @ref LL_ADC_REG_SEQ_SCAN_ENABLE_8RANKS
  *         @arg @ref LL_ADC_REG_SEQ_SCAN_ENABLE_9RANKS
  *         @arg @ref LL_ADC_REG_SEQ_SCAN_ENABLE_10RANKS
  *         @arg @ref LL_ADC_REG_SEQ_SCAN_ENABLE_11RANKS
  *         @arg @ref LL_ADC_REG_SEQ_SCAN_ENABLE_12RANKS
  *         @arg @ref LL_ADC_REG_SEQ_SCAN_ENABLE_13RANKS
  *         @arg @ref LL_ADC_REG_SEQ_SCAN_ENABLE_14RANKS
  *         @arg @ref LL_ADC_REG_SEQ_SCAN_ENABLE_15RANKS
  *         @arg @ref LL_ADC_REG_SEQ_SCAN_ENABLE_16RANKS
  * @note   Example:
  *           LL_ADC_REG_SEQ_LENGTH_TO_DECIMAL_NB(LL_ADC_REG_SEQ_SCAN_ENABLE_4RANKS)
  *           will return decimal number "4".
  * @retval Value between Min_Data=1 and Max_Data=16
  */
#define LL_ADC_REG_SEQ_LENGTH_TO_DECIMAL_NB(seq_length) \
  (((seq_length) >> ADC_SQR1_LEN_Pos) + 1UL)

/**
  * @brief  Helper macro to get ADC group injected sequencer length in literal format LL_ADC_INJ_SEQ_SCAN_x
  *         from number in decimal format.
  * @param  decimal_nb Value between Min_Data=1 and Max_Data=4.
  * @note   Example:
  *           LL_ADC_DECIMAL_NB_TO_REG_SEQ_LENGTH(4)
  *           will return a data equivalent to "LL_ADC_REG_SEQ_SCAN_ENABLE_4RANKS".
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_ADC_INJ_SEQ_SCAN_DISABLE
  *         @arg @ref LL_ADC_INJ_SEQ_SCAN_ENABLE_2RANKS
  *         @arg @ref LL_ADC_INJ_SEQ_SCAN_ENABLE_3RANKS
  *         @arg @ref LL_ADC_INJ_SEQ_SCAN_ENABLE_4RANKS
  */
#define LL_ADC_DECIMAL_NB_TO_INJ_SEQ_LENGTH(decimal_nb) \
  (((decimal_nb) << ADC_JSQR_JLEN_Pos) - 1UL)

/**
  * @brief  Helper macro to get ADC group injected sequencer length in decimal format
  *         from literal format LL_ADC_REG_SEQ_SCAN_x.
  * @param  seq_length value can be one of the following values:
  *         @arg @ref LL_ADC_INJ_SEQ_SCAN_DISABLE
  *         @arg @ref LL_ADC_INJ_SEQ_SCAN_ENABLE_2RANKS
  *         @arg @ref LL_ADC_INJ_SEQ_SCAN_ENABLE_3RANKS
  *         @arg @ref LL_ADC_INJ_SEQ_SCAN_ENABLE_4RANKS
  * @note   Example:
  *           LL_ADC_REG_SEQ_LENGTH_TO_DECIMAL_NB(LL_ADC_INJ_SEQ_SCAN_ENABLE_4RANKS)
  *           will return decimal number "4".
  * @retval Value between Min_Data=1 and Max_Data=4.
  */
#define LL_ADC_INJ_SEQ_LENGTH_TO_DECIMAL_NB(seq_length) \
  (((seq_length) >> ADC_JSQR_JLEN_Pos) + 1UL)

/**
  * @brief  Helper macro to get ADC group regular sequencer rank in literal format LL_ADC_REG_RANK_x
  *         from number in decimal format.
  * @param  decimal_nb Value between Min_Data=1 and Max_Data=16
  * @note   Example:
  *           LL_ADC_DECIMAL_NB_TO_REG_SEQ_LENGTH(2)
  *           will return a data equivalent to "LL_ADC_REG_RANK_2".
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_ADC_REG_RANK_1
  *         @arg @ref LL_ADC_REG_RANK_2
  *         @arg @ref LL_ADC_REG_RANK_3
  *         @arg @ref LL_ADC_REG_RANK_4
  *         @arg @ref LL_ADC_REG_RANK_5
  *         @arg @ref LL_ADC_REG_RANK_6
  *         @arg @ref LL_ADC_REG_RANK_7
  *         @arg @ref LL_ADC_REG_RANK_8
  *         @arg @ref LL_ADC_REG_RANK_9
  *         @arg @ref LL_ADC_REG_RANK_10
  *         @arg @ref LL_ADC_REG_RANK_11
  *         @arg @ref LL_ADC_REG_RANK_12
  *         @arg @ref LL_ADC_REG_RANK_13
  *         @arg @ref LL_ADC_REG_RANK_14
  *         @arg @ref LL_ADC_REG_RANK_15
  *         @arg @ref LL_ADC_REG_RANK_16
  */
#define LL_ADC_DECIMAL_NB_TO_REG_SEQ_RANK(decimal_nb) \
  ((((decimal_nb) / 5UL) << LL_ADC_SQRX_REGOFFSET_POS) | (((decimal_nb) % 5UL ) * 6UL))

/**
  * @brief  Helper macro to get ADC group regular sequencer rank in decimal format
  *         from literal format LL_ADC_REG_RANK_x.
  * @param  seq_length Can be one of the following values:
  *         @arg @ref LL_ADC_REG_RANK_1
  *         @arg @ref LL_ADC_REG_RANK_2
  *         @arg @ref LL_ADC_REG_RANK_3
  *         @arg @ref LL_ADC_REG_RANK_4
  *         @arg @ref LL_ADC_REG_RANK_5
  *         @arg @ref LL_ADC_REG_RANK_6
  *         @arg @ref LL_ADC_REG_RANK_7
  *         @arg @ref LL_ADC_REG_RANK_8
  *         @arg @ref LL_ADC_REG_RANK_9
  *         @arg @ref LL_ADC_REG_RANK_10
  *         @arg @ref LL_ADC_REG_RANK_11
  *         @arg @ref LL_ADC_REG_RANK_12
  *         @arg @ref LL_ADC_REG_RANK_13
  *         @arg @ref LL_ADC_REG_RANK_14
  *         @arg @ref LL_ADC_REG_RANK_15
  *         @arg @ref LL_ADC_REG_RANK_16
  * @note   Example:
  *           LL_ADC_REG_SEQ_RANK_TO_DECIMAL_NB(LL_ADC_REG_RANK_2)
  *           will return decimal number "2".
  * @retval Value between Min_Data=1 and Max_Data=16
  */
#define LL_ADC_REG_SEQ_RANK_TO_DECIMAL_NB(seq_length) \
  ((((seq_length) >> LL_ADC_SQRX_REGOFFSET_POS) * 5UL) + (((seq_length) & LL_ADC_REG_RANK_ID_SQRX_MASK) / 6UL))

/**
  * @brief  Helper macro to get ADC group injected sequencer rank in literal format LL_ADC_INJ_RANK_x
  *         from number in decimal format.
  * @param  decimal_nb Value between Min_Data=1 and Max_Data=16
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_ADC_INJ_RANK_1
  *         @arg @ref LL_ADC_INJ_RANK_2
  *         @arg @ref LL_ADC_INJ_RANK_3
  *         @arg @ref LL_ADC_INJ_RANK_4
  */
#define LL_ADC_DECIMAL_NB_TO_INJ_SEQ_RANK(decimal_nb) \
  ((((decimal_nb) - 1UL) << (LL_ADC_JDRX_REGOFFSET_POS)) | (((decimal_nb) * 6UL) + 3UL))

/**
  * @brief  Helper macro to get ADC group injected sequencer rank in decimal format
  *         from literal format LL_ADC_INJ_RANK_x.
  * @param  seq_length Can be one of the following values:
  *         @arg @ref LL_ADC_INJ_RANK_1
  *         @arg @ref LL_ADC_INJ_RANK_2
  *         @arg @ref LL_ADC_INJ_RANK_3
  *         @arg @ref LL_ADC_INJ_RANK_4
  * @note   Example:
  *           LL_ADC_INJ_SEQ_RANK_TO_DECIMAL_NB(LL_ADC_INJ_RANK_2)
  *           will return decimal number "2".
  * @retval Value between Min_Data=1 and Max_Data=16
  */
#define LL_ADC_INJ_SEQ_RANK_TO_DECIMAL_NB(seq_length) \
  ((((seq_length) & LL_ADC_INJ_RANK_ID_JSQR_MASK) - 3UL) / 6UL)

/**
  * @brief  Helper macro to get ADC oversampling right bit shift value in function of ratio to have oversampling data
  *         keeping current resolution (example: to keep data resolution, ratio x8 requires right shift of 3 bits).
  * @param  ovs_ratio_decimal Value power of 2 (1, 2, 4, 8, 16, ...) between Min_Data=1 and Max_Data=1024
  * @note   Example:
  *           LL_ADC_OVS_SHIFT_KEEP_RES(8)
  *           will return decimal number "3".
  * @retval Value between Min_Data=1 and Max_Data=11
  */
#define LL_ADC_OVS_SHIFT_KEEP_RES(ovs_ratio_decimal) \
  (STM32_POSITION_VAL(ovs_ratio_decimal))

/**
  * @brief  Helper macro to set the value of ADC analog watchdog threshold high
  *         or low in function of ADC resolution, when ADC resolution is
  *         different of default resolution (12 bit).
  * @param  resolution This parameter can be one of the following values:
  *         @arg @ref LL_ADC_RESOLUTION_12B
  *         @arg @ref LL_ADC_RESOLUTION_10B
  *         @arg @ref LL_ADC_RESOLUTION_8B
  *         @arg @ref LL_ADC_RESOLUTION_6B
  * @param  awd_threshold Analog watchdog threshold value. Value is signed and can exceed ADC resolution
  *         with post-processing computation (offset, oversampling, data shift, ...).
  *         Value between Min_Data=-4194304 (two's complement 0xFFC00000) and Max_Data=+4194303 (0x003FFFFF)
  * @note   To be used with function @ref LL_ADC_SetAnalogWDThresholds().
  *         Example, with a ADC resolution of 8 bits, to set the value of
  *         analog watchdog threshold high (on 8 bits):
  *           LL_ADC_SetAnalogWDThresholds
  *            (< ADCx param >,
  *             LL_ADC_ANALOGWD_SET_THRESHOLD_RES(LL_ADC_RESOLUTION_8B, <threshold_value_8_bits>)
  *            );
  * @retval Value is represented as unsigned for intermediate computation
  *         but is formatted as signed and can exceed ADC resolution with post-processing computation
  *         (offset, oversampling, data shift, ...): to be casted to signed 32 bits.
  */
#define LL_ADC_ANALOGWD_SET_THRESHOLD_RES(resolution, awd_threshold) \
  (uint32_t)(((uint32_t)(awd_threshold)) << ((resolution) >> (ADC_CFGR1_RES_Pos - 1U)))

/**
  * @brief  Helper macro to get the value of ADC analog watchdog threshold high
  *         or low in function of ADC resolution, when ADC resolution is
  *         different of 12 bits.
  * @param  resolution This parameter can be one of the following values:
  *         @arg @ref LL_ADC_RESOLUTION_12B
  *         @arg @ref LL_ADC_RESOLUTION_10B
  *         @arg @ref LL_ADC_RESOLUTION_8B
  *         @arg @ref LL_ADC_RESOLUTION_6B
  * @param  awd_threshold Analog watchdog threshold value. Value is signed and can exceed ADC resolution
  *         with post-processing computation (offset, oversampling, data shift, ...).
  *         Value between Min_Data=-4194304 (two's complement 0xFFC00000) and Max_Data=+4194303 (0x003FFFFF)
  * @note   To be used with function @ref LL_ADC_GetAnalogWDThresholds().
  *         Example, with a ADC resolution of 8 bits, to get the value of
  *         analog watchdog threshold high (on 8 bits):
  *           < threshold_value_6_bits > = LL_ADC_ANALOGWD_GET_THRESHOLD_RES
  *            (LL_ADC_RESOLUTION_8B,
  *             LL_ADC_GetAnalogWDThresholds(<ADCx param>, LL_ADC_AWD_THRESHOLD_HIGH)
  *            );
  * @retval Value is represented as unsigned for intermediate computation
  *         but is formatted as signed and can exceed ADC resolution with post-processing computation
  *         (offset, oversampling, data shift, ...): to be casted to signed 32 bits.
  */
#define LL_ADC_ANALOGWD_GET_THRESHOLD_RES(resolution, awd_threshold) \
  (uint32_t)((((uint32_t)(awd_threshold)) >> ((resolution) >> (ADC_CFGR1_RES_Pos - 1U))) \
             | (((uint32_t)(awd_threshold)) & (~ADC_AWD1LTR_LTR)))

/**
  * @brief  Helper macro to set the value of ADC offset level in function of ADC resolution,
  *         when ADC resolution is different of default resolution.
  * @param  resolution This parameter can be one of the following values:
  *         @arg @ref LL_ADC_RESOLUTION_12B
  *         @arg @ref LL_ADC_RESOLUTION_10B
  *         @arg @ref LL_ADC_RESOLUTION_8B
  *         @arg @ref LL_ADC_RESOLUTION_6B
  * @param  offset_level Value between Min_Data=0x00000000 and Max_Data=0x003FFFFF
  * @note   To be used with function @ref LL_ADC_SetOffsetLevel().
  *         Example, with a ADC resolution of 8 bits, to set the value of
  *         analog watchdog threshold high (on 8 bits):
  *           LL_ADC_SetOffset
  *            (< ADCx param >,
  *             LL_ADC_OFFSET_SET_LEVEL_RES(LL_ADC_RESOLUTION_8B, <offset_level_8_bits>)
  *            );
  * @retval Value between Min_Data=0x00000000 and Max_Data=0x003FFFFF
  */
#define LL_ADC_OFFSET_SET_LEVEL_RES(resolution, offset_level) \
  ((offset_level) << ((resolution) >> (ADC_CFGR1_RES_Pos - 1U)))

