MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_adc.h
  if (((int32_t)*LL_ADC_TEMPSENSOR_CAL2_ADDR - (int32_t)*LL_ADC_TEMPSENSOR_CAL1_ADDR) == 0)
  {
    temperature_degc = (int32_t)LL_ADC_TEMPERATURE_CALC_ERROR;
  }
  else
  {
    /* Scale ADC conversion data to resolution corresponding to temperature sensor calibration parameters */
    data_res = LL_ADC_CONVERT_DATA_RESOLUTION(tempsensor_conv_data,
                                              (uint32_t)resolution,
                                              (uint32_t)LL_ADC_RESOLUTION_12B);

    /* Scale ADC conversion data to reference voltage corresponding to temperature sensor calibration parameters */
    data_res = ((data_res * (int32_t)vref_analog_voltage) / (int32_t)LL_ADC_TEMPSENSOR_CAL_VREF);

    /* Compute temperature */
    temperature_degc = ((((int32_t)data_res - (int32_t)(*LL_ADC_TEMPSENSOR_CAL1_ADDR))
                         * (int32_t)(LL_ADC_TEMPSENSOR_CAL2_TEMP - LL_ADC_TEMPSENSOR_CAL1_TEMP))
                        / (int32_t)((int32_t)(*LL_ADC_TEMPSENSOR_CAL2_ADDR) - (int32_t)(*LL_ADC_TEMPSENSOR_CAL1_ADDR)))
                       + LL_ADC_TEMPSENSOR_CAL1_TEMP;
  }

  return temperature_degc;
}

/**
  * @brief  Helper macro to calculate the temperature (unit: degree Celsius)
  *         from ADC conversion data of internal temperature sensor.
  * @param  tempsensor_typ_avg_slope Device datasheet data: Temperature sensor slope typical value
  *                                  (unit: uV/DegCelsius).
  *                                  On this STM32 series, refer to device datasheet parameter "Avg_Slope".
  * @param  tempsensor_typ_calx_v    Device datasheet data: Temperature sensor voltage typical value
  *                                  (at temperature and Vref+ defined in parameters below) (unit: mVolt).
  *                                  On this STM32 series, refer to device datasheet parameter "V30"
  *                                  (corresponding to TS_CAL1).
  * @param  tempsensor_calx_temp     Device datasheet data: Temperature at which temperature sensor voltage
  *                                  see parameter above) is corresponding (unit: mVolt)
  * @param  vref_analog_voltage      Analog reference voltage Vref+ (unit: mVolt)
  * @param  tempsensor_conv_data     ADC conversion data of internal temperature sensor (unit: digital value).
  * @param  resolution               ADC resolution at which ADC conversion has been performed
  *         This parameter can be one of the following values:
  *         @arg @ref LL_ADC_RESOLUTION_12B
  *         @arg @ref LL_ADC_RESOLUTION_10B
  *         @arg @ref LL_ADC_RESOLUTION_8B
  *         @arg @ref LL_ADC_RESOLUTION_6B
  * @note   Computation is using temperature sensor typical values
  *         (refer to device datasheet).
  * @note   Calculation formula:
  *           Temperature = (TS_TYP_CALx_VOLT(uV) - TS_ADC_DATA * Conversion_uV)
  *                         / Avg_Slope + CALx_TEMP
  *           with TS_ADC_DATA      = temperature sensor raw data measured by ADC
  *                                   (unit: digital value)
  *                Avg_Slope        = temperature sensor slope
  *                                   (unit: uV/Degree Celsius)
  *                TS_TYP_CALx_VOLT = temperature sensor digital value at
  *                                   temperature CALx_TEMP (unit: mVolt)
  *         Caution: Calculation relevancy under reserve the temperature sensor
  *                  of the current device has characteristics in line with
  *                  datasheet typical values.
  *                  If temperature sensor calibration values are available on
  *                  on this device (presence of macro LL_ADC_CALC_TEMPERATURE()),
  *                  temperature calculation will be more accurate using
  *                  helper macro @ref LL_ADC_CALC_TEMPERATURE().
  * @note   Analog reference voltage (Vref+) must be either known from
  *         user board environment or can be calculated using ADC measurement
  *         and ADC helper macro @ref LL_ADC_CALC_VREFANALOG_VOLTAGE().
  * @retval Temperature (unit: degree Celsius)
  */
__STATIC_INLINE int32_t LL_ADC_CALC_TEMPERATURE_TYP_PARAMS(int32_t tempsensor_typ_avg_slope,
                                                           uint32_t tempsensor_typ_calx_v,
                                                           int32_t tempsensor_calx_temp,
                                                           uint32_t vref_analog_voltage,
                                                           uint32_t tempsensor_conv_data,
                                                           uint32_t resolution)
{
  int32_t temperature_degc;
  uint32_t data_mvolt;

  /* Convert ADC conversion data to voltage */
  data_mvolt = ((tempsensor_conv_data * vref_analog_voltage) / LL_ADC_DIGITAL_SCALE(resolution));

  /* Compute temperature */
  temperature_degc = ((((int32_t)data_mvolt * 1000L) - ((int32_t)tempsensor_typ_calx_v * 1000L))
                      / (int32_t)tempsensor_typ_avg_slope)
                     + (int32_t)tempsensor_calx_temp;

  return temperature_degc;
}

/**
  * @}
  */

/**
  * @}
  */

/* Exported functions --------------------------------------------------------*/
/** @defgroup ADC_LL_Exported_Functions LL ADC Functions
  * @{
  */

/** @defgroup ADC_LL_EF_DMA_Management ADC DMA management
  * @{
  */
#if defined(ADC_MULTIMODE_SUPPORT)
/**
  * @brief  Function to help to configure DMA transfer from ADC: retrieve the
  *         ADC register address from ADC instance and a list of ADC registers
  *         intended to be used (most commonly) with DMA transfer.
  * @rmtoll
  *  DR       RDATA          LL_ADC_DMA_GetRegAddr\n
  *  CDR      RDATA_MST      LL_ADC_DMA_GetRegAddr\n
  *  CDR      RDATA_SLV      LL_ADC_DMA_GetRegAddr\n
  *  CDR2     RDATA_ALT      LL_ADC_DMA_GetRegAddr
  * @param  p_adc Pointer to ADC instance
  * @param  register_sel This parameter can be one of the following values:
  *         @arg @ref LL_ADC_DMA_REG_REGULAR_DATA
  *         @arg @ref LL_ADC_DMA_REG_MM_REGULAR_PACK_DATA (1)
  *         @arg @ref LL_ADC_DMA_REG_MM_REGULAR_UNPACK_DATA (1)
  *
  *         (1) Available on devices featuring ADC multimode
  * @note   These ADC registers are data registers:
  *         when ADC conversion data is available in ADC data registers,
  *         ADC generates a DMA transfer request.
  * @note   This macro is intended to be used with LL DMA driver, refer to
  *         function "LL_DMA_ConfigAddresses()".
  *         Example:
  *           LL_DMA_ConfigAddresses(DMA1,
  *                                  LL_DMA_CHANNEL_1,
  *                                  LL_ADC_DMA_GetRegAddr(ADC1, LL_ADC_DMA_REG_REGULAR_DATA),
  *                                  (uint32_t)&< array or variable >,
  *                                  LL_DMA_DIRECTION_PERIPH_TO_MEMORY);
  * @note   For devices with several ADC: in multimode, some devices
  *         use a different data register outside of ADC instance scope
  *         (common data register). This macro manages this register difference,
  *         only ADC instance has to be set as parameter.
  * @retval ADC register address
  */
__STATIC_INLINE uint32_t LL_ADC_DMA_GetRegAddr(const ADC_TypeDef *p_adc, uint32_t register_sel)
{
  uint32_t data_reg_addr;

#if defined(ADC_MULTIMODE_SUPPORT)
  if (register_sel == LL_ADC_DMA_REG_REGULAR_DATA)
  {
    /* Retrieve address of register DR */
    data_reg_addr = (uint32_t) &(p_adc->DR);
  }
  else if (register_sel == LL_ADC_DMA_REG_MM_REGULAR_PACK_DATA)
  {
    data_reg_addr = (uint32_t) &((ADC_COMMON_INSTANCE(p_adc))->CDR);
  }
  else /* (register_sel == LL_ADC_DMA_REG_MM_REGULAR_UNPACK_DATA) */
  {
    data_reg_addr = (uint32_t) &((ADC_COMMON_INSTANCE(p_adc))->CDR2);
  }
#else
  data_reg_addr = (uint32_t) &(p_adc->DR);
#endif /* ADC_MULTIMODE_SUPPORT */

  return data_reg_addr;
}
#else
/**
  * @brief  Function to help to configure DMA transfer from ADC: retrieve the
  *         ADC register address from ADC instance and a list of ADC registers
  *         intended to be used (most commonly) with DMA transfer.
  * @rmtoll
  *  DR       RDATA          LL_ADC_DMA_GetRegAddr
  * @param  p_adc Pointer to ADC instance
  * @param  register_sel This parameter can be one of the following values:
  *         @arg @ref LL_ADC_DMA_REG_REGULAR_DATA
  * @note   These ADC registers are data registers:
  *         when ADC conversion data is available in ADC data registers,
  *         ADC generates a DMA transfer request.
  * @note   This macro is intended to be used with LL DMA driver, refer to
  *         function "LL_DMA_ConfigAddresses()".
  *         Example:
  *           LL_DMA_ConfigAddresses(DMA1,
  *                                  LL_DMA_CHANNEL_1,
  *                                  LL_ADC_DMA_GetRegAddr(ADC1, LL_ADC_DMA_REG_REGULAR_DATA),
  *                                  (uint32_t)&< array or variable >,
  *                                  LL_DMA_DIRECTION_PERIPH_TO_MEMORY);
  * @note   For devices with several ADC: in multimode, some devices
  *         use a different data register outside of ADC instance scope
  *         (common data register). This macro manages this register difference,
  *         only ADC instance has to be set as parameter.
  * @retval ADC register address
  */
__STATIC_INLINE uint32_t LL_ADC_DMA_GetRegAddr(const ADC_TypeDef *p_adc, uint32_t register_sel)
{
  /* Prevent unused argument(s) compilation warning */
  (void)(register_sel);

  /* Retrieve address of register DR */
  return (uint32_t) &(p_adc->DR);
}
#endif /* ADC_MULTIMODE_SUPPORT */

/**
  * @}
  */

/** @defgroup ADC_LL_EF_Configuration_ADC_Common Configuration of ADC hierarchical scope:
  *           common to several ADC instances
  * @{
  */
/**
  * @brief  Set parameter common to several ADC: measurement path to
  *         internal channels (VrefInt, temperature sensor, ...).
  *         Add paths to the current configuration.
  * @rmtoll
  *  CCR      VREFEN         LL_ADC_SetCommonPathInternalChAdd\n
  *  CCR      TSEN           LL_ADC_SetCommonPathInternalChAdd
  * @param  p_adc_common Pointer to ADC common instance
  *         (can be set directly from CMSIS definition ADCxy_COMMON or using macro ADC_COMMON_INSTANCE())
  * @param  path_internal This parameter can be one of the following values:
  *         @arg @ref LL_ADC_CHANNEL_VREFINT         (1)
  *         @arg @ref LL_ADC_CHANNEL_TEMPSENSOR      (1)
  *         @arg @ref LL_ADC_CHANNEL_VDDCORE         (1)
  *         @arg @ref LL_ADC_CHANNEL_OPAMP1_OUT      (1)
  *         @arg @ref LL_ADC_CHANNEL_OPAMP2_OUT      (1)
  *         @arg @ref LL_ADC_CHANNEL_OPAMP3_OUT      (1)
  *         @arg @ref LL_ADC_CHANNEL_VREFINT_ALT     (2)
  *         @arg @ref LL_ADC_CHANNEL_VDDCORE_ALT     (2)
  *         @arg @ref LL_ADC_CHANNEL_OPAMP1_OUT_ALT  (2)
  *         @arg @ref LL_ADC_CHANNEL_OPAMP2_OUT_ALT  (2)
  *         @arg @ref LL_ADC_CHANNEL_VREFINT_ALT2    (3)
  *         @arg @ref LL_ADC_CHANNEL_VDDCORE_ALT2    (3)
  *         @arg @ref LL_ADC_CHANNEL_OPAMP3_OUT_ALT  (3)
  *
  *         (1) On this STM32 series, parameter available only on ADC instance: ADC1.\n
  *         (2) On this STM32 series, parameter available only on ADC instance: ADC2.\n
  *         (3) On this STM32 series, parameter available only on ADC instance: ADC3.\n
  * @note   Stabilization time of measurement path to internal channel:
  *         After enabling internal paths, before starting ADC conversion,
  *         a delay is required for internal voltage reference and
  *         temperature sensor stabilization time.
  *         Refer to device datasheet.
  *         Refer to literal @ref LL_ADC_DELAY_VREFINT_STAB_US.
  *         Refer to literals @ref LL_ADC_DELAY_TEMPSENSOR_STAB_US,
  * @note   ADC internal channel sampling time constraint:
  *         For ADC conversion of internal channels,
  *         a sampling time minimum value is required.
  *         Refer to device datasheet.
  * @note   On this STM32 series, setting of this feature is conditioned to
  *         ADC state:
  *         All ADC instances of the ADC common group must be disabled.
  */
__STATIC_INLINE void LL_ADC_SetCommonPathInternalChAdd(ADC_Common_TypeDef *p_adc_common, uint32_t path_internal)
{
  STM32_SET_BIT(p_adc_common->CCR, path_internal & LL_ADC_COMMON_PATH_INTERNAL_MASK);
}

/**
  * @brief  Set parameter common to several ADC: measurement path to
  *         internal channels (VrefInt, temperature sensor, ...).
  *         Remove paths to the current configuration.
  * @rmtoll
  *  CCR      VREFEN         LL_ADC_SetCommonPathInternalChRem\n
  *  CCR      TSEN           LL_ADC_SetCommonPathInternalChRem
  * @param  p_adc_common Pointer to ADC common instance
  *         (can be set directly from CMSIS definition ADCxy_COMMON or using macro ADC_COMMON_INSTANCE())
  * @param  path_internal This parameter can be one of the following values:
  *         @arg @ref LL_ADC_CHANNEL_VREFINT         (1)
  *         @arg @ref LL_ADC_CHANNEL_TEMPSENSOR      (1)
  *         @arg @ref LL_ADC_CHANNEL_VDDCORE         (1)
  *         @arg @ref LL_ADC_CHANNEL_OPAMP1_OUT      (1)
  *         @arg @ref LL_ADC_CHANNEL_OPAMP2_OUT      (1)
  *         @arg @ref LL_ADC_CHANNEL_OPAMP3_OUT      (1)
  *         @arg @ref LL_ADC_CHANNEL_VREFINT_ALT     (2)
  *         @arg @ref LL_ADC_CHANNEL_VDDCORE_ALT     (2)
  *         @arg @ref LL_ADC_CHANNEL_OPAMP1_OUT_ALT  (2)
  *         @arg @ref LL_ADC_CHANNEL_OPAMP2_OUT_ALT  (2)
  *         @arg @ref LL_ADC_CHANNEL_VREFINT_ALT2    (3)
  *         @arg @ref LL_ADC_CHANNEL_VDDCORE_ALT2    (3)
  *         @arg @ref LL_ADC_CHANNEL_OPAMP3_OUT_ALT  (3)
  *
  *         (1) On this STM32 series, parameter available only on ADC instance: ADC1.\n
  *         (2) On this STM32 series, parameter available only on ADC instance: ADC2.\n
  *         (3) On this STM32 series, parameter available only on ADC instance: ADC3.\n
  * @note   On this STM32 series, setting of this feature is conditioned to
  *         ADC state:
  *         All ADC instances of the ADC common group must be disabled.
  */
__STATIC_INLINE void LL_ADC_SetCommonPathInternalChRem(ADC_Common_TypeDef *p_adc_common, uint32_t path_internal)
{
  STM32_CLEAR_BIT(p_adc_common->CCR, path_internal & LL_ADC_COMMON_PATH_INTERNAL_MASK);
}

/**
  * @brief  Set parameter common to several ADC: measurement path to internal
  *         channels (VrefInt, temperature sensor, ...).
  * @rmtoll
  *  CCR      VREFEN         LL_ADC_SetCommonPathInternalCh\n
  *  CCR      TSEN           LL_ADC_SetCommonPathInternalCh
  * @param  p_adc_common Pointer to ADC common instance
  *         (can be set directly from CMSIS definition ADCxy_COMMON or using macro ADC_COMMON_INSTANCE())
  * @param  path_internal This parameter can be one of literal LL_ADC_PATH_INTERNAL_x
  *         or one of the following values:
  *         @arg @ref LL_ADC_CHANNEL_VREFINT         (1)
  *         @arg @ref LL_ADC_CHANNEL_TEMPSENSOR      (1)
  *         @arg @ref LL_ADC_CHANNEL_VDDCORE         (1)
  *         @arg @ref LL_ADC_CHANNEL_OPAMP1_OUT      (1)
  *         @arg @ref LL_ADC_CHANNEL_OPAMP2_OUT      (1)
  *         @arg @ref LL_ADC_CHANNEL_OPAMP3_OUT      (1)
  *         @arg @ref LL_ADC_CHANNEL_VREFINT_ALT     (2)
  *         @arg @ref LL_ADC_CHANNEL_VDDCORE_ALT     (2)
  *         @arg @ref LL_ADC_CHANNEL_OPAMP1_OUT_ALT  (2)
  *         @arg @ref LL_ADC_CHANNEL_OPAMP2_OUT_ALT  (2)
  *         @arg @ref LL_ADC_CHANNEL_VREFINT_ALT2    (3)
  *         @arg @ref LL_ADC_CHANNEL_VDDCORE_ALT2    (3)
  *         @arg @ref LL_ADC_CHANNEL_OPAMP3_OUT_ALT  (3)
  *
  *         (1) On this STM32 series, parameter available only on ADC instance: ADC1.\n
  *         (2) On this STM32 series, parameter available only on ADC instance: ADC2.\n
  *         (3) On this STM32 series, parameter available only on ADC instance: ADC3.\n
  * @note   Stabilization time of measurement path to internal channel:
  *         After enabling internal paths, before starting ADC conversion,
  *         a delay is required for internal voltage reference and
  *         temperature sensor stabilization time.
  *         Refer to device datasheet.
  *         Refer to literal @ref LL_ADC_DELAY_VREFINT_STAB_US.
  *         Refer to literal @ref LL_ADC_DELAY_TEMPSENSOR_STAB_US.
  * @note   ADC internal channel sampling time constraint:
  *         For ADC conversion of internal channels,
  *         a sampling time minimum value is required.
  *         Refer to device datasheet.
  * @note   On this STM32 series, setting of this feature is conditioned to
  *         ADC state:
  *         All ADC instances of the ADC common group must be disabled.
  */
__STATIC_INLINE void LL_ADC_SetCommonPathInternalCh(ADC_Common_TypeDef *p_adc_common, uint32_t path_internal)
{
  STM32_MODIFY_REG(p_adc_common->CCR,
                   LL_ADC_COMMON_PATH_INTERNAL_MASK,
                   path_internal & LL_ADC_COMMON_PATH_INTERNAL_MASK);
}

/**
  * @brief  Get parameter common to several ADC: measurement path to internal
  *         channels (VrefInt, temperature sensor, ...).
  * @rmtoll
  *  CCR      VREFEN         LL_ADC_GetCommonPathInternalCh\n
  *  CCR      TSEN           LL_ADC_GetCommonPathInternalCh
  * @param  p_adc_common Pointer to ADC common instance
  *         (can be set directly from CMSIS definition ADCxy_COMMON or using macro ADC_COMMON_INSTANCE())
  * @note   One or several values can be selected.
  *         Example: (LL_ADC_PATH_INTERNAL_VREFINT | LL_ADC_PATH_INTERNAL_TEMPSENSOR)
  * @retval Returned value can be a combination of literals LL_ADC_PATH_INTERNAL_x.
  */
__STATIC_INLINE uint32_t LL_ADC_GetCommonPathInternalCh(const ADC_Common_TypeDef *p_adc_common)
{
  return (uint32_t)(STM32_READ_BIT(p_adc_common->CCR, LL_ADC_COMMON_PATH_INTERNAL_MASK));
}

/**
  * @}
  */

/** @defgroup ADC_LL_EF_Configuration_ADC_Instance Configuration of ADC hierarchical scope: ADC instance
  * @{
  */

/**
  * @brief  Set ADC calibration factor in the mode single-ended
  *         or differential (for devices with differential mode available).
  * @rmtoll
  *  CALFACT  CALFACT_S      LL_ADC_SetCalibrationFactor\n
  *  CALFACT  CALFACT_D      LL_ADC_SetCalibrationFactor
  * @param  p_adc Pointer to ADC instance
  * @param  input_mode This parameter can be one of the following values:
  *         @arg @ref LL_ADC_IN_SINGLE_ENDED
  * @param  calibration_factor Value between Min_Data=0x00 and Max_Data=0x7F
  * @note   This function is intended to set calibration parameters
  *         without having to perform a new calibration using
  *         @ref LL_ADC_StartCalibration().
  * @note   On this STM32 series, setting of this feature is conditioned to
  *         ADC state:
  *         ADC must be enabled, without calibration ongoing, without conversion
  *         ongoing on group regular.
  */
__STATIC_INLINE void LL_ADC_SetCalibrationFactor(ADC_TypeDef *p_adc, uint32_t input_mode, uint32_t calibration_factor)
{
  /* Prevent unused argument(s) compilation warning */
  (void)(input_mode);

  STM32_MODIFY_REG(p_adc->CALFACT, ADC_CALFACT_CALFACT, calibration_factor);
}

/**
  * @brief  Get ADC calibration factor in mode single-ended
  *         or differential (for devices with differential mode available).
  * @rmtoll
  *  CALFACT  CALFACT_S      LL_ADC_GetCalibrationFactor\n
  *  CALFACT  CALFACT_D      LL_ADC_GetCalibrationFactor
  * @param  p_adc Pointer to ADC instance
  * @param  input_mode This parameter can be one of the following values:
  *         @arg @ref LL_ADC_IN_SINGLE_ENDED
  * @note   Calibration factors are set by hardware after performing
  *         a calibration run using function @ref LL_ADC_StartCalibration().
  * @retval Value between Min_Data=0x00 and Max_Data=0x1FF
  */
__STATIC_INLINE uint32_t LL_ADC_GetCalibrationFactor(const ADC_TypeDef *p_adc, uint32_t input_mode)
{
  /* Prevent unused argument(s) compilation warning */
  (void)(input_mode);

  return (uint32_t)(STM32_READ_BIT(p_adc->CALFACT, ADC_CALFACT_CALFACT));
}

/**
  * @brief  Set ADC resolution.
  *         Refer to reference manual for alignments formats
  *         dependencies to ADC resolutions.
  * @rmtoll
  *  CFGR1    RES            LL_ADC_SetResolution
  * @param  p_adc Pointer to ADC instance
  * @param  resolution This parameter can be one of the following values:
  *         @arg @ref LL_ADC_RESOLUTION_12B
  *         @arg @ref LL_ADC_RESOLUTION_10B
  *         @arg @ref LL_ADC_RESOLUTION_8B
  *         @arg @ref LL_ADC_RESOLUTION_6B
  * @note   On this STM32 series, setting of this feature is conditioned to
  *         ADC state:
  *         ADC must be disabled or enabled without conversion ongoing
  *         on either groups regular or injected.
  */
__STATIC_INLINE void LL_ADC_SetResolution(ADC_TypeDef *p_adc, uint32_t resolution)
{
  STM32_MODIFY_REG(p_adc->CFGR1, ADC_CFGR1_RES, resolution);
}

/**
  * @brief  Get ADC resolution.
  *         Refer to reference manual for alignments formats
  *         dependencies to ADC resolutions.
  * @rmtoll
  *  CFGR1    RES            LL_ADC_GetResolution
  * @param  p_adc Pointer to ADC instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_ADC_RESOLUTION_12B
  *         @arg @ref LL_ADC_RESOLUTION_10B
  *         @arg @ref LL_ADC_RESOLUTION_8B
  *         @arg @ref LL_ADC_RESOLUTION_6B
  */
__STATIC_INLINE uint32_t LL_ADC_GetResolution(const ADC_TypeDef *p_adc)
{
  return (uint32_t)(STM32_READ_BIT(p_adc->CFGR1, ADC_CFGR1_RES));
}

/**
  * @brief  Set ADC conversion data left bit shift for ADC groups regular and injected conversions.
  * @rmtoll
  *  CFGR2    LSHIFT         LL_ADC_SetLeftBitShift
  * @param  p_adc Pointer to ADC instance
  * @param  left_bit_shift This parameter can be one of the following values:
  *         @arg @ref LL_ADC_LEFT_BIT_SHIFT_NONE
  *         @arg @ref LL_ADC_LEFT_BIT_SHIFT_1
  *         @arg @ref LL_ADC_LEFT_BIT_SHIFT_2
  *         @arg @ref LL_ADC_LEFT_BIT_SHIFT_3
  *         @arg @ref LL_ADC_LEFT_BIT_SHIFT_4
  *         @arg @ref LL_ADC_LEFT_BIT_SHIFT_5
  *         @arg @ref LL_ADC_LEFT_BIT_SHIFT_6
  *         @arg @ref LL_ADC_LEFT_BIT_SHIFT_7
  *         @arg @ref LL_ADC_LEFT_BIT_SHIFT_8
  *         @arg @ref LL_ADC_LEFT_BIT_SHIFT_9
  *         @arg @ref LL_ADC_LEFT_BIT_SHIFT_10
  *         @arg @ref LL_ADC_LEFT_BIT_SHIFT_11
  *         @arg @ref LL_ADC_LEFT_BIT_SHIFT_12
  *         @arg @ref LL_ADC_LEFT_BIT_SHIFT_13
  *         @arg @ref LL_ADC_LEFT_BIT_SHIFT_14
  *         @arg @ref LL_ADC_LEFT_BIT_SHIFT_15
  * @note   On this STM32 series, setting of this feature is conditioned to
  *         ADC state:
  *         ADC must be disabled or enabled without conversion ongoing
  *         on group regular.
  */
__STATIC_INLINE void LL_ADC_SetLeftBitShift(ADC_TypeDef *p_adc, uint32_t left_bit_shift)
{
  STM32_MODIFY_REG(p_adc->CFGR2, ADC_CFGR2_LSHIFT, left_bit_shift);
}

