MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_adc.h
/**
  * @brief  Get ADC conversion data left bit shift for ADC groups regular and injected conversions.
  * @rmtoll
  *  CFGR2    LSHIFT         LL_ADC_GetLeftBitShift
  * @param  p_adc Pointer to ADC instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_ADC_LEFT_BIT_SHIFT_NONE
  *         @arg @ref LL_ADC_LEFT_BIT_SHIFT_1
  *         @arg @ref LL_ADC_LEFT_BIT_SHIFT_2
  *         @arg @ref LL_ADC_LEFT_BIT_SHIFT_3
  *         @arg @ref LL_ADC_LEFT_BIT_SHIFT_4
  *         @arg @ref LL_ADC_LEFT_BIT_SHIFT_5
  *         @arg @ref LL_ADC_LEFT_BIT_SHIFT_6
  *         @arg @ref LL_ADC_LEFT_BIT_SHIFT_7
  *         @arg @ref LL_ADC_LEFT_BIT_SHIFT_8
  *         @arg @ref LL_ADC_LEFT_BIT_SHIFT_9
  *         @arg @ref LL_ADC_LEFT_BIT_SHIFT_10
  *         @arg @ref LL_ADC_LEFT_BIT_SHIFT_11
  *         @arg @ref LL_ADC_LEFT_BIT_SHIFT_12
  *         @arg @ref LL_ADC_LEFT_BIT_SHIFT_13
  *         @arg @ref LL_ADC_LEFT_BIT_SHIFT_14
  *         @arg @ref LL_ADC_LEFT_BIT_SHIFT_15
  */
__STATIC_INLINE uint32_t LL_ADC_GetLeftBitShift(const ADC_TypeDef *p_adc)
{
  return (uint32_t)(STM32_READ_BIT(p_adc->CFGR2, ADC_CFGR2_LSHIFT));
}

/**
  * @brief  Set ADC low power mode.
  * @rmtoll
  *  CFGR1    AUTDLY         LL_ADC_SetLowPowerMode
  * @param  p_adc Pointer to ADC instance
  * @param  low_power_mode This parameter can be one of the following values:
  *         @arg @ref LL_ADC_LP_MODE_NONE
  *         @arg @ref LL_ADC_LP_AUTOWAIT
  * @note   Description of ADC low power modes:
  *         - ADC low power mode "auto wait": Dynamic low power mode,
  *           ADC conversions occurrences are limited to the minimum necessary
  *           in order to reduce power consumption.
  *           New ADC conversion starts only when the previous
  *           unitary conversion data (for ADC group regular)
  *           or previous sequence conversions data (for ADC group injected)
  *           has been retrieved by user software.
  *           In the meantime, ADC remains idle: does not performs any
  *           other conversion.
  *           This mode allows to automatically adapt the ADC conversions
  *           triggers to the speed of the software that reads the data.
  *           Moreover, this avoids risk of overrun for low frequency
  *           applications.
  *           How to use this low power mode:
  *           - It is not recommended to use with interruption or DMA
  *             since these modes have to clear immediately the EOC flag
  *             (by CPU to free the IRQ pending event or by DMA).
  *             Auto wait will work but fort a very short time, discarding
  *             its intended benefit (except specific case of high load of CPU
  *             or DMA transfers which can justify usage of auto wait).
  *           - Do use with polling: 1. Start conversion,
  *             2. Later on, when conversion data is needed: poll for end of
  *             conversion  to ensure that conversion is completed and
  *             retrieve ADC conversion data. This will trig another
  *             ADC conversion start.
  *         - ADC low power mode "auto power-off" (feature available on
  *           this device if parameter LL_ADC_LP_AUTOPOWEROFF is available):
  *           the ADC automatically powers-off after a conversion and
  *           automatically wakes up when a new conversion is triggered
  *           (with startup time between trigger and start of sampling).
  *           This feature can be combined with low power mode "auto wait".
  * @note   With ADC low power mode "auto wait", the ADC conversion data read
  *         is corresponding to previous ADC conversion start, independently
  *         of delay during which ADC was idle.
  *         Therefore, the ADC conversion data can be outdated: does not
  *         correspond to the current voltage level on the selected
  *         ADC channel.
  * @note   On this STM32 series, setting of this feature is conditioned to
  *         ADC state:
  *         ADC must be disabled or enabled without conversion ongoing
  *         on either groups regular or injected.
  */
__STATIC_INLINE void LL_ADC_SetLowPowerMode(ADC_TypeDef *p_adc, uint32_t low_power_mode)
{
  STM32_MODIFY_REG(p_adc->CFGR1, (ADC_CFGR1_AUTDLY), low_power_mode);
}

/**
  * @brief  Get ADC low power mode.
  * @rmtoll
  *  CFGR1    AUTDLY         LL_ADC_GetLowPowerMode
  * @param  p_adc Pointer to ADC instance
  * @note   Description of ADC low power modes:
  *         - ADC low power mode "auto wait": Dynamic low power mode,
  *           ADC conversions occurrences are limited to the minimum necessary
  *           in order to reduce power consumption.
  *           New ADC conversion starts only when the previous
  *           unitary conversion data (for ADC group regular)
  *           or previous sequence conversions data (for ADC group injected)
  *           has been retrieved by user software.
  *           In the meantime, ADC remains idle: does not performs any
  *           other conversion.
  *           This mode allows to automatically adapt the ADC conversions
  *           triggers to the speed of the software that reads the data.
  *           Moreover, this avoids risk of overrun for low frequency
  *           applications.
  *           How to use this low power mode:
  *           - It is not recommended to use with interruption or DMA
  *             since these modes have to clear immediately the EOC flag
  *             (by CPU to free the IRQ pending event or by DMA).
  *             Auto wait will work but fort a very short time, discarding
  *             its intended benefit (except specific case of high load of CPU
  *             or DMA transfers which can justify usage of auto wait).
  *           - Do use with polling: 1. Start conversion,
  *             2. Later on, when conversion data is needed: poll for end of
  *             conversion  to ensure that conversion is completed and
  *             retrieve ADC conversion data. This will trig another
  *             ADC conversion start.
  *         - ADC low power mode "auto power-off" (feature available on
  *           this device if parameter LL_ADC_LP_AUTOPOWEROFF is available):
  *           the ADC automatically powers-off after a conversion and
  *           automatically wakes up when a new conversion is triggered
  *           (with startup time between trigger and start of sampling).
  *           This feature can be combined with low power mode "auto wait".
  * @note   With ADC low power mode "auto wait", the ADC conversion data read
  *         is corresponding to previous ADC conversion start, independently
  *         of delay during which ADC was idle.
  *         Therefore, the ADC conversion data can be outdated: does not
  *         correspond to the current voltage level on the selected
  *         ADC channel.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_ADC_LP_MODE_NONE
  *         @arg @ref LL_ADC_LP_AUTOWAIT
  */
__STATIC_INLINE uint32_t LL_ADC_GetLowPowerMode(const ADC_TypeDef *p_adc)
{
  return (uint32_t)(STM32_READ_BIT(p_adc->CFGR1, ADC_CFGR1_AUTDLY));
}

/**
  * @brief  Set ADC gain compensation applied to raw converted data.
  * @rmtoll
  *  GCOMP    GCOMPCOEFF     LL_ADC_SetGainCompensation\n
  *  CFGR2    GCOMP          LL_ADC_SetGainCompensation
  * @param  p_adc Pointer to ADC instance
  * @param  gain_compensation Gain compensation enable state and value.
  *         Value between Min_Data=0 and Max_Data=16393
  * @note   ADC conversion raw data is computed with gain value using the formula:
  *           DATA = DATA(raw) * (gain compensation coef) / 4096
  *         Therefore, value 4096 corresponds to unitary gain gain (gain compensation disabled)
  * @note   Gain compensation is applied to all ADC conversions (independently of groups or channels).
  * @note   On this STM32 series, setting of this feature is conditioned to
  *         ADC state:
  *         ADC must be disabled or enabled without conversion ongoing
  *         on either groups regular or injected.
  */
__STATIC_INLINE void LL_ADC_SetGainCompensation(ADC_TypeDef *p_adc, uint32_t gain_compensation)
{
  STM32_MODIFY_REG(p_adc->GCOMP, ADC_GCOMP_GCOMPCOEFF, gain_compensation);
  STM32_MODIFY_REG(p_adc->GCOMP, ADC_GCOMP_GCOMP,
                   ((gain_compensation == LL_ADC_GAIN_COMPENSATION_DIV) ? 0UL : 1UL) << ADC_GCOMP_GCOMP_Pos);
}

/**
  * @brief  Get the ADC gain compensation value.
  * @rmtoll
  *  GCOMP    GCOMPCOEFF     LL_ADC_GetGainCompensation\n
  *  CFGR2    GCOMP          LL_ADC_GetGainCompensation
  * @param  p_adc Pointer to ADC instance
  * @retval Returned value between Min_Data=0 and Max_Data=16393
  */
__STATIC_INLINE uint32_t LL_ADC_GetGainCompensation(const ADC_TypeDef *p_adc)
{
  return ((STM32_READ_BIT(p_adc->GCOMP, ADC_GCOMP_GCOMP) == ADC_GCOMP_GCOMP) \
          ? STM32_READ_BIT(p_adc->GCOMP, ADC_GCOMP_GCOMPCOEFF) : 4096UL);
}

/**
  * @}
  */

