MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_adc.h
/** @defgroup ADC_LL_EF_Configuration_ADC_Group_Regular Configuration of ADC hierarchical scope: group regular
  * @{
  */

/**
  * @brief  Set ADC group regular conversion trigger source:
  *         internal (SW start) or from external peripheral (timer event,
  *         EXTI line).
  * @rmtoll
  *  CFGR1    EXTSEL         LL_ADC_REG_SetTriggerSource\n
  *  CFGR1    EXTEN          LL_ADC_REG_SetTriggerSource
  * @param  p_adc Pointer to ADC instance
  * @param  trigger_source This parameter can be one of the following values:
  *         @arg @ref LL_ADC_REG_TRIG_SOFTWARE
  *         @arg @ref LL_ADC_REG_TRIG_EXTI11
  *         @arg @ref LL_ADC_REG_TRIG_TIM1_OC1
  *         @arg @ref LL_ADC_REG_TRIG_TIM1_OC2
  *         @arg @ref LL_ADC_REG_TRIG_TIM1_OC3
  *         @arg @ref LL_ADC_REG_TRIG_TIM1_TRGO
  *         @arg @ref LL_ADC_REG_TRIG_TIM1_TRGO2
  *         @arg @ref LL_ADC_REG_TRIG_TIM2_OC2
  *         @arg @ref LL_ADC_REG_TRIG_TIM2_TRGO
  * @if TIM3
  *         @arg @ref LL_ADC_REG_TRIG_TIM3_TRGO
  *         @arg @ref LL_ADC_REG_TRIG_TIM3_OC4
  * @endif
  *         @arg @ref LL_ADC_REG_TRIG_TIM5_OC4
  * @if TIM4
  *         @arg @ref LL_ADC_REG_TRIG_TIM4_TRGO
  * @endif
  *         @arg @ref LL_ADC_REG_TRIG_TIM5_TRGO
  *         @arg @ref LL_ADC_REG_TRIG_TIM6_TRGO
  *         @arg @ref LL_ADC_REG_TRIG_TIM8_TRGO
  *         @arg @ref LL_ADC_REG_TRIG_TIM8_TRGO2
  *         @arg @ref LL_ADC_REG_TRIG_TIM15_TRGO
  * @if LPTIM1
  *         @arg @ref LL_ADC_REG_TRIG_LPTIM1_OC1
  * @endif
  * @note   On this STM32 series, setting trigger source to external trigger
  *         also set trigger polarity to rising edge
  *         (default setting for compatibility with some ADC on other
  *         STM32 series having this setting set by HW default value).
  *         In case of need to modify trigger edge, use
  *         function @ref LL_ADC_REG_SetTriggerEdge().
  * @note   Availability of parameters of trigger sources from timer
  *         depends on timers availability on the selected device.
  * @note   On this STM32 series, setting of this feature is conditioned to
  *         ADC state:
  *         ADC must be disabled or enabled without conversion ongoing
  *         on group regular.
  */
__STATIC_INLINE void LL_ADC_REG_SetTriggerSource(ADC_TypeDef *p_adc, uint32_t trigger_source)
{
  STM32_MODIFY_REG(p_adc->CFGR1, ADC_CFGR1_EXTEN | ADC_CFGR1_EXTSEL, trigger_source);
}

/**
  * @brief  Get ADC group regular conversion trigger source:
  *         internal (SW start) or from external peripheral (timer event,
  *         EXTI line).
  * @rmtoll
  *  CFGR1    EXTSEL         LL_ADC_REG_GetTriggerSource\n
  *  CFGR1    EXTEN          LL_ADC_REG_GetTriggerSource
  * @param  p_adc Pointer to ADC instance
  * @note   To determine whether group regular trigger source is
  *         internal (SW start) or external, without detail
  *         of which peripheral is selected as external trigger,
  *         (equivalent to
  *         "if(LL_ADC_REG_GetTriggerSource(ADC1) == LL_ADC_REG_TRIG_SOFTWARE)")
  *         use function @ref LL_ADC_REG_IsTriggerSourceSWStart.
  * @note   Availability of parameters of trigger sources from timer
  *         depends on timers availability on the selected device.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_ADC_REG_TRIG_SOFTWARE
  *         @arg @ref LL_ADC_REG_TRIG_EXTI11
  *         @arg @ref LL_ADC_REG_TRIG_TIM1_OC1
  *         @arg @ref LL_ADC_REG_TRIG_TIM1_OC2
  *         @arg @ref LL_ADC_REG_TRIG_TIM1_OC3
  *         @arg @ref LL_ADC_REG_TRIG_TIM1_TRGO
  *         @arg @ref LL_ADC_REG_TRIG_TIM1_TRGO2
  *         @arg @ref LL_ADC_REG_TRIG_TIM2_OC2
  *         @arg @ref LL_ADC_REG_TRIG_TIM2_TRGO
  * @if TIM3
  *         @arg @ref LL_ADC_REG_TRIG_TIM3_TRGO
  *         @arg @ref LL_ADC_REG_TRIG_TIM3_OC4
  * @endif
  *         @arg @ref LL_ADC_REG_TRIG_TIM5_OC4
  * @if TIM4
  *         @arg @ref LL_ADC_REG_TRIG_TIM4_TRGO
  * @endif
  *         @arg @ref LL_ADC_REG_TRIG_TIM5_TRGO
  *         @arg @ref LL_ADC_REG_TRIG_TIM6_TRGO
  *         @arg @ref LL_ADC_REG_TRIG_TIM8_TRGO
  *         @arg @ref LL_ADC_REG_TRIG_TIM8_TRGO2
  *         @arg @ref LL_ADC_REG_TRIG_TIM15_TRGO
  * @if LPTIM1
  *         @arg @ref LL_ADC_REG_TRIG_LPTIM1_OC1
  * @endif
  */
__STATIC_INLINE uint32_t LL_ADC_REG_GetTriggerSource(const ADC_TypeDef *p_adc)
{
  __IO uint32_t trigger_source = STM32_READ_BIT(p_adc->CFGR1, ADC_CFGR1_EXTSEL | ADC_CFGR1_EXTEN);

  /* Value for shift of [0, 4, 8, 12] depending on value of bitfield corresponding to ADC_CFGR_EXTEN [0, 1, 2, 3] */
  uint32_t shift_exten = ((trigger_source & ADC_CFGR1_EXTEN) >> (ADC_CFGR1_EXTEN_Pos - 2UL));

  /* Set bitfield corresponding to ADC_CFGR1_EXTEN and ADC_CFGR1_EXTSEL to match with triggers literals definition */
  return ((trigger_source
           & (LL_ADC_REG_TRIG_SOURCE_MASK >> shift_exten) & ADC_CFGR1_EXTSEL)
          | ((LL_ADC_REG_TRIG_EDGE_MASK >> shift_exten) & ADC_CFGR1_EXTEN)
         );
}

/**
  * @brief  Get ADC group regular conversion trigger source internal (SW start)
  *         or external.
  * @rmtoll
  *  CFGR1    EXTEN          LL_ADC_REG_IsTriggerSourceSWStart
  * @param  p_adc Pointer to ADC instance
  * @note   In case of group regular trigger source set to external trigger,
  *         to determine which peripheral is selected as external trigger,
  *         use function @ref LL_ADC_REG_GetTriggerSource().
  * @retval Value "0" if trigger source external trigger
  *         Value "1" if trigger source SW start.
  */
__STATIC_INLINE uint32_t LL_ADC_REG_IsTriggerSourceSWStart(const ADC_TypeDef *p_adc)
{
  return ((STM32_READ_BIT(p_adc->CFGR1, ADC_CFGR1_EXTEN) == 0UL) ? 1UL : 0UL);
}

/**
  * @brief  Set ADC group regular conversion trigger polarity.
  * @rmtoll
  *  CFGR1    EXTEN          LL_ADC_REG_SetTriggerEdge
  * @param  p_adc Pointer to ADC instance
  * @param  external_trigger_edge This parameter can be one of the following values:
  *         @arg @ref LL_ADC_REG_TRIG_RISING
  *         @arg @ref LL_ADC_REG_TRIG_FALLING
  *         @arg @ref LL_ADC_REG_TRIG_RISING_FALLING
  * @note   Applicable only for trigger source set to external trigger.
  * @note   On this STM32 series, setting of this feature is conditioned to
  *         ADC state:
  *         ADC must be disabled or enabled without conversion ongoing
  *         on group regular.
  */
__STATIC_INLINE void LL_ADC_REG_SetTriggerEdge(ADC_TypeDef *p_adc, uint32_t external_trigger_edge)
{
  STM32_MODIFY_REG(p_adc->CFGR1, ADC_CFGR1_EXTEN, external_trigger_edge);
}

/**
  * @brief  Get ADC group regular conversion trigger polarity.
  * @rmtoll
  *  CFGR1    EXTEN          LL_ADC_REG_GetTriggerEdge
  * @param  p_adc Pointer to ADC instance
  * @note   Applicable only for trigger source set to external trigger.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_ADC_REG_TRIG_RISING
  *         @arg @ref LL_ADC_REG_TRIG_FALLING
  *         @arg @ref LL_ADC_REG_TRIG_RISING_FALLING
  */
__STATIC_INLINE uint32_t LL_ADC_REG_GetTriggerEdge(const ADC_TypeDef *p_adc)
{
  return (uint32_t)(STM32_READ_BIT(p_adc->CFGR1, ADC_CFGR1_EXTEN));
}

/**
  * @brief  Set ADC sampling mode.
  *         ADC state:
  *         ADC must be disabled or enabled without conversion ongoing
  *         on group regular.
  * @rmtoll
  *  CFGR2    BULB           LL_ADC_SetSamplingMode\n
  *  CFGR2    SMPTRIG        LL_ADC_SetSamplingMode
  * @param  p_adc Pointer to ADC instance
  * @param  sampling_mode This parameter can be one of the following values:
  *         @arg @ref LL_ADC_SAMPLING_MODE_NORMAL
  *         @arg @ref LL_ADC_SAMPLING_MODE_BULB
  *         @arg @ref LL_ADC_SAMPLING_MODE_TRIGGER_CTRL
  * @note   On this STM32 series, setting of this feature is conditioned to
  *         ADC state:
  *         ADC must be disabled or enabled without conversion ongoing
  *         on group regular.
  */
__STATIC_INLINE void LL_ADC_SetSamplingMode(ADC_TypeDef *p_adc, uint32_t sampling_mode)
{
  STM32_MODIFY_REG(p_adc->CFGR2, ADC_CFGR2_BULB | ADC_CFGR2_SMPTRIG, sampling_mode);
}

/**
  * @brief  Get the ADC sampling mode.
  * @rmtoll
  *  CFGR2    BULB           LL_ADC_GetSamplingMode\n
  *  CFGR2    SMPTRIG        LL_ADC_GetSamplingMode
  * @param  p_adc Pointer to ADC instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_ADC_SAMPLING_MODE_NORMAL
  *         @arg @ref LL_ADC_SAMPLING_MODE_BULB
  *         @arg @ref LL_ADC_SAMPLING_MODE_TRIGGER_CTRL
  */
__STATIC_INLINE uint32_t LL_ADC_GetSamplingMode(const ADC_TypeDef *p_adc)
{
  return (uint32_t)(STM32_READ_BIT(p_adc->CFGR2, ADC_CFGR2_BULB | ADC_CFGR2_SMPTRIG));
}

/**
  * @brief  Start ADC sampling phase for sampling time trigger mode.
  * @rmtoll
  *  CFGR2    SWTRIG         LL_ADC_REG_StartSamplingPhase
  * @param  p_adc Pointer to ADC instance
  * @note   This function is relevant only when
  *         - @ref LL_ADC_SAMPLING_MODE_TRIGGER_CTRL has been set
  *           using @ref LL_ADC_SetSamplingMode
  *         - @ref LL_ADC_REG_TRIG_SOFTWARE is used as trigger source
  * @note   On this STM32 series, setting of this feature is conditioned to
  *         ADC state:
  *         ADC must be enabled without conversion ongoing on group regular,
  *         without conversion stop command ongoing on group regular,
  *         without ADC disable command ongoing.
  */
__STATIC_INLINE void LL_ADC_REG_StartSamplingPhase(ADC_TypeDef *p_adc)
{
  STM32_SET_BIT(p_adc->CFGR2, ADC_CFGR2_SWTRIG);
}

/**
  * @brief  Stop ADC sampling phase for sampling time trigger mode and start conversion.
  * @rmtoll
  *  CFGR2    SWTRIG         LL_ADC_REG_StopSamplingPhase
  * @param  p_adc Pointer to ADC instance
  * @note   This function is relevant only when
  *         - @ref LL_ADC_SAMPLING_MODE_TRIGGER_CTRL has been set
  *           using @ref LL_ADC_SetSamplingMode
  *         - @ref LL_ADC_REG_TRIG_SOFTWARE is used as trigger source
  *         - @ref LL_ADC_REG_StartSamplingPhase has been called to start
  *           the sampling phase
  * @note   On this STM32 series, setting of this feature is conditioned to
  *         ADC state:
  *         ADC must be enabled without conversion ongoing on group regular,
  *         without conversion stop command ongoing on group regular,
  *         without ADC disable command ongoing.
  */
__STATIC_INLINE void LL_ADC_REG_StopSamplingPhase(ADC_TypeDef *p_adc)
{
  STM32_CLEAR_BIT(p_adc->CFGR2, ADC_CFGR2_SWTRIG);
}

/**
  * @brief  Set ADC group regular sequencer length and scan direction.
  * @rmtoll
  *  SQR1     LEN            LL_ADC_REG_SetSequencerLength
  * @param  p_adc Pointer to ADC instance
  * @param  sequencer_nb_ranks This parameter can be one of the following values:
  *         @arg @ref LL_ADC_REG_SEQ_SCAN_DISABLE
  *         @arg @ref LL_ADC_REG_SEQ_SCAN_ENABLE_2RANKS
  *         @arg @ref LL_ADC_REG_SEQ_SCAN_ENABLE_3RANKS
  *         @arg @ref LL_ADC_REG_SEQ_SCAN_ENABLE_4RANKS
  *         @arg @ref LL_ADC_REG_SEQ_SCAN_ENABLE_5RANKS
  *         @arg @ref LL_ADC_REG_SEQ_SCAN_ENABLE_6RANKS
  *         @arg @ref LL_ADC_REG_SEQ_SCAN_ENABLE_7RANKS
  *         @arg @ref LL_ADC_REG_SEQ_SCAN_ENABLE_8RANKS
  *         @arg @ref LL_ADC_REG_SEQ_SCAN_ENABLE_9RANKS
  *         @arg @ref LL_ADC_REG_SEQ_SCAN_ENABLE_10RANKS
  *         @arg @ref LL_ADC_REG_SEQ_SCAN_ENABLE_11RANKS
  *         @arg @ref LL_ADC_REG_SEQ_SCAN_ENABLE_12RANKS
  *         @arg @ref LL_ADC_REG_SEQ_SCAN_ENABLE_13RANKS
  *         @arg @ref LL_ADC_REG_SEQ_SCAN_ENABLE_14RANKS
  *         @arg @ref LL_ADC_REG_SEQ_SCAN_ENABLE_15RANKS
  *         @arg @ref LL_ADC_REG_SEQ_SCAN_ENABLE_16RANKS
  * @note   Description of ADC group regular sequencer features:
  *         - For devices with sequencer fully configurable
  *           (function "LL_ADC_REG_SetSequencerRanks()" available):
  *           sequencer length and each rank affectation to a channel
  *           are configurable.
  *           This function performs configuration of:
  *           - Sequence length: Number of ranks in the scan sequence.
  *           Sequencer ranks are selected using
  *           function "LL_ADC_REG_SetSequencerRanks()".
  *         - For devices with sequencer not fully configurable
  *           (function "LL_ADC_REG_SetSequencerChannels()" available):
  *           sequencer length and each rank affectation to a channel
  *           are defined by channel number.
  *           This function performs configuration of:
  *           - Sequence length: Number of ranks in the scan sequence is
  *             defined by number of channels set in the sequence,
  *             rank of each channel is fixed by channel HW number.
  *             (channel 0 fixed on rank 0, channel 1 fixed on rank1, ...).
  * @note   Sequencer disabled is equivalent to sequencer of 1 rank:
  *         ADC conversion on only 1 channel.
  * @note   On this STM32 series, setting of this feature is conditioned to
  *         ADC state:
  *         ADC must be disabled or enabled without conversion ongoing
  *         on group regular.
  */
__STATIC_INLINE void LL_ADC_REG_SetSequencerLength(ADC_TypeDef *p_adc, uint32_t sequencer_nb_ranks)
{
  STM32_MODIFY_REG(p_adc->SQR1, ADC_SQR1_LEN, sequencer_nb_ranks);
}

/**
  * @brief  Get ADC group regular sequencer length and scan direction.
  * @rmtoll
  *  SQR1     LEN            LL_ADC_REG_GetSequencerLength
  * @param  p_adc Pointer to ADC instance
  * @note   Description of ADC group regular sequencer features:
  *         - For devices with sequencer fully configurable
  *           (function "LL_ADC_REG_SetSequencerRanks()" available):
  *           sequencer length and each rank affectation to a channel
  *           are configurable.
  *           This function retrieves:
  *           - Sequence length: Number of ranks in the scan sequence.
  *           Sequencer ranks are selected using
  *           function "LL_ADC_REG_SetSequencerRanks()".
  *         - For devices with sequencer not fully configurable
  *           (function "LL_ADC_REG_SetSequencerChannels()" available):
  *           sequencer length and each rank affectation to a channel
  *           are defined by channel number.
  *           This function retrieves:
  *           - Sequence length: Number of ranks in the scan sequence is
  *             defined by number of channels set in the sequence,
  *             rank of each channel is fixed by channel HW number.
  *             (channel 0 fixed on rank 0, channel 1 fixed on rank1, ...).
  *           Sequencer ranks are selected using
  *           function "LL_ADC_REG_SetSequencerChannels()".
  * @note   Sequencer disabled is equivalent to sequencer of 1 rank:
  *         ADC conversion on only 1 channel.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_ADC_REG_SEQ_SCAN_DISABLE
  *         @arg @ref LL_ADC_REG_SEQ_SCAN_ENABLE_2RANKS
  *         @arg @ref LL_ADC_REG_SEQ_SCAN_ENABLE_3RANKS
  *         @arg @ref LL_ADC_REG_SEQ_SCAN_ENABLE_4RANKS
  *         @arg @ref LL_ADC_REG_SEQ_SCAN_ENABLE_5RANKS
  *         @arg @ref LL_ADC_REG_SEQ_SCAN_ENABLE_6RANKS
  *         @arg @ref LL_ADC_REG_SEQ_SCAN_ENABLE_7RANKS
  *         @arg @ref LL_ADC_REG_SEQ_SCAN_ENABLE_8RANKS
  *         @arg @ref LL_ADC_REG_SEQ_SCAN_ENABLE_9RANKS
  *         @arg @ref LL_ADC_REG_SEQ_SCAN_ENABLE_10RANKS
  *         @arg @ref LL_ADC_REG_SEQ_SCAN_ENABLE_11RANKS
  *         @arg @ref LL_ADC_REG_SEQ_SCAN_ENABLE_12RANKS
  *         @arg @ref LL_ADC_REG_SEQ_SCAN_ENABLE_13RANKS
  *         @arg @ref LL_ADC_REG_SEQ_SCAN_ENABLE_14RANKS
  *         @arg @ref LL_ADC_REG_SEQ_SCAN_ENABLE_15RANKS
  *         @arg @ref LL_ADC_REG_SEQ_SCAN_ENABLE_16RANKS
  */
__STATIC_INLINE uint32_t LL_ADC_REG_GetSequencerLength(const ADC_TypeDef *p_adc)
{
  return (uint32_t)(STM32_READ_BIT(p_adc->SQR1, ADC_SQR1_LEN));
}

/**
  * @brief  Set ADC group regular sequencer discontinuous mode:
  *         sequence subdivided and scan conversions interrupted every selected
  *         number of ranks.
  * @rmtoll
  *  CFGR1    DISCEN         LL_ADC_REG_SetSequencerDiscont\n
  *  CFGR1    DISCNUM        LL_ADC_REG_SetSequencerDiscont
  * @param  p_adc Pointer to ADC instance
  * @param  seq_discont This parameter can be one of the following values:
  *         @arg @ref LL_ADC_REG_SEQ_DISCONT_DISABLE
  *         @arg @ref LL_ADC_REG_SEQ_DISCONT_1RANK
  *         @arg @ref LL_ADC_REG_SEQ_DISCONT_2RANKS
  *         @arg @ref LL_ADC_REG_SEQ_DISCONT_3RANKS
  *         @arg @ref LL_ADC_REG_SEQ_DISCONT_4RANKS
  *         @arg @ref LL_ADC_REG_SEQ_DISCONT_5RANKS
  *         @arg @ref LL_ADC_REG_SEQ_DISCONT_6RANKS
  *         @arg @ref LL_ADC_REG_SEQ_DISCONT_7RANKS
  *         @arg @ref LL_ADC_REG_SEQ_DISCONT_8RANKS
  * @note   It is not possible to enable both ADC group regular
  *         continuous mode and sequencer discontinuous mode.
  * @note   It is not possible to enable both ADC auto-injected mode
  *         and ADC group regular sequencer discontinuous mode.
  * @note   On this STM32 series, setting of this feature is conditioned to
  *         ADC state:
  *         ADC must be disabled or enabled without conversion ongoing
  *         on group regular.
  */
__STATIC_INLINE void LL_ADC_REG_SetSequencerDiscont(ADC_TypeDef *p_adc, uint32_t seq_discont)
{
  STM32_MODIFY_REG(p_adc->CFGR1, ADC_CFGR1_DISCEN | ADC_CFGR1_DISCNUM, seq_discont);
}

/**
  * @brief  Get ADC group regular sequencer discontinuous mode:
  *         sequence subdivided and scan conversions interrupted every selected
  *         number of ranks.
  * @rmtoll
  *  CFGR1    DISCEN         LL_ADC_REG_GetSequencerDiscont\n
  *  CFGR1    DISCNUM        LL_ADC_REG_GetSequencerDiscont
  * @param  p_adc Pointer to ADC instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_ADC_REG_SEQ_DISCONT_DISABLE
  *         @arg @ref LL_ADC_REG_SEQ_DISCONT_1RANK
  *         @arg @ref LL_ADC_REG_SEQ_DISCONT_2RANKS
  *         @arg @ref LL_ADC_REG_SEQ_DISCONT_3RANKS
  *         @arg @ref LL_ADC_REG_SEQ_DISCONT_4RANKS
  *         @arg @ref LL_ADC_REG_SEQ_DISCONT_5RANKS
  *         @arg @ref LL_ADC_REG_SEQ_DISCONT_6RANKS
  *         @arg @ref LL_ADC_REG_SEQ_DISCONT_7RANKS
  *         @arg @ref LL_ADC_REG_SEQ_DISCONT_8RANKS
  */
__STATIC_INLINE uint32_t LL_ADC_REG_GetSequencerDiscont(const ADC_TypeDef *p_adc)
{
  return (uint32_t)(STM32_READ_BIT(p_adc->CFGR1, ADC_CFGR1_DISCEN | ADC_CFGR1_DISCNUM));
}

/**
  * @brief  Set ADC group regular sequence: channel on the selected
  *         scan sequence rank.
  * @rmtoll
  *  SQR1     SQ1            LL_ADC_REG_SetSequencerRanks\n
  *  SQR1     SQ2            LL_ADC_REG_SetSequencerRanks\n
  *  SQR1     SQ3            LL_ADC_REG_SetSequencerRanks\n
  *  SQR1     SQ4            LL_ADC_REG_SetSequencerRanks\n
  *  SQR2     SQ5            LL_ADC_REG_SetSequencerRanks\n
  *  SQR2     SQ6            LL_ADC_REG_SetSequencerRanks\n
  *  SQR2     SQ7            LL_ADC_REG_SetSequencerRanks\n
  *  SQR2     SQ8            LL_ADC_REG_SetSequencerRanks\n
  *  SQR2     SQ9            LL_ADC_REG_SetSequencerRanks\n
  *  SQR3     SQ10           LL_ADC_REG_SetSequencerRanks\n
  *  SQR3     SQ11           LL_ADC_REG_SetSequencerRanks\n
  *  SQR3     SQ12           LL_ADC_REG_SetSequencerRanks\n
  *  SQR3     SQ13           LL_ADC_REG_SetSequencerRanks\n
  *  SQR3     SQ14           LL_ADC_REG_SetSequencerRanks\n
  *  SQR4     SQ15           LL_ADC_REG_SetSequencerRanks\n
  *  SQR4     SQ16           LL_ADC_REG_SetSequencerRanks
  * @param  p_adc Pointer to ADC instance
  * @param  rank This parameter can be one of the following values:
  *         @arg @ref LL_ADC_REG_RANK_1
  *         @arg @ref LL_ADC_REG_RANK_2
  *         @arg @ref LL_ADC_REG_RANK_3
  *         @arg @ref LL_ADC_REG_RANK_4
  *         @arg @ref LL_ADC_REG_RANK_5
  *         @arg @ref LL_ADC_REG_RANK_6
  *         @arg @ref LL_ADC_REG_RANK_7
  *         @arg @ref LL_ADC_REG_RANK_8
  *         @arg @ref LL_ADC_REG_RANK_9
  *         @arg @ref LL_ADC_REG_RANK_10
  *         @arg @ref LL_ADC_REG_RANK_11
  *         @arg @ref LL_ADC_REG_RANK_12
  *         @arg @ref LL_ADC_REG_RANK_13
  *         @arg @ref LL_ADC_REG_RANK_14
  *         @arg @ref LL_ADC_REG_RANK_15
  *         @arg @ref LL_ADC_REG_RANK_16
  * @param  channel This parameter can be one of the following values:
  *         @arg @ref LL_ADC_CHANNEL_0
  *         @arg @ref LL_ADC_CHANNEL_1
  *         @arg @ref LL_ADC_CHANNEL_2
  *         @arg @ref LL_ADC_CHANNEL_3
  *         @arg @ref LL_ADC_CHANNEL_4
  *         @arg @ref LL_ADC_CHANNEL_5
  *         @arg @ref LL_ADC_CHANNEL_6
  *         @arg @ref LL_ADC_CHANNEL_7
  *         @arg @ref LL_ADC_CHANNEL_8
  *         @arg @ref LL_ADC_CHANNEL_9
  *         @arg @ref LL_ADC_CHANNEL_10
  *         @arg @ref LL_ADC_CHANNEL_11
  *         @arg @ref LL_ADC_CHANNEL_12
  *         @arg @ref LL_ADC_CHANNEL_13
  *         @arg @ref LL_ADC_CHANNEL_VREFINT         (1)
  *         @arg @ref LL_ADC_CHANNEL_TEMPSENSOR      (1)
  *         @arg @ref LL_ADC_CHANNEL_VDDCORE         (1)
  *         @arg @ref LL_ADC_CHANNEL_OPAMP1_OUT      (1)
  *         @arg @ref LL_ADC_CHANNEL_OPAMP2_OUT      (1)
  *         @arg @ref LL_ADC_CHANNEL_OPAMP3_OUT      (1)
  *         @arg @ref LL_ADC_CHANNEL_VREFINT_ALT     (2)
  *         @arg @ref LL_ADC_CHANNEL_VDDCORE_ALT     (2)
  *         @arg @ref LL_ADC_CHANNEL_OPAMP1_OUT_ALT  (2)
  *         @arg @ref LL_ADC_CHANNEL_OPAMP2_OUT_ALT  (2)
  *         @arg @ref LL_ADC_CHANNEL_VREFINT_ALT2    (3)
  *         @arg @ref LL_ADC_CHANNEL_VDDCORE_ALT2    (3)
  *         @arg @ref LL_ADC_CHANNEL_OPAMP3_OUT_ALT  (3)
  *
  *         (1) On this STM32 series, parameter available only on ADC instance: ADC1.\n
  *         (2) On this STM32 series, parameter available only on ADC instance: ADC2.\n
  *         (3) On this STM32 series, parameter available only on ADC instance: ADC3.\n
  * @note   This function performs configuration of:
  *         - Channels ordering into each rank of scan sequence:
  *           whatever channel can be placed into whatever rank.
  * @note   On this STM32 series, ADC group regular sequencer is
  *         fully configurable: sequencer length and each rank
  *         affectation to a channel are configurable.
  *         Refer to description of function @ref LL_ADC_REG_SetSequencerLength().
  * @note   Depending on devices and packages, some channels can be not available.
  *         Refer to device datasheet for channels availability.
  * @note   On this STM32 series, to measure internal channels (VrefInt,
  *         TempSensor, ...), measurement paths to internal channels must be
  *         enabled separately.
  *         This can be done using function @ref LL_ADC_SetCommonPathInternalCh().
  * @note   On this STM32 series, setting of this feature is conditioned to
  *         ADC state:
  *         ADC must be disabled or enabled without conversion ongoing
  *         on group regular.
  */
__STATIC_INLINE void LL_ADC_REG_SetSequencerRanks(ADC_TypeDef *p_adc, uint32_t rank, uint32_t channel)
{
  /* Set bits with content of parameter "Channel" with bits position          */
  /* in register and register position depending on parameter "Rank".         */
  /* Parameters "Rank" and "Channel" are used with masks because containing   */
  /* other bits reserved for other purpose.                                   */
  __IO uint32_t *preg = LL_ADC_PTR_REG_OFFSET(p_adc->SQR1,
                                              ((rank & LL_ADC_REG_SQRX_REGOFFSET_MASK) >> LL_ADC_SQRX_REGOFFSET_POS));

