MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_adc.h
  const uint32_t channel_ll = LL_ADC_REMAP_CHANNEL_INTERNAL_SET(p_adc, channel);

  STM32_MODIFY_REG(*preg,
                   LL_ADC_CHANNEL_ID_NB_MASK_POSBIT0 << (rank & LL_ADC_REG_RANK_ID_SQRX_MASK),
                   (channel_ll & LL_ADC_CH_NUMBER_MASK) << (rank & LL_ADC_REG_RANK_ID_SQRX_MASK));
}

/**
  * @brief  Get ADC group regular sequence: channel on the selected
  *         scan sequence rank.
  * @rmtoll
  *  SQR1     SQ1            LL_ADC_REG_GetSequencerRanks\n
  *  SQR1     SQ2            LL_ADC_REG_GetSequencerRanks\n
  *  SQR1     SQ3            LL_ADC_REG_GetSequencerRanks\n
  *  SQR1     SQ4            LL_ADC_REG_GetSequencerRanks\n
  *  SQR2     SQ5            LL_ADC_REG_GetSequencerRanks\n
  *  SQR2     SQ6            LL_ADC_REG_GetSequencerRanks\n
  *  SQR2     SQ7            LL_ADC_REG_GetSequencerRanks\n
  *  SQR2     SQ8            LL_ADC_REG_GetSequencerRanks\n
  *  SQR2     SQ9            LL_ADC_REG_GetSequencerRanks\n
  *  SQR3     SQ10           LL_ADC_REG_GetSequencerRanks\n
  *  SQR3     SQ11           LL_ADC_REG_GetSequencerRanks\n
  *  SQR3     SQ12           LL_ADC_REG_GetSequencerRanks\n
  *  SQR3     SQ13           LL_ADC_REG_GetSequencerRanks\n
  *  SQR3     SQ14           LL_ADC_REG_GetSequencerRanks\n
  *  SQR4     SQ15           LL_ADC_REG_GetSequencerRanks\n
  *  SQR4     SQ16           LL_ADC_REG_GetSequencerRanks
  * @param  p_adc Pointer to ADC instance
  * @param  rank This parameter can be one of the following values:
  *         @arg @ref LL_ADC_REG_RANK_1
  *         @arg @ref LL_ADC_REG_RANK_2
  *         @arg @ref LL_ADC_REG_RANK_3
  *         @arg @ref LL_ADC_REG_RANK_4
  *         @arg @ref LL_ADC_REG_RANK_5
  *         @arg @ref LL_ADC_REG_RANK_6
  *         @arg @ref LL_ADC_REG_RANK_7
  *         @arg @ref LL_ADC_REG_RANK_8
  *         @arg @ref LL_ADC_REG_RANK_9
  *         @arg @ref LL_ADC_REG_RANK_10
  *         @arg @ref LL_ADC_REG_RANK_11
  *         @arg @ref LL_ADC_REG_RANK_12
  *         @arg @ref LL_ADC_REG_RANK_13
  *         @arg @ref LL_ADC_REG_RANK_14
  *         @arg @ref LL_ADC_REG_RANK_15
  *         @arg @ref LL_ADC_REG_RANK_16
  * @note   On this STM32 series, ADC group regular sequencer is
  *         fully configurable: sequencer length and each rank
  *         affectation to a channel are configurable.
  *         Refer to description of function @ref LL_ADC_REG_SetSequencerLength().
  * @note   Depending on devices and packages, some channels can be not available.
  *         Refer to device datasheet for channels availability.
  * @note   Usage of the returned channel number:
  *         - To reinject this channel into another function LL_ADC_xxx:
  *           the returned channel number is only partly formatted on definition
  *           of literals LL_ADC_CHANNEL_x. Therefore, it has to be compared
  *           with parts of literals LL_ADC_CHANNEL_x or using
  *           helper macro @ref LL_ADC_CHANNEL_TO_DECIMAL_NB().
  *           Then the selected literal LL_ADC_CHANNEL_x can be used
  *           as parameter for another function.
  *         - To get the channel number in decimal format:
  *           process the returned value with the helper macro
  *           @ref LL_ADC_CHANNEL_TO_DECIMAL_NB().
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_ADC_CHANNEL_0
  *         @arg @ref LL_ADC_CHANNEL_1
  *         @arg @ref LL_ADC_CHANNEL_2
  *         @arg @ref LL_ADC_CHANNEL_3
  *         @arg @ref LL_ADC_CHANNEL_4
  *         @arg @ref LL_ADC_CHANNEL_5
  *         @arg @ref LL_ADC_CHANNEL_6
  *         @arg @ref LL_ADC_CHANNEL_7
  *         @arg @ref LL_ADC_CHANNEL_8
  *         @arg @ref LL_ADC_CHANNEL_9
  *         @arg @ref LL_ADC_CHANNEL_10
  *         @arg @ref LL_ADC_CHANNEL_11
  *         @arg @ref LL_ADC_CHANNEL_12
  *         @arg @ref LL_ADC_CHANNEL_13
  *         @arg @ref LL_ADC_CHANNEL_VREFINT         (1)(5)
  *         @arg @ref LL_ADC_CHANNEL_TEMPSENSOR      (1)(5)
  *         @arg @ref LL_ADC_CHANNEL_VDDCORE         (1)(5)
  *         @arg @ref LL_ADC_CHANNEL_OPAMP1_OUT      (1)(5)
  *         @arg @ref LL_ADC_CHANNEL_OPAMP2_OUT      (1)(5)
  *         @arg @ref LL_ADC_CHANNEL_OPAMP3_OUT      (1)(5)
  *         @arg @ref LL_ADC_CHANNEL_VREFINT_ALT     (2)(5)
  *         @arg @ref LL_ADC_CHANNEL_VDDCORE_ALT     (2)(5)
  *         @arg @ref LL_ADC_CHANNEL_OPAMP1_OUT_ALT  (2)(5)
  *         @arg @ref LL_ADC_CHANNEL_OPAMP2_OUT_ALT  (2)(5)
  *         @arg @ref LL_ADC_CHANNEL_VREFINT_ALT2    (3)(5)
  *         @arg @ref LL_ADC_CHANNEL_VDDCORE_ALT2    (3)(5)
  *         @arg @ref LL_ADC_CHANNEL_OPAMP3_OUT_ALT  (3)(5)
  *
  *         (1) On this STM32 series, parameter available only on ADC instance: ADC1.\n
  *         (2) On this STM32 series, parameter available only on ADC instance: ADC2.\n
  *         (3) On this STM32 series, parameter available only on ADC instance: ADC3.\n
  *         (5) For ADC channel read back from ADC register,
  *             comparison with internal channel parameter to be done
  *             using helper macro @ref LL_ADC_CHANNEL_INTERNAL_TO_EXTERNAL().
  *
  */
__STATIC_INLINE uint32_t LL_ADC_REG_GetSequencerRanks(const ADC_TypeDef *p_adc, uint32_t rank)
{
  const __IO uint32_t *preg = LL_ADC_PTR_REG_OFFSET(p_adc->SQR1, ((rank & LL_ADC_REG_SQRX_REGOFFSET_MASK)
                                                                  >> LL_ADC_SQRX_REGOFFSET_POS));

  return (uint32_t)((STM32_READ_BIT(*preg,
                                    LL_ADC_CHANNEL_ID_NB_MASK_POSBIT0 << (rank & LL_ADC_REG_RANK_ID_SQRX_MASK))
                     >> (rank & LL_ADC_REG_RANK_ID_SQRX_MASK))
                   );
}

/**
  * @brief  Set ADC channel preselection.
  * @rmtoll
  *  PCSEL   PCSEL0         LL_ADC_CHANNEL_0\n
  *  PCSEL   PCSEL1         LL_ADC_CHANNEL_1\n
  *  PCSEL   PCSEL2         LL_ADC_CHANNEL_2\n
  *  PCSEL   PCSEL3         LL_ADC_CHANNEL_3\n
  *  PCSEL   PCSEL4         LL_ADC_CHANNEL_4\n
  *  PCSEL   PCSEL5         LL_ADC_CHANNEL_5\n
  *  PCSEL   PCSEL6         LL_ADC_CHANNEL_6\n
  *  PCSEL   PCSEL7         LL_ADC_CHANNEL_7\n
  *  PCSEL   PCSEL8         LL_ADC_CHANNEL_8\n
  *  PCSEL   PCSEL9         LL_ADC_CHANNEL_9\n
  *  PCSEL   PCSEL10        LL_ADC_CHANNEL_10\n
  *  PCSEL   PCSEL11        LL_ADC_CHANNEL_11\n
  *  PCSEL   PCSEL12        LL_ADC_CHANNEL_12\n
  *  PCSEL   PCSEL13        LL_ADC_CHANNEL_13
  * @param  p_adc Pointer to ADC instance.
  * @param  channel This parameter can be one of the following values:
  *         @arg @ref LL_ADC_CHANNEL_0
  *         @arg @ref LL_ADC_CHANNEL_1
  *         @arg @ref LL_ADC_CHANNEL_2
  *         @arg @ref LL_ADC_CHANNEL_3
  *         @arg @ref LL_ADC_CHANNEL_4
  *         @arg @ref LL_ADC_CHANNEL_5
  *         @arg @ref LL_ADC_CHANNEL_6
  *         @arg @ref LL_ADC_CHANNEL_7
  *         @arg @ref LL_ADC_CHANNEL_8
  *         @arg @ref LL_ADC_CHANNEL_9
  *         @arg @ref LL_ADC_CHANNEL_10
  *         @arg @ref LL_ADC_CHANNEL_11
  *         @arg @ref LL_ADC_CHANNEL_12
  *         @arg @ref LL_ADC_CHANNEL_13
  * @note   This function set the the value for the channel preselection register
  *         corresponding to ADC channel to be selected.
  */
__STATIC_INLINE void LL_ADC_SetChannelPreselection(ADC_TypeDef *p_adc, uint32_t channel)
{
  __IO uint32_t channel_preselection = STM32_READ_REG(p_adc->PCSEL);

  STM32_WRITE_REG(p_adc->PCSEL,
                  channel_preselection | (1UL << (LL_ADC_CHANNEL_TO_DECIMAL_NB((uint32_t)channel) & 0x1FUL)));
}

/**
  * @brief  Get ADC channel preselection.
  * @rmtoll
  *  PCSEL   PCSEL0         LL_ADC_CHANNEL_0\n
  *  PCSEL   PCSEL1         LL_ADC_CHANNEL_1\n
  *  PCSEL   PCSEL2         LL_ADC_CHANNEL_2\n
  *  PCSEL   PCSEL3         LL_ADC_CHANNEL_3\n
  *  PCSEL   PCSEL4         LL_ADC_CHANNEL_4\n
  *  PCSEL   PCSEL5         LL_ADC_CHANNEL_5\n
  *  PCSEL   PCSEL6         LL_ADC_CHANNEL_6\n
  *  PCSEL   PCSEL7         LL_ADC_CHANNEL_7\n
  *  PCSEL   PCSEL8         LL_ADC_CHANNEL_8\n
  *  PCSEL   PCSEL9         LL_ADC_CHANNEL_9\n
  *  PCSEL   PCSEL10        LL_ADC_CHANNEL_10\n
  *  PCSEL   PCSEL11        LL_ADC_CHANNEL_11\n
  *  PCSEL   PCSEL12        LL_ADC_CHANNEL_12\n
  *  PCSEL   PCSEL13        LL_ADC_CHANNEL_13
  * @param  p_adc Pointer to ADC instance.
  * @note   This function does not support specific case of multiple channels preselected.
  *         In this case, return value of this function is not relevant
  *         (corresponds to first channel preselected).
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_ADC_CHANNEL_0
  *         @arg @ref LL_ADC_CHANNEL_1
  *         @arg @ref LL_ADC_CHANNEL_2
  *         @arg @ref LL_ADC_CHANNEL_3
  *         @arg @ref LL_ADC_CHANNEL_4
  *         @arg @ref LL_ADC_CHANNEL_5
  *         @arg @ref LL_ADC_CHANNEL_6
  *         @arg @ref LL_ADC_CHANNEL_7
  *         @arg @ref LL_ADC_CHANNEL_8
  *         @arg @ref LL_ADC_CHANNEL_9
  *         @arg @ref LL_ADC_CHANNEL_10
  *         @arg @ref LL_ADC_CHANNEL_11
  *         @arg @ref LL_ADC_CHANNEL_12
  *         @arg @ref LL_ADC_CHANNEL_13
  */
__STATIC_INLINE uint32_t LL_ADC_GetChannelPreselection(const ADC_TypeDef *p_adc)
{
  uint32_t channel_preselection = STM32_READ_BIT(p_adc->PCSEL, ADC_PCSEL_PCSEL);

  if ((channel_preselection & ADC_PCSEL_PCSEL) == 0UL)
  {
    channel_preselection = LL_ADC_CHANNEL_NONE;
  }
  else if ((channel_preselection & ADC_PCSEL_PCSEL) == ADC_PCSEL_PCSEL)
  {
    /* Case all channels */
    channel_preselection = LL_ADC_CHANNEL_ALL;
  }
  else
  {
    /* In case of multiple channel, return value of first channel preselected */
    channel_preselection = STM32_POSITION_VAL(channel_preselection);
  }

