MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_adc.h
  return channel_preselection;
}

/**
  * @brief  Set ADC continuous conversion mode on ADC group regular.
  * @rmtoll
  *  CFGR1    CONT           LL_ADC_REG_SetContinuousMode
  * @param  p_adc Pointer to ADC instance
  * @param  continuous This parameter can be one of the following values:
  *         @arg @ref LL_ADC_REG_CONV_SINGLE
  *         @arg @ref LL_ADC_REG_CONV_CONTINUOUS
  * @note   Description of ADC continuous conversion mode:
  *         - single mode: one conversion per trigger
  *         - continuous mode: after the first trigger, following
  *           conversions launched successively automatically.
  * @note   It is not possible to enable both ADC group regular
  *         continuous mode and sequencer discontinuous mode.
  * @note   On this STM32 series, setting of this feature is conditioned to
  *         ADC state:
  *         ADC must be disabled or enabled without conversion ongoing
  *         on group regular.
  */
__STATIC_INLINE void LL_ADC_REG_SetContinuousMode(ADC_TypeDef *p_adc, uint32_t continuous)
{
  STM32_MODIFY_REG(p_adc->CFGR1, ADC_CFGR1_CONT, continuous);
}

/**
  * @brief  Get ADC continuous conversion mode on ADC group regular.
  * @rmtoll
  *  CFGR1    CONT           LL_ADC_REG_GetContinuousMode
  * @param  p_adc Pointer to ADC instance
  * @note   Description of ADC continuous conversion mode:
  *         - single mode: one conversion per trigger
  *         - continuous mode: after the first trigger, following
  *           conversions launched successively automatically.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_ADC_REG_CONV_SINGLE
  *         @arg @ref LL_ADC_REG_CONV_CONTINUOUS
  */
__STATIC_INLINE uint32_t LL_ADC_REG_GetContinuousMode(const ADC_TypeDef *p_adc)
{
  return (uint32_t)(STM32_READ_BIT(p_adc->CFGR1, ADC_CFGR1_CONT));
}

/**
  * @brief  Set ADC data transfer mode for regular group.
  * @rmtoll
  *  CFGR1    DMNGT           LL_ADC_REG_SetDataTransferMode
  * @param  p_adc Pointer to ADC instance
  * @param  data_transfer_mode This parameter can be one of the following values:
  *         @arg @ref LL_ADC_REG_DR_TRANSFER
  *         @arg @ref LL_ADC_REG_DMA_TRANSFER_LIMITED
  *         @arg @ref LL_ADC_REG_DMA_TRANSFER_UNLIMITED
  * @note   Conversion data can be either:
  *            - Available in data register
  *            - Transferred to DMA
  *            - Transferred to other peripheral (audio peripheral, ...)
  */
__STATIC_INLINE void LL_ADC_REG_SetDataTransferMode(ADC_TypeDef *p_adc, uint32_t data_transfer_mode)
{
  STM32_MODIFY_REG(p_adc->CFGR1, ADC_CFGR1_DMNGT, data_transfer_mode);
}

/**
  * @brief  Get ADC data transfer mode for regular group.
  * @rmtoll
  *  CFGR1    DMNGT           LL_ADC_REG_GetDataTransferMode
  * @param  p_adc Pointer to ADC instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_ADC_REG_DR_TRANSFER
  *         @arg @ref LL_ADC_REG_DMA_TRANSFER_LIMITED
  *         @arg @ref LL_ADC_REG_DMA_TRANSFER_UNLIMITED
  */
__STATIC_INLINE uint32_t LL_ADC_REG_GetDataTransferMode(const ADC_TypeDef *p_adc)
{
  return (uint32_t)(STM32_READ_BIT(p_adc->CFGR1, ADC_CFGR1_DMNGT));
}

/**
  * @brief  Set ADC group regular behavior in case of overrun:
  *         data preserved or overwritten.
  * @rmtoll
  *  CFGR1    OVRMOD         LL_ADC_REG_SetOverrun
  * @param  p_adc Pointer to ADC instance
  * @param  overrun This parameter can be one of the following values:
  *         @arg @ref LL_ADC_REG_OVR_DATA_PRESERVED
  *         @arg @ref LL_ADC_REG_OVR_DATA_OVERWRITTEN
  * @note   Compatibility with devices without feature overrun:
  *         other devices without this feature have a behavior
  *         equivalent to data overwritten.
  *         The default setting of overrun is data preserved.
  *         Therefore, for compatibility with all devices, parameter
  *         overrun can be set to data overwritten.
  * @note   On this STM32 series, setting of this feature is conditioned to
  *         ADC state:
  *         ADC must be disabled or enabled without conversion ongoing
  *         on group regular.
  */
__STATIC_INLINE void LL_ADC_REG_SetOverrun(ADC_TypeDef *p_adc, uint32_t overrun)
{
  STM32_MODIFY_REG(p_adc->CFGR1, ADC_CFGR1_OVRMOD, overrun);
}

/**
  * @brief  Get ADC group regular behavior in case of overrun:
  *         data preserved or overwritten.
  * @rmtoll
  *  CFGR1    OVRMOD         LL_ADC_REG_GetOverrun
  * @param  p_adc Pointer to ADC instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_ADC_REG_OVR_DATA_PRESERVED
  *         @arg @ref LL_ADC_REG_OVR_DATA_OVERWRITTEN
  */
__STATIC_INLINE uint32_t LL_ADC_REG_GetOverrun(const ADC_TypeDef *p_adc)
{
  return (uint32_t)(STM32_READ_BIT(p_adc->CFGR1, ADC_CFGR1_OVRMOD));
}

/**
  * @}
  */

/** @defgroup ADC_LL_EF_Configuration_ADC_Group_Injected Configuration of ADC hierarchical scope: group injected
  * @{
  */

/**
  * @brief  Set ADC group injected conversion trigger source:
  *         internal (SW start) or from external peripheral (timer event,
  *         EXTI line).
  * @rmtoll
  *  JSQR     JEXTSEL        LL_ADC_INJ_SetTriggerSource\n
  *  JSQR     JEXTEN         LL_ADC_INJ_SetTriggerSource
  * @param  p_adc Pointer to ADC instance
  * @param  trigger_source This parameter can be one of the following values:
  *         @arg @ref LL_ADC_INJ_TRIG_EXTI15
  *         @arg @ref LL_ADC_INJ_TRIG_TIM1_OC4
  *         @arg @ref LL_ADC_INJ_TRIG_TIM1_TRGO
  *         @arg @ref LL_ADC_INJ_TRIG_TIM1_TRGO2
  *         @arg @ref LL_ADC_INJ_TRIG_TIM2_OC1
  *         @arg @ref LL_ADC_INJ_TRIG_TIM2_TRGO
  *         @arg @ref LL_ADC_INJ_TRIG_TIM5_OC1
  *         @arg @ref LL_ADC_INJ_TRIG_TIM5_OC2
  *         @arg @ref LL_ADC_INJ_TRIG_TIM5_OC3
  * @if TIM3
  *         @arg @ref LL_ADC_INJ_TRIG_TIM3_TRGO
  *         @arg @ref LL_ADC_INJ_TRIG_TIM3_OC3
  * @endif
  * @if TIM4
  *         @arg @ref LL_ADC_INJ_TRIG_TIM4_TRGO
  * @endif
  *         @arg @ref LL_ADC_INJ_TRIG_TIM5_TRGO
  *         @arg @ref LL_ADC_INJ_TRIG_TIM7_TRGO
  *         @arg @ref LL_ADC_INJ_TRIG_TIM8_OC4
  *         @arg @ref LL_ADC_INJ_TRIG_TIM8_TRGO
  *         @arg @ref LL_ADC_INJ_TRIG_TIM8_TRGO2
  *         @arg @ref LL_ADC_INJ_TRIG_TIM12_TRGO
  *         @arg @ref LL_ADC_INJ_TRIG_TIM15_TRGO
  * @if LPTIM1
  *         @arg @ref LL_ADC_INJ_TRIG_LPTIM1_OC1
  * @endif
  * @note   On this STM32 series, setting trigger source to external trigger
  *         also set trigger polarity to rising edge
  *         (default setting for compatibility with some ADC on other
  *         STM32 series having this setting set by HW default value).
  *         In case of need to modify trigger edge, use
  *         function @ref LL_ADC_INJ_SetTriggerEdge().
  * @note   Availability of parameters of trigger sources from timer
  *         depends on timers availability on the selected device.
  * @note   On this STM32 series, setting of this feature is conditioned to
  *         ADC state:
  *         ADC must be disabled or enabled without conversion ongoing
  *         on group injected.
  */
__STATIC_INLINE void LL_ADC_INJ_SetTriggerSource(ADC_TypeDef *p_adc, uint32_t trigger_source)
{
  STM32_MODIFY_REG(p_adc->JSQR, ADC_JSQR_JEXTSEL | ADC_JSQR_JEXTEN, trigger_source);
}

/**
  * @brief  Get ADC group injected conversion trigger source:
  *         internal (SW start) or from external peripheral (timer event,
  *         EXTI line).
  * @rmtoll
  *  JSQR     JEXTSEL        LL_ADC_INJ_GetTriggerSource\n
  *  JSQR     JEXTEN         LL_ADC_INJ_GetTriggerSource
  * @param  p_adc Pointer to ADC instance
  * @note   To determine whether group injected trigger source is
  *         internal (SW start) or external, without detail
  *         of which peripheral is selected as external trigger,
  *         (equivalent to
  *         "if(LL_ADC_INJ_GetTriggerSource(ADC1) == LL_ADC_INJ_TRIG_SOFTWARE)")
  *         use function @ref LL_ADC_INJ_IsTriggerSourceSWStart.
  * @note   Availability of parameters of trigger sources from timer
  *         depends on timers availability on the selected device.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_ADC_INJ_TRIG_EXTI15
  *         @arg @ref LL_ADC_INJ_TRIG_TIM1_OC4
  *         @arg @ref LL_ADC_INJ_TRIG_TIM1_TRGO
  *         @arg @ref LL_ADC_INJ_TRIG_TIM1_TRGO2
  *         @arg @ref LL_ADC_INJ_TRIG_TIM2_OC1
  *         @arg @ref LL_ADC_INJ_TRIG_TIM2_TRGO
  *         @arg @ref LL_ADC_INJ_TRIG_TIM5_OC1
  *         @arg @ref LL_ADC_INJ_TRIG_TIM5_OC2
  *         @arg @ref LL_ADC_INJ_TRIG_TIM5_OC3
  * @if TIM3
  *         @arg @ref LL_ADC_INJ_TRIG_TIM3_TRGO
  *         @arg @ref LL_ADC_INJ_TRIG_TIM3_OC3
  * @endif
  * @if TIM4
  *         @arg @ref LL_ADC_INJ_TRIG_TIM4_TRGO
  * @endif
  *         @arg @ref LL_ADC_INJ_TRIG_TIM5_TRGO
  *         @arg @ref LL_ADC_INJ_TRIG_TIM7_TRGO
  *         @arg @ref LL_ADC_INJ_TRIG_TIM8_OC4
  *         @arg @ref LL_ADC_INJ_TRIG_TIM8_TRGO
  *         @arg @ref LL_ADC_INJ_TRIG_TIM8_TRGO2
  *         @arg @ref LL_ADC_INJ_TRIG_TIM12_TRGO
  *         @arg @ref LL_ADC_INJ_TRIG_TIM15_TRGO
  * @if LPTIM1
  *         @arg @ref LL_ADC_INJ_TRIG_LPTIM1_OC1
  * @endif
  */
__STATIC_INLINE uint32_t LL_ADC_INJ_GetTriggerSource(const ADC_TypeDef *p_adc)
{
  __IO uint32_t trigger_source = STM32_READ_BIT(p_adc->JSQR, ADC_JSQR_JEXTSEL | ADC_JSQR_JEXTEN);

  /* Value for shift of [0, 4, 8, 12] depending on value of bitfield corresponding to ADC_JSQR_JEXTEN [0, 1, 2, 3] */
  uint32_t shift_jexten = ((trigger_source & ADC_JSQR_JEXTEN) >> (ADC_JSQR_JEXTEN_Pos - 2UL));

  /* Set bitfield corresponding to ADC_CFGR1_EXTEN and ADC_CFGR1_EXTSEL to match with triggers literals definition */
  return ((trigger_source
           & (LL_ADC_INJ_TRIG_SOURCE_MASK >> shift_jexten) & ADC_JSQR_JEXTSEL)
          | ((LL_ADC_INJ_TRIG_EDGE_MASK >> shift_jexten) & ADC_JSQR_JEXTEN)
         );
}

/**
  * @brief  Get ADC group injected conversion trigger source internal (SW start)
            or external.
  * @rmtoll
  *  JSQR     JEXTEN         LL_ADC_INJ_IsTriggerSourceSWStart
  * @param  p_adc Pointer to ADC instance
  * @note   In case of group injected trigger source set to external trigger,
  *         to determine which peripheral is selected as external trigger,
  *         use function @ref LL_ADC_INJ_GetTriggerSource.
  * @retval Value "0" if trigger source external trigger
  *         Value "1" if trigger source SW start.
  */
__STATIC_INLINE uint32_t LL_ADC_INJ_IsTriggerSourceSWStart(const ADC_TypeDef *p_adc)
{
  return ((STM32_READ_BIT(p_adc->JSQR, ADC_JSQR_JEXTEN) == 0UL) ? 1UL : 0UL);
}

/**
  * @brief  Set ADC group injected conversion trigger polarity.
  *         Applicable only for trigger source set to external trigger.
  * @rmtoll
  *  JSQR     JEXTEN         LL_ADC_INJ_SetTriggerEdge
  * @param  p_adc Pointer to ADC instance
  * @param  external_trigger_edge This parameter can be one of the following values:
  *         @arg @ref LL_ADC_INJ_TRIG_RISING
  *         @arg @ref LL_ADC_INJ_TRIG_FALLING
  *         @arg @ref LL_ADC_INJ_TRIG_RISING_FALLING
  * @note   On this STM32 series, setting of this feature is conditioned to
  *         ADC state:
  *         ADC must not be disabled. Can be enabled with or without conversion
  *         ongoing on either groups regular or injected.
  */
__STATIC_INLINE void LL_ADC_INJ_SetTriggerEdge(ADC_TypeDef *p_adc, uint32_t external_trigger_edge)
{
  STM32_MODIFY_REG(p_adc->JSQR, ADC_JSQR_JEXTEN, external_trigger_edge);
}

/**
  * @brief  Get ADC group injected conversion trigger polarity.
  *         Applicable only for trigger source set to external trigger.
  * @rmtoll
  *  JSQR     JEXTEN         LL_ADC_INJ_GetTriggerEdge
  * @param  p_adc Pointer to ADC instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_ADC_INJ_TRIG_RISING
  *         @arg @ref LL_ADC_INJ_TRIG_FALLING
  *         @arg @ref LL_ADC_INJ_TRIG_RISING_FALLING
  */
__STATIC_INLINE uint32_t LL_ADC_INJ_GetTriggerEdge(const ADC_TypeDef *p_adc)
{
  return (uint32_t)(STM32_READ_BIT(p_adc->JSQR, ADC_JSQR_JEXTEN));
}

/**
  * @brief  Set ADC group injected sequencer length and scan direction.
  * @rmtoll
  *  JSQR     JLEN           LL_ADC_INJ_SetSequencerLength
  * @param  p_adc Pointer to ADC instance
  * @param  sequencer_nb_ranks This parameter can be one of the following values:
  *         @arg @ref LL_ADC_INJ_SEQ_SCAN_DISABLE
  *         @arg @ref LL_ADC_INJ_SEQ_SCAN_ENABLE_2RANKS
  *         @arg @ref LL_ADC_INJ_SEQ_SCAN_ENABLE_3RANKS
  *         @arg @ref LL_ADC_INJ_SEQ_SCAN_ENABLE_4RANKS
  * @note   This function performs configuration of:
  *         - Sequence length: Number of ranks in the scan sequence.
  *         - Sequence direction: Unless specified in parameters, sequencer
  *           scan direction is forward (from rank 1 to rank n).
  * @note   Sequencer disabled is equivalent to sequencer of 1 rank:
  *         ADC conversion on only 1 channel.
  * @note   On this STM32 series, setting of this feature is conditioned to
  *         ADC state:
  *         ADC must not be disabled. Can be enabled with or without conversion
  *         ongoing on either groups regular or injected.
  */
__STATIC_INLINE void LL_ADC_INJ_SetSequencerLength(ADC_TypeDef *p_adc, uint32_t sequencer_nb_ranks)
{
  STM32_MODIFY_REG(p_adc->JSQR, ADC_JSQR_JLEN, sequencer_nb_ranks);
}

/**
  * @brief  Get ADC group injected sequencer length and scan direction.
  * @rmtoll
  *  JSQR     JLEN           LL_ADC_INJ_GetSequencerLength
  * @param  p_adc Pointer to ADC instance
  * @note   This function retrieves:
  *         - Sequence length: Number of ranks in the scan sequence.
  *         - Sequence direction: Unless specified in parameters, sequencer
  *           scan direction is forward (from rank 1 to rank n).
  * @note   Sequencer disabled is equivalent to sequencer of 1 rank:
  *         ADC conversion on only 1 channel.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_ADC_INJ_SEQ_SCAN_DISABLE
  *         @arg @ref LL_ADC_INJ_SEQ_SCAN_ENABLE_2RANKS
  *         @arg @ref LL_ADC_INJ_SEQ_SCAN_ENABLE_3RANKS
  *         @arg @ref LL_ADC_INJ_SEQ_SCAN_ENABLE_4RANKS
  */
__STATIC_INLINE uint32_t LL_ADC_INJ_GetSequencerLength(const ADC_TypeDef *p_adc)
{
  return (uint32_t)(STM32_READ_BIT(p_adc->JSQR, ADC_JSQR_JLEN));
}

/**
  * @brief  Set ADC group injected sequencer discontinuous mode:
  *         sequence subdivided and scan conversions interrupted every selected
  *         number of ranks.
  * @rmtoll
  *  CFGR1    JDISCEN        LL_ADC_INJ_SetSequencerDiscont
  * @param  p_adc Pointer to ADC instance
  * @param  seq_discont This parameter can be one of the following values:
  *         @arg @ref LL_ADC_INJ_SEQ_DISCONT_DISABLE
  *         @arg @ref LL_ADC_INJ_SEQ_DISCONT_1RANK
  * @note   It is not possible to enable both ADC group injected
  *         auto-injected mode and sequencer discontinuous mode.
  */
__STATIC_INLINE void LL_ADC_INJ_SetSequencerDiscont(ADC_TypeDef *p_adc, uint32_t seq_discont)
{
  STM32_MODIFY_REG(p_adc->CFGR1, ADC_CFGR1_JDISCEN, seq_discont);
}

/**
  * @brief  Get ADC group injected sequencer discontinuous mode:
  *         sequence subdivided and scan conversions interrupted every selected
  *         number of ranks.
  * @rmtoll
  *  CFGR1    JDISCEN        LL_ADC_INJ_GetSequencerDiscont
  * @param  p_adc Pointer to ADC instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_ADC_INJ_SEQ_DISCONT_DISABLE
  *         @arg @ref LL_ADC_INJ_SEQ_DISCONT_1RANK
  */
__STATIC_INLINE uint32_t LL_ADC_INJ_GetSequencerDiscont(const ADC_TypeDef *p_adc)
{
  return (uint32_t)(STM32_READ_BIT(p_adc->CFGR1, ADC_CFGR1_JDISCEN));
}

/**
  * @brief  Set ADC group injected sequence: channel on the selected
  *         sequence rank.
  * @rmtoll
  *  JSQR     JSQ1           LL_ADC_INJ_SetSequencerRanks\n
  *  JSQR     JSQ2           LL_ADC_INJ_SetSequencerRanks\n
  *  JSQR     JSQ3           LL_ADC_INJ_SetSequencerRanks\n
  *  JSQR     JSQ4           LL_ADC_INJ_SetSequencerRanks
  * @param  p_adc Pointer to ADC instance
  * @param  rank This parameter can be one of the following values:
  *         @arg @ref LL_ADC_INJ_RANK_1
  *         @arg @ref LL_ADC_INJ_RANK_2
  *         @arg @ref LL_ADC_INJ_RANK_3
  *         @arg @ref LL_ADC_INJ_RANK_4
  * @param  channel This parameter can be one of the following values:
  *         @arg @ref LL_ADC_CHANNEL_0
  *         @arg @ref LL_ADC_CHANNEL_1
  *         @arg @ref LL_ADC_CHANNEL_2
  *         @arg @ref LL_ADC_CHANNEL_3
  *         @arg @ref LL_ADC_CHANNEL_4
  *         @arg @ref LL_ADC_CHANNEL_5
  *         @arg @ref LL_ADC_CHANNEL_6
  *         @arg @ref LL_ADC_CHANNEL_7
  *         @arg @ref LL_ADC_CHANNEL_8
  *         @arg @ref LL_ADC_CHANNEL_9
  *         @arg @ref LL_ADC_CHANNEL_10
  *         @arg @ref LL_ADC_CHANNEL_11
  *         @arg @ref LL_ADC_CHANNEL_12
  *         @arg @ref LL_ADC_CHANNEL_13
  *         @arg @ref LL_ADC_CHANNEL_VREFINT         (1)
  *         @arg @ref LL_ADC_CHANNEL_TEMPSENSOR      (1)
  *         @arg @ref LL_ADC_CHANNEL_VDDCORE         (1)
  *         @arg @ref LL_ADC_CHANNEL_OPAMP1_OUT      (1)
  *         @arg @ref LL_ADC_CHANNEL_OPAMP2_OUT      (1)
  *         @arg @ref LL_ADC_CHANNEL_OPAMP3_OUT      (1)
  *         @arg @ref LL_ADC_CHANNEL_VREFINT_ALT     (2)
  *         @arg @ref LL_ADC_CHANNEL_VDDCORE_ALT     (2)
  *         @arg @ref LL_ADC_CHANNEL_OPAMP1_OUT_ALT  (2)
  *         @arg @ref LL_ADC_CHANNEL_OPAMP2_OUT_ALT  (2)
  *         @arg @ref LL_ADC_CHANNEL_VREFINT_ALT2    (3)
  *         @arg @ref LL_ADC_CHANNEL_VDDCORE_ALT2    (3)
  *         @arg @ref LL_ADC_CHANNEL_OPAMP3_OUT_ALT  (3)
  *
  *         (1) On this STM32 series, parameter available only on ADC instance: ADC1.\n
  *         (2) On this STM32 series, parameter available only on ADC instance: ADC2.\n
  *         (3) On this STM32 series, parameter available only on ADC instance: ADC3.\n
  * @note   Depending on devices and packages, some channels can be not available.
  *         Refer to device datasheet for channels availability.
  * @note   On this STM32 series, to measure internal channels (VrefInt,
  *         TempSensor, ...), measurement paths to internal channels must be
  *         enabled separately.
  *         This can be done using function @ref LL_ADC_SetCommonPathInternalCh().
  * @note   On this STM32 series, setting of this feature is conditioned to
  *         ADC state:
  *         ADC must not be disabled. Can be enabled with or without conversion
  *         ongoing on either groups regular or injected.
  */
__STATIC_INLINE void LL_ADC_INJ_SetSequencerRanks(ADC_TypeDef *p_adc, uint32_t rank, uint32_t channel)
{
  /* Set bits with content of parameter "Channel" with bits position          */
  /* in register depending on parameter "Rank".                               */
  /* Parameters "Rank" and "Channel" are used with masks because containing   */
  /* other bits reserved for other purpose.                                   */
  const uint32_t channel_ll = LL_ADC_REMAP_CHANNEL_INTERNAL_SET(p_adc, channel);
  STM32_MODIFY_REG(p_adc->JSQR,
                   (LL_ADC_CH_NUMBER_MASK >> LL_ADC_AWD_CH_NB_BITOFFSET_POS)
                   << (rank & LL_ADC_INJ_RANK_ID_JSQR_MASK),
                   (channel_ll & LL_ADC_CH_NUMBER_MASK) << (rank & LL_ADC_INJ_RANK_ID_JSQR_MASK));
}

/**
  * @brief  Get ADC group injected sequence: channel on the selected
  *         sequence rank.
  * @rmtoll
  *  JSQR     JSQ1           LL_ADC_INJ_GetSequencerRanks\n
  *  JSQR     JSQ2           LL_ADC_INJ_GetSequencerRanks\n
  *  JSQR     JSQ3           LL_ADC_INJ_GetSequencerRanks\n
  *  JSQR     JSQ4           LL_ADC_INJ_GetSequencerRanks
  * @param  p_adc Pointer to ADC instance
  * @param  rank This parameter can be one of the following values:
  *         @arg @ref LL_ADC_INJ_RANK_1
  *         @arg @ref LL_ADC_INJ_RANK_2
  *         @arg @ref LL_ADC_INJ_RANK_3
  *         @arg @ref LL_ADC_INJ_RANK_4
  * @note   Depending on devices and packages, some channels can be not available.
  *         Refer to device datasheet for channels availability.
  * @note   Usage of the returned channel number:
  *         - To reinject this channel into another function LL_ADC_xxx:
  *           the returned channel number is only partly formatted on definition
  *           of literals LL_ADC_CHANNEL_x. Therefore, it has to be compared
  *           with parts of literals LL_ADC_CHANNEL_x or using
  *           helper macro @ref LL_ADC_CHANNEL_TO_DECIMAL_NB().
  *           Then the selected literal LL_ADC_CHANNEL_x can be used
  *           as parameter for another function.
  *         - To get the channel number in decimal format:
  *           process the returned value with the helper macro
  *           @ref LL_ADC_CHANNEL_TO_DECIMAL_NB().
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_ADC_CHANNEL_0
  *         @arg @ref LL_ADC_CHANNEL_1
  *         @arg @ref LL_ADC_CHANNEL_2
  *         @arg @ref LL_ADC_CHANNEL_3
  *         @arg @ref LL_ADC_CHANNEL_4
  *         @arg @ref LL_ADC_CHANNEL_5
  *         @arg @ref LL_ADC_CHANNEL_6
  *         @arg @ref LL_ADC_CHANNEL_7
  *         @arg @ref LL_ADC_CHANNEL_8
  *         @arg @ref LL_ADC_CHANNEL_9
  *         @arg @ref LL_ADC_CHANNEL_10
  *         @arg @ref LL_ADC_CHANNEL_11
  *         @arg @ref LL_ADC_CHANNEL_12
  *         @arg @ref LL_ADC_CHANNEL_13
  *         @arg @ref LL_ADC_CHANNEL_VREFINT         (1)(5)
  *         @arg @ref LL_ADC_CHANNEL_TEMPSENSOR      (1)(5)
  *         @arg @ref LL_ADC_CHANNEL_VDDCORE         (1)(5)
  *         @arg @ref LL_ADC_CHANNEL_OPAMP1_OUT      (1)(5)
  *         @arg @ref LL_ADC_CHANNEL_OPAMP2_OUT      (1)(5)
  *         @arg @ref LL_ADC_CHANNEL_OPAMP3_OUT      (1)(5)
  *         @arg @ref LL_ADC_CHANNEL_VREFINT_ALT     (2)(5)
  *         @arg @ref LL_ADC_CHANNEL_VDDCORE_ALT     (2)(5)
  *         @arg @ref LL_ADC_CHANNEL_OPAMP1_OUT_ALT  (2)(5)
  *         @arg @ref LL_ADC_CHANNEL_OPAMP2_OUT_ALT  (2)(5)
  *         @arg @ref LL_ADC_CHANNEL_VREFINT_ALT2    (3)(5)
  *         @arg @ref LL_ADC_CHANNEL_VDDCORE_ALT2    (3)(5)
  *         @arg @ref LL_ADC_CHANNEL_OPAMP3_OUT_ALT  (3)(5)
  *
  *         (1) On this STM32 series, parameter available only on ADC instance: ADC1.\n
  *         (2) On this STM32 series, parameter available only on ADC instance: ADC2.\n
  *         (3) On this STM32 series, parameter available only on ADC instance: ADC3.\n
  *         (5) For ADC channel read back from ADC register,
  *             comparison with internal channel parameter to be done
  *             using helper macro @ref LL_ADC_CHANNEL_INTERNAL_TO_EXTERNAL().
  *
  */
__STATIC_INLINE uint32_t LL_ADC_INJ_GetSequencerRanks(const ADC_TypeDef *p_adc, uint32_t rank)
{
  return (uint32_t)((STM32_READ_BIT(p_adc->JSQR,
                                    LL_ADC_CH_NUMBER_MASK << (rank & LL_ADC_INJ_RANK_ID_JSQR_MASK))
                     >> (rank & LL_ADC_INJ_RANK_ID_JSQR_MASK))
                   );
}

