MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_adc.h
/**
  * @brief  Set ADC group injected conversion trigger:
  *         independent or from ADC group regular.
  * @rmtoll
  *  CFGR1    JAUTO          LL_ADC_INJ_SetTrigAuto
  * @param  p_adc Pointer to ADC instance
  * @param  trig_auto This parameter can be one of the following values:
  *         @arg @ref LL_ADC_INJ_TRIG_INDEPENDENT
  *         @arg @ref LL_ADC_INJ_TRIG_FROM_REGULAR
  * @note   This mode can be used to extend number of data registers
  *         updated after one ADC conversion trigger and with data
  *         permanently kept (not erased by successive conversions of scan of
  *         ADC sequencer ranks), up to 5 data registers:
  *         1 data register on ADC group regular, 4 data registers
  *         on ADC group injected.
  * @note   If ADC group injected injected trigger source is set to an
  *         external trigger, this feature must be must be set to
  *         independent trigger.
  *         ADC group injected automatic trigger is compliant only with
  *         group injected trigger source set to SW start, without any
  *         further action on  ADC group injected conversion start or stop:
  *         in this case, ADC group injected is controlled only
  *         from ADC group regular.
  * @note   It is not possible to enable both ADC group injected
  *         auto-injected mode and sequencer discontinuous mode.
  * @note   On this STM32 series, setting of this feature is conditioned to
  *         ADC state:
  *         ADC must be disabled or enabled without conversion ongoing
  *         on either groups regular or injected.
  */
__STATIC_INLINE void LL_ADC_INJ_SetTrigAuto(ADC_TypeDef *p_adc, uint32_t trig_auto)
{
  STM32_MODIFY_REG(p_adc->CFGR1, ADC_CFGR1_JAUTO, trig_auto);
}

/**
  * @brief  Get ADC group injected conversion trigger:
  *         independent or from ADC group regular.
  * @rmtoll
  *  CFGR1    JAUTO          LL_ADC_INJ_GetTrigAuto
  * @param  p_adc Pointer to ADC instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_ADC_INJ_TRIG_INDEPENDENT
  *         @arg @ref LL_ADC_INJ_TRIG_FROM_REGULAR
  */
__STATIC_INLINE uint32_t LL_ADC_INJ_GetTrigAuto(const ADC_TypeDef *p_adc)
{
  return (uint32_t)(STM32_READ_BIT(p_adc->CFGR1, ADC_CFGR1_JAUTO));
}

/**
  * @}
  */

/** @defgroup ADC_LL_EF_Configuration_Channels Configuration of ADC hierarchical scope: channels
  * @{
  */

/**
  * @brief  Set sampling time of the selected ADC channel (unit: ADC clock cycles).
  * @rmtoll
  *  SMPR1    SMP0           LL_ADC_SetChannelSamplingTime\n
  *  SMPR1    SMP1           LL_ADC_SetChannelSamplingTime\n
  *  SMPR1    SMP2           LL_ADC_SetChannelSamplingTime\n
  *  SMPR1    SMP3           LL_ADC_SetChannelSamplingTime\n
  *  SMPR1    SMP4           LL_ADC_SetChannelSamplingTime\n
  *  SMPR1    SMP5           LL_ADC_SetChannelSamplingTime\n
  *  SMPR1    SMP6           LL_ADC_SetChannelSamplingTime\n
  *  SMPR1    SMP7           LL_ADC_SetChannelSamplingTime\n
  *  SMPR1    SMP8           LL_ADC_SetChannelSamplingTime\n
  *  SMPR1    SMP9           LL_ADC_SetChannelSamplingTime\n
  *  SMPR2    SMP10          LL_ADC_SetChannelSamplingTime\n
  *  SMPR2    SMP11          LL_ADC_SetChannelSamplingTime\n
  *  SMPR2    SMP12          LL_ADC_SetChannelSamplingTime\n
  *  SMPR2    SMP13          LL_ADC_SetChannelSamplingTime\n
  *  SMPR2    SMP14          LL_ADC_SetChannelSamplingTime\n
  *  SMPR2    SMP15          LL_ADC_SetChannelSamplingTime\n
  *  SMPR2    SMP16          LL_ADC_SetChannelSamplingTime\n
  *  SMPR2    SMP17          LL_ADC_SetChannelSamplingTime\n
  *  SMPR2    SMP18          LL_ADC_SetChannelSamplingTime
  * @param  p_adc Pointer to ADC instance
  * @param  channel This parameter can be one of the following values:
  *         @arg @ref LL_ADC_CHANNEL_0
  *         @arg @ref LL_ADC_CHANNEL_1
  *         @arg @ref LL_ADC_CHANNEL_2
  *         @arg @ref LL_ADC_CHANNEL_3
  *         @arg @ref LL_ADC_CHANNEL_4
  *         @arg @ref LL_ADC_CHANNEL_5
  *         @arg @ref LL_ADC_CHANNEL_6
  *         @arg @ref LL_ADC_CHANNEL_7
  *         @arg @ref LL_ADC_CHANNEL_8
  *         @arg @ref LL_ADC_CHANNEL_9
  *         @arg @ref LL_ADC_CHANNEL_10
  *         @arg @ref LL_ADC_CHANNEL_11
  *         @arg @ref LL_ADC_CHANNEL_12
  *         @arg @ref LL_ADC_CHANNEL_13
  *         @arg @ref LL_ADC_CHANNEL_VREFINT         (1)(5)
  *         @arg @ref LL_ADC_CHANNEL_TEMPSENSOR      (1)(5)
  *         @arg @ref LL_ADC_CHANNEL_VDDCORE         (1)(5)
  *         @arg @ref LL_ADC_CHANNEL_OPAMP1_OUT      (1)(5)
  *         @arg @ref LL_ADC_CHANNEL_OPAMP2_OUT      (1)(5)
  *         @arg @ref LL_ADC_CHANNEL_OPAMP3_OUT      (1)(5)
  *         @arg @ref LL_ADC_CHANNEL_VREFINT_ALT     (2)(5)
  *         @arg @ref LL_ADC_CHANNEL_VDDCORE_ALT     (2)(5)
  *         @arg @ref LL_ADC_CHANNEL_OPAMP1_OUT_ALT  (2)(5)
  *         @arg @ref LL_ADC_CHANNEL_OPAMP2_OUT_ALT  (2)(5)
  *         @arg @ref LL_ADC_CHANNEL_VREFINT_ALT2    (3)(5)
  *         @arg @ref LL_ADC_CHANNEL_VDDCORE_ALT2    (3)(5)
  *         @arg @ref LL_ADC_CHANNEL_OPAMP3_OUT_ALT  (3)(5)
  *
  *         (1) On this STM32 series, parameter available only on ADC instance: ADC1.\n
  *         (2) On this STM32 series, parameter available only on ADC instance: ADC2.\n
  *         (3) On this STM32 series, parameter available only on ADC instance: ADC3.\n
  *         (5) For ADC channel read back from ADC register,
  *             comparison with internal channel parameter to be done
  *             using helper macro @ref LL_ADC_CHANNEL_INTERNAL_TO_EXTERNAL().
  *
  * @param  sampling_time This parameter can be one of the following values:
  *         @arg @ref LL_ADC_SAMPLINGTIME_3CYCLES
  *         @arg @ref LL_ADC_SAMPLINGTIME_5CYCLES
  *         @arg @ref LL_ADC_SAMPLINGTIME_8CYCLES
  *         @arg @ref LL_ADC_SAMPLINGTIME_13CYCLES
  *         @arg @ref LL_ADC_SAMPLINGTIME_25CYCLES
  *         @arg @ref LL_ADC_SAMPLINGTIME_48CYCLES
  *         @arg @ref LL_ADC_SAMPLINGTIME_139CYCLES
  *         @arg @ref LL_ADC_SAMPLINGTIME_289CYCLES
  * @note   On this device, sampling time is on channel scope: independently
  *         of channel mapped on ADC group regular or injected.
  * @note   In case of internal channel (VrefInt, TempSensor, ...) to be
  *         converted:
  *         sampling time constraints must be respected (sampling time can be
  *         adjusted in function of ADC clock frequency and sampling time
  *         setting).
  *         Refer to device datasheet for timings values (parameters TS_vrefint,
  *         TS_temp, ...).
  * @note   Conversion time is the addition of sampling time and processing time.
  *         On this STM32 series, ADC processing time is:
  *         - 13 ADC clock cycles at ADC resolution 12 bits
  *         - 11 ADC clock cycles at ADC resolution 10 bits
  *         - 9 ADC clock cycles at ADC resolution 8 bits
  *         - 7 ADC clock cycles at ADC resolution 6 bits
  * @note   In case of ADC conversion of internal channel (VrefInt,
  *         temperature sensor, ...), a sampling time minimum value
  *         is required.
  *         Refer to device datasheet.
  * @note   On this STM32 series, setting of this feature is conditioned to
  *         ADC state:
  *         ADC must be disabled or enabled without conversion ongoing
  *         on either groups regular or injected.
  */
__STATIC_INLINE void LL_ADC_SetChannelSamplingTime(ADC_TypeDef *p_adc, uint32_t channel, uint32_t sampling_time)
{
  /* Set bits with content of parameter "sampling_time" with bits position
     in register and register position depending on parameter "Channel".
     Parameter "channel" is used with masks because containing
     other bits reserved for other purpose. */
  const uint32_t channel_ll = LL_ADC_REMAP_CHANNEL_INTERNAL_SET(p_adc, channel);
  const uint32_t ichannel = LL_ADC_CHANNEL_LUT_INDEX(channel_ll);
  __IO uint32_t *preg = LL_ADC_PTR_REG_OFFSET(p_adc->SMPR1,
                                              ((LL_ADC_CHANNEL_LUT[ichannel]
                                                & LL_ADC_CH_SMPRX_REGOFFSET_MASK) >> LL_ADC_CH_SMPRX_REGOFFSET_POS));
  STM32_MODIFY_REG(*preg,
                   ADC_SMPR1_SMP0 << ((LL_ADC_CHANNEL_LUT[ichannel] & LL_ADC_CH_SMPX_BITOFFSET_MASK)
                                      >> LL_ADC_CH_SMPX_BITOFFSET_POS),
                   sampling_time   << ((LL_ADC_CHANNEL_LUT[ichannel] & LL_ADC_CH_SMPX_BITOFFSET_MASK)
                                       >> LL_ADC_CH_SMPX_BITOFFSET_POS));
}

/**
  * @brief  Get sampling time of the selected ADC channel (unit: ADC clock cycles).
  * @rmtoll
  *  SMPR1    SMP0           LL_ADC_GetChannelSamplingTime\n
  *  SMPR1    SMP1           LL_ADC_GetChannelSamplingTime\n
  *  SMPR1    SMP2           LL_ADC_GetChannelSamplingTime\n
  *  SMPR1    SMP3           LL_ADC_GetChannelSamplingTime\n
  *  SMPR1    SMP4           LL_ADC_GetChannelSamplingTime\n
  *  SMPR1    SMP5           LL_ADC_GetChannelSamplingTime\n
  *  SMPR1    SMP6           LL_ADC_GetChannelSamplingTime\n
  *  SMPR1    SMP7           LL_ADC_GetChannelSamplingTime\n
  *  SMPR1    SMP8           LL_ADC_GetChannelSamplingTime\n
  *  SMPR1    SMP9           LL_ADC_GetChannelSamplingTime\n
  *  SMPR2    SMP10          LL_ADC_GetChannelSamplingTime\n
  *  SMPR2    SMP11          LL_ADC_GetChannelSamplingTime\n
  *  SMPR2    SMP12          LL_ADC_GetChannelSamplingTime\n
  *  SMPR2    SMP13          LL_ADC_GetChannelSamplingTime\n
  *  SMPR2    SMP14          LL_ADC_GetChannelSamplingTime\n
  *  SMPR2    SMP15          LL_ADC_GetChannelSamplingTime\n
  *  SMPR2    SMP16          LL_ADC_GetChannelSamplingTime\n
  *  SMPR2    SMP17          LL_ADC_GetChannelSamplingTime\n
  *  SMPR2    SMP18          LL_ADC_GetChannelSamplingTime
  * @param  p_adc Pointer to ADC instance
  * @param  channel This parameter can be one of the following values:
  *         @arg @ref LL_ADC_CHANNEL_0
  *         @arg @ref LL_ADC_CHANNEL_1
  *         @arg @ref LL_ADC_CHANNEL_2
  *         @arg @ref LL_ADC_CHANNEL_3
  *         @arg @ref LL_ADC_CHANNEL_4
  *         @arg @ref LL_ADC_CHANNEL_5
  *         @arg @ref LL_ADC_CHANNEL_6
  *         @arg @ref LL_ADC_CHANNEL_7
  *         @arg @ref LL_ADC_CHANNEL_8
  *         @arg @ref LL_ADC_CHANNEL_9
  *         @arg @ref LL_ADC_CHANNEL_10
  *         @arg @ref LL_ADC_CHANNEL_11
  *         @arg @ref LL_ADC_CHANNEL_12
  *         @arg @ref LL_ADC_CHANNEL_13
  *         @arg @ref LL_ADC_CHANNEL_VREFINT         (1)(5)
  *         @arg @ref LL_ADC_CHANNEL_TEMPSENSOR      (1)(5)
  *         @arg @ref LL_ADC_CHANNEL_VDDCORE         (1)(5)
  *         @arg @ref LL_ADC_CHANNEL_OPAMP1_OUT      (1)(5)
  *         @arg @ref LL_ADC_CHANNEL_OPAMP2_OUT      (1)(5)
  *         @arg @ref LL_ADC_CHANNEL_OPAMP3_OUT      (1)(5)
  *         @arg @ref LL_ADC_CHANNEL_VREFINT_ALT     (2)(5)
  *         @arg @ref LL_ADC_CHANNEL_VDDCORE_ALT     (2)(5)
  *         @arg @ref LL_ADC_CHANNEL_OPAMP1_OUT_ALT  (2)(5)
  *         @arg @ref LL_ADC_CHANNEL_OPAMP2_OUT_ALT  (2)(5)
  *         @arg @ref LL_ADC_CHANNEL_VREFINT_ALT2    (3)(5)
  *         @arg @ref LL_ADC_CHANNEL_VDDCORE_ALT2    (3)(5)
  *         @arg @ref LL_ADC_CHANNEL_OPAMP3_OUT_ALT  (3)(5)
  *
  *         (1) On this STM32 series, parameter available only on ADC instance: ADC1.\n
  *         (2) On this STM32 series, parameter available only on ADC instance: ADC2.\n
  *         (3) On this STM32 series, parameter available only on ADC instance: ADC3.\n
  *         (5) For ADC channel read back from ADC register,
  *             comparison with internal channel parameter to be done
  *             using helper macro @ref LL_ADC_CHANNEL_INTERNAL_TO_EXTERNAL().
  *
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_ADC_SAMPLINGTIME_3CYCLES
  *         @arg @ref LL_ADC_SAMPLINGTIME_5CYCLES
  *         @arg @ref LL_ADC_SAMPLINGTIME_8CYCLES
  *         @arg @ref LL_ADC_SAMPLINGTIME_13CYCLES
  *         @arg @ref LL_ADC_SAMPLINGTIME_25CYCLES
  *         @arg @ref LL_ADC_SAMPLINGTIME_48CYCLES
  *         @arg @ref LL_ADC_SAMPLINGTIME_139CYCLES
  *         @arg @ref LL_ADC_SAMPLINGTIME_289CYCLES
  */
__STATIC_INLINE uint32_t LL_ADC_GetChannelSamplingTime(const ADC_TypeDef *p_adc, uint32_t channel)
{
  const uint32_t channel_ll = LL_ADC_REMAP_CHANNEL_INTERNAL_SET(p_adc, channel);
  const uint32_t ichannel = LL_ADC_CHANNEL_LUT_INDEX(channel_ll);
  const __IO uint32_t *preg = LL_ADC_PTR_REG_OFFSET(p_adc->SMPR1,
                                                    ((LL_ADC_CHANNEL_LUT[ichannel] & LL_ADC_CH_SMPRX_REGOFFSET_MASK)
                                                     >> LL_ADC_CH_SMPRX_REGOFFSET_POS));
  return (uint32_t)(STM32_READ_BIT(*preg,
                                   ADC_SMPR1_SMP0
                                   << ((LL_ADC_CHANNEL_LUT[ichannel]
                                        & LL_ADC_CH_SMPX_BITOFFSET_MASK) >> LL_ADC_CH_SMPX_BITOFFSET_POS))
                    >> ((LL_ADC_CHANNEL_LUT[ichannel] & LL_ADC_CH_SMPX_BITOFFSET_MASK)
                        >> LL_ADC_CH_SMPX_BITOFFSET_POS)
                   );
}

/**
  * @brief  Set mode single-ended or differential (availability depending on devices) on input of the selected
  *         ADC channel.
  * @rmtoll
  *  DIFSEL   DIFSEL         LL_ADC_SetChannelSingleDiff
  * @param  p_adc Pointer to ADC instance
  * @param  channel This parameter can be one of the following values:
  *         @arg @ref LL_ADC_CHANNEL_0
  *         @arg @ref LL_ADC_CHANNEL_1
  *         @arg @ref LL_ADC_CHANNEL_2
  *         @arg @ref LL_ADC_CHANNEL_3
  *         @arg @ref LL_ADC_CHANNEL_4
  *         @arg @ref LL_ADC_CHANNEL_5
  *         @arg @ref LL_ADC_CHANNEL_6
  *         @arg @ref LL_ADC_CHANNEL_7
  *         @arg @ref LL_ADC_CHANNEL_8
  *         @arg @ref LL_ADC_CHANNEL_9
  *         @arg @ref LL_ADC_CHANNEL_10
  *         @arg @ref LL_ADC_CHANNEL_11
  *         @arg @ref LL_ADC_CHANNEL_12
  *         @arg @ref LL_ADC_CHANNEL_13
  * @param  input_mode This parameter can be a combination of the following values:
  *         @arg @ref LL_ADC_IN_SINGLE_ENDED
  * @note   On this STM32 series, setting of this feature is conditioned to
  *         ADC state:
  *         ADC must be ADC disabled.
  */
__STATIC_INLINE void LL_ADC_SetChannelSingleDiff(ADC_TypeDef *p_adc, uint32_t channel, uint32_t input_mode)
{
  /* On this series, only mode single ended available: no configuration to perform */
  /* Prevent unused argument(s) compilation warning */
  (void)(p_adc);
  (void)(channel);
  (void)(input_mode);
}

/**
  * @brief  Get mode single-ended or differential input of the selected
  *         ADC channel.
  * @rmtoll
  *  DIFSEL   DIFSEL         LL_ADC_GetChannelSingleDiff
  * @param  p_adc Pointer to ADC instance
  * @param  channel This parameter can be a combination of the following values:
  *         @arg @ref LL_ADC_CHANNEL_0
  *         @arg @ref LL_ADC_CHANNEL_1
  *         @arg @ref LL_ADC_CHANNEL_2
  *         @arg @ref LL_ADC_CHANNEL_3
  *         @arg @ref LL_ADC_CHANNEL_4
  *         @arg @ref LL_ADC_CHANNEL_5
  *         @arg @ref LL_ADC_CHANNEL_6
  *         @arg @ref LL_ADC_CHANNEL_7
  *         @arg @ref LL_ADC_CHANNEL_8
  *         @arg @ref LL_ADC_CHANNEL_9
  *         @arg @ref LL_ADC_CHANNEL_10
  *         @arg @ref LL_ADC_CHANNEL_11
  *         @arg @ref LL_ADC_CHANNEL_12
  *         @arg @ref LL_ADC_CHANNEL_13
  * @note   In differential mode: Differential measurement is carried out
  *         between the selected channel (positive input) and
  *         another channel (negative input). Only selected channel has to be
  *         configured, the other channel is configured automatically
  *         and is not usable separately.
  * @note   Differential mode is not available on all channels.
  *         For compliant channels list, refer to reference manual.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_ADC_IN_SINGLE_ENDED
  */
__STATIC_INLINE uint32_t LL_ADC_GetChannelSingleDiff(const ADC_TypeDef *p_adc, uint32_t channel)
{
  /* On this series, only mode single ended available: no configuration to fetch */
  /* Prevent unused argument(s) compilation warning */
  (void)(p_adc);
  (void)(channel);
  return LL_ADC_IN_SINGLE_ENDED;
}

/**
  * @}
  */

/** @defgroup ADC_LL_EF_Configuration_ADC_AnalogWatchdog Configuration of ADC transversal scope: analog watchdog
  * @{
  */

/**
  * @brief  Set ADC analog watchdog monitored channels:
  *         ADC group (regular and-or injected) and channel (single, multiple or all channels).
  * @rmtoll
  *  CFGR1    AWD1CH         LL_ADC_SetAnalogWDScope\n
  *  CFGR1    AWD1SGL        LL_ADC_SetAnalogWDScope\n
  *  CFGR1    AWD1EN         LL_ADC_SetAnalogWDScope\n
  *  CFGR1    JAWD1EN        LL_ADC_SetAnalogWDScope\n
  *  AWD2CR   AWDCH          LL_ADC_SetAnalogWDScope\n
  *  AWD3CR   AWDCH          LL_ADC_SetAnalogWDScope
  * @param  p_adc Pointer to ADC instance
  * @param  awd_y AWD instance. This parameter can be one of the following values:
  *         @arg @ref LL_ADC_AWD_1
  *         @arg @ref LL_ADC_AWD_2
  *         @arg @ref LL_ADC_AWD_3
  * @param  group This parameter can be one of the following values:
  *         @arg @ref LL_ADC_GROUP_REGULAR
  *         @arg @ref LL_ADC_GROUP_INJECTED
  *         @arg @ref LL_ADC_GROUP_REGULAR_INJECTED
  *         @arg @ref LL_ADC_GROUP_NONE
  * @param  channel This parameter can be one of the following values:
  *         @arg @ref LL_ADC_CHANNEL_0
  *         @arg @ref LL_ADC_CHANNEL_1
  *         @arg @ref LL_ADC_CHANNEL_2
  *         @arg @ref LL_ADC_CHANNEL_3
  *         @arg @ref LL_ADC_CHANNEL_4
  *         @arg @ref LL_ADC_CHANNEL_5
  *         @arg @ref LL_ADC_CHANNEL_6
  *         @arg @ref LL_ADC_CHANNEL_7
  *         @arg @ref LL_ADC_CHANNEL_8
  *         @arg @ref LL_ADC_CHANNEL_9
  *         @arg @ref LL_ADC_CHANNEL_10
  *         @arg @ref LL_ADC_CHANNEL_11
  *         @arg @ref LL_ADC_CHANNEL_12
  *         @arg @ref LL_ADC_CHANNEL_13
  *         @arg @ref LL_ADC_CHANNEL_VREFINT         (1)
  *         @arg @ref LL_ADC_CHANNEL_TEMPSENSOR      (1)
  *         @arg @ref LL_ADC_CHANNEL_VDDCORE         (1)
  *         @arg @ref LL_ADC_CHANNEL_OPAMP1_OUT      (1)
  *         @arg @ref LL_ADC_CHANNEL_OPAMP2_OUT      (1)
  *         @arg @ref LL_ADC_CHANNEL_OPAMP3_OUT      (1)
  *         @arg @ref LL_ADC_CHANNEL_VREFINT_ALT     (2)
  *         @arg @ref LL_ADC_CHANNEL_VDDCORE_ALT     (2)
  *         @arg @ref LL_ADC_CHANNEL_OPAMP1_OUT_ALT  (2)
  *         @arg @ref LL_ADC_CHANNEL_OPAMP2_OUT_ALT  (2)
  *         @arg @ref LL_ADC_CHANNEL_VREFINT_ALT2    (3)
  *         @arg @ref LL_ADC_CHANNEL_VDDCORE_ALT2    (3)
  *         @arg @ref LL_ADC_CHANNEL_OPAMP3_OUT_ALT  (3)
  *
  *         (1) On this STM32 series, parameter available only on ADC instance: ADC1.\n
  *         (2) On this STM32 series, parameter available only on ADC instance: ADC2.\n
  *         (3) On this STM32 series, parameter available only on ADC instance: ADC3.\n
  * @note   Specific configurations:
  *         - to monitor all channels, use following parameters values:
  *             LL_ADC_SetAnalogWDScope(..., ..., group regular and-or injected, LL_ADC_CHANNEL_ALL)
  *         - to disable ADC analog watchdog, use following parameters values:
  *             LL_ADC_SetAnalogWDScope(..., ..., LL_ADC_GROUP_NONE, LL_ADC_CHANNEL_NONE)
  *           (parameters LL_ADC_GROUP_NONE and LL_ADC_CHANNEL_NONE must be used together, not separately)
  *         - specific case (only on analog watchdog instances: AWD2, AWD3), to monitor multiple channels
  *           use following parameters values (channels list with logical or):
  *             LL_ADC_SetAnalogWDScope(..., ..., group regular and-or injected, LL_ADC_CHANNEL_x | LL_ADC_CHANNEL_y)
  * @note   The ADC analog watchdog configuration parameters can be read back using
  *         functions @ref LL_ADC_GetAnalogWDScopeGroup and @ref LL_ADC_GetAnalogWDScopeChannel.
  * @note   Once monitored channels are selected, analog watchdog is enabled.
  * @note   On this STM32 series, there are 2 kinds of analog watchdog
  *         instance:
  *         - AWD standard (instance AWD1):
  *           - channels monitored: can monitor 1 channel or all channels.
  *           - groups monitored: ADC groups regular and-or injected.
  *         - AWD flexible (instances AWD2, AWD3):
  *           - channels monitored: flexible on channels monitored, selection is
  *             channel wise, from from 1 to all channels.
  *             Specificity of this analog watchdog: Multiple channels can
  *             be selected. For example:
  *             (LL_ADC_AWD_CHANNEL4_REG_INJ | LL_ADC_AWD_CHANNEL5_REG_INJ | ...)
  *           - groups monitored: not selection possible (monitoring on both
  *             groups regular and injected).
  *             Channels selected are monitored on groups regular and injected:
  *             LL_ADC_AWD_CHANNELxx_REG_INJ (do not use parameters
  *             LL_ADC_AWD_CHANNELxx_REG and LL_ADC_AWD_CHANNELxx_INJ)
  * @note   On this STM32 series, setting of this feature is conditioned to
  *         ADC state:
  *         ADC must be disabled or enabled without conversion ongoing
  *         on either groups regular or injected.
  */
__STATIC_INLINE void LL_ADC_SetAnalogWDScope(ADC_TypeDef *p_adc, uint32_t awd_y, uint32_t group, uint32_t channel)
{
  /* Set bits with content of parameter "group" and "channel" with bits position in register and register position
     depending on parameter "awd_y". Parameters are used with masks because containing other bits
     reserved for other purpose. */

  __IO uint32_t *preg;
  uint32_t awd_group_channel_monitored;
  const uint32_t channel_ll = LL_ADC_REMAP_CHANNEL_INTERNAL_SET(p_adc, channel);
  const uint32_t ichannel = LL_ADC_CHANNEL_LUT_INDEX(channel_ll);

