MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_adc.h
  if (awd_y == LL_ADC_AWD_1)
  {
    /* Set pointer to register of selected analog watchdog */
    preg = LL_ADC_PTR_REG_OFFSET(p_adc->CFGR1, 0UL);

    /* Compute channel monitored as number */
    awd_group_channel_monitored = ((group << ADC_CFGR1_AWD1EN_Pos)
                                   | (LL_ADC_CHANNEL_TO_DECIMAL_NB(channel_ll) << ADC_CFGR1_AWD1CH_Pos));

    /* Case unitary channel selected (parameter "channel" values except LL_ADC_CHANNEL_ALL and LL_ADC_CHANNEL_NONE) */
    if (LL_ADC_CHANNEL_TO_DECIMAL_NB(channel_ll) < ADC_CH_NONE_NUMBER)
    {
      awd_group_channel_monitored |= ADC_CFGR1_AWD1SGL;
    }
  }
  else
  {
    /* Set pointer to register of selected analog watchdog */
    preg = LL_ADC_PTR_REG_OFFSET(p_adc->AWD2CR,
                                 (((awd_y & LL_ADC_AWD_CRX_REGOFFSET_MASK)) >> (LL_ADC_AWD_CRX_REGOFFSET_POS)) - 1UL);

    /* Compute channel monitored as bitfield */
    awd_group_channel_monitored = (LL_ADC_CHANNEL_LUT[ichannel] & LL_ADC_CHANNEL_ID_BITFIELD_MASK);
  }

  STM32_MODIFY_REG(*preg, (awd_y & LL_ADC_AWD_CR_ALL_CHANNEL_MASK), awd_group_channel_monitored);
}

/**
  * @brief  Add ADC analog watchdog monitored channels: Channel (single, multiple or all channels).
  * @rmtoll
  *  AWD2CR   AWDCH          LL_ADC_SetAnalogWDChannelAdd\n
  *  AWD3CR   AWDCH          LL_ADC_SetAnalogWDChannelAdd
  * @param  p_adc Pointer to ADC instance
  * @param  awd_y AWD instance. This parameter can be one of the following values:
  *         @arg @ref LL_ADC_AWD_2
  *         @arg @ref LL_ADC_AWD_3
  * @param  channel This parameter can be one of the following values:
  *         @arg @ref LL_ADC_CHANNEL_0
  *         @arg @ref LL_ADC_CHANNEL_1
  *         @arg @ref LL_ADC_CHANNEL_2
  *         @arg @ref LL_ADC_CHANNEL_3
  *         @arg @ref LL_ADC_CHANNEL_4
  *         @arg @ref LL_ADC_CHANNEL_5
  *         @arg @ref LL_ADC_CHANNEL_6
  *         @arg @ref LL_ADC_CHANNEL_7
  *         @arg @ref LL_ADC_CHANNEL_8
  *         @arg @ref LL_ADC_CHANNEL_9
  *         @arg @ref LL_ADC_CHANNEL_10
  *         @arg @ref LL_ADC_CHANNEL_11
  *         @arg @ref LL_ADC_CHANNEL_12
  *         @arg @ref LL_ADC_CHANNEL_13
  *         @arg @ref LL_ADC_CHANNEL_VREFINT         (1)
  *         @arg @ref LL_ADC_CHANNEL_TEMPSENSOR      (1)
  *         @arg @ref LL_ADC_CHANNEL_VDDCORE         (1)
  *         @arg @ref LL_ADC_CHANNEL_OPAMP1_OUT      (1)
  *         @arg @ref LL_ADC_CHANNEL_OPAMP2_OUT      (1)
  *         @arg @ref LL_ADC_CHANNEL_OPAMP3_OUT      (1)
  *         @arg @ref LL_ADC_CHANNEL_VREFINT_ALT     (2)
  *         @arg @ref LL_ADC_CHANNEL_VDDCORE_ALT     (2)
  *         @arg @ref LL_ADC_CHANNEL_OPAMP1_OUT_ALT  (2)
  *         @arg @ref LL_ADC_CHANNEL_OPAMP2_OUT_ALT  (2)
  *         @arg @ref LL_ADC_CHANNEL_VREFINT_ALT2    (3)
  *         @arg @ref LL_ADC_CHANNEL_VDDCORE_ALT2    (3)
  *         @arg @ref LL_ADC_CHANNEL_OPAMP3_OUT_ALT  (3)
  *
  *         (1) On this STM32 series, parameter available only on ADC instance: ADC1.\n
  *         (2) On this STM32 series, parameter available only on ADC instance: ADC2.\n
  *         (3) On this STM32 series, parameter available only on ADC instance: ADC3.\n
  * @note   The ADC analog watchdog configuration parameters can be read back using
  *         functions @ref LL_ADC_GetAnalogWDScopeGroup, @ref LL_ADC_GetAnalogWDScopeChannel
  *         and @ref LL_ADC_IsAnalogWDChannelMonitored
  * @note   This function is Specific to AWD2, AWD3.
  *         AWD1 does not support multichannel selection.
  * @note   On this STM32 series, setting of this feature is conditioned to
  *         ADC state:
  *         ADC must be disabled or enabled without conversion ongoing
  *         on either groups regular or injected.
  */
__STATIC_INLINE void LL_ADC_SetAnalogWDChannelAdd(ADC_TypeDef *p_adc, uint32_t awd_y, uint32_t channel)
{
  /* Set bits with content of parameters "group" and "channel" with bits       */
  /* position in register and register position depending on parameter "awd_y".*/
  /* Parameters are used with masks because containing other bits reserved     */
  /* for other purpose.                                                        */

  __IO uint32_t *preg;
  uint32_t awd_group_channel_monitored;
  const uint32_t channel_ll = LL_ADC_REMAP_CHANNEL_INTERNAL_SET(p_adc, channel);
  const uint32_t ichannel = LL_ADC_CHANNEL_LUT_INDEX(channel_ll);

  if (awd_y == LL_ADC_AWD_1)
  {
    /* Nothing to do : AWD1 not supported */
  }
  else
  {
    /* Set pointer to register of selected analog watchdog */
    preg = LL_ADC_PTR_REG_OFFSET(p_adc->AWD2CR,
                                 (((awd_y & LL_ADC_AWD_CRX_REGOFFSET_MASK)) >> (LL_ADC_AWD_CRX_REGOFFSET_POS)) - 1UL);

    if (channel_ll == LL_ADC_CHANNEL_ALL)
    {
      awd_group_channel_monitored = LL_ADC_CHANNEL_ALL_BITFIELD;
    }
    else if (channel_ll == LL_ADC_CHANNEL_NONE)
    {
      awd_group_channel_monitored = 0;
    }
    else
    {
      /* Compute channel monitored as bitfield */
      awd_group_channel_monitored = (LL_ADC_CHANNEL_LUT[ichannel] & LL_ADC_CHANNEL_ID_BITFIELD_MASK);
    }

    STM32_SET_BIT(*preg, awd_group_channel_monitored);
  }
}

/**
  * @brief  Remove ADC analog watchdog monitored channels: Channel (single, multiple or all channels).
  * @rmtoll
  *  AWD2CR   AWDCH          LL_ADC_SetAnalogWDChannelRem\n
  *  AWD3CR   AWDCH          LL_ADC_SetAnalogWDChannelRem
  * @param  p_adc Pointer to ADC instance
  * @param  awd_y AWD instance. This parameter can be one of the following values:
  *         @arg @ref LL_ADC_AWD_2
  *         @arg @ref LL_ADC_AWD_3
  * @param  channel This parameter can be one of the following values:
  *         @arg @ref LL_ADC_CHANNEL_0
  *         @arg @ref LL_ADC_CHANNEL_1
  *         @arg @ref LL_ADC_CHANNEL_2
  *         @arg @ref LL_ADC_CHANNEL_3
  *         @arg @ref LL_ADC_CHANNEL_4
  *         @arg @ref LL_ADC_CHANNEL_5
  *         @arg @ref LL_ADC_CHANNEL_6
  *         @arg @ref LL_ADC_CHANNEL_7
  *         @arg @ref LL_ADC_CHANNEL_8
  *         @arg @ref LL_ADC_CHANNEL_9
  *         @arg @ref LL_ADC_CHANNEL_10
  *         @arg @ref LL_ADC_CHANNEL_11
  *         @arg @ref LL_ADC_CHANNEL_12
  *         @arg @ref LL_ADC_CHANNEL_13
  *         @arg @ref LL_ADC_CHANNEL_VREFINT         (1)
  *         @arg @ref LL_ADC_CHANNEL_TEMPSENSOR      (1)
  *         @arg @ref LL_ADC_CHANNEL_VDDCORE         (1)
  *         @arg @ref LL_ADC_CHANNEL_OPAMP1_OUT      (1)
  *         @arg @ref LL_ADC_CHANNEL_OPAMP2_OUT      (1)
  *         @arg @ref LL_ADC_CHANNEL_OPAMP3_OUT      (1)
  *         @arg @ref LL_ADC_CHANNEL_VREFINT_ALT     (2)
  *         @arg @ref LL_ADC_CHANNEL_VDDCORE_ALT     (2)
  *         @arg @ref LL_ADC_CHANNEL_OPAMP1_OUT_ALT  (2)
  *         @arg @ref LL_ADC_CHANNEL_OPAMP2_OUT_ALT  (2)
  *         @arg @ref LL_ADC_CHANNEL_VREFINT_ALT2    (3)
  *         @arg @ref LL_ADC_CHANNEL_VDDCORE_ALT2    (3)
  *         @arg @ref LL_ADC_CHANNEL_OPAMP3_OUT_ALT  (3)
  *
  *         (1) On this STM32 series, parameter available only on ADC instance: ADC1.\n
  *         (2) On this STM32 series, parameter available only on ADC instance: ADC2.\n
  *         (3) On this STM32 series, parameter available only on ADC instance: ADC3.\n
  * @note   The ADC analog watchdog configuration parameters can be read back using
  *         functions @ref LL_ADC_GetAnalogWDScopeGroup, @ref LL_ADC_GetAnalogWDScopeChannel
  *         and @ref LL_ADC_IsAnalogWDChannelMonitored
  * @note   This function is Specific to AWD2, AWD3.
  *         AWD1 does not support multichannel selection.
  * @note   On this STM32 series, setting of this feature is conditioned to
  *         ADC state:
  *         ADC must be disabled or enabled without conversion ongoing
  *         on either groups regular or injected.
  */
__STATIC_INLINE void LL_ADC_SetAnalogWDChannelRem(ADC_TypeDef *p_adc, uint32_t awd_y, uint32_t channel)
{
  /* Set bits with content of parameters "group" and "channel" with bits      */
  /* position in register and register position depending on parameter "awd_y".*/
  /* Parameters are used with masks because containing other bits reserved    */
  /* for other purpose.                                                       */

  __IO uint32_t *preg;
  uint32_t awd_group_channel_monitored;
  const uint32_t channel_ll = LL_ADC_REMAP_CHANNEL_INTERNAL_SET(p_adc, channel);
  const uint32_t ichannel = LL_ADC_CHANNEL_LUT_INDEX(channel_ll);

