MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_adc.h
  if (awd_y == LL_ADC_AWD_1)
  {
    /* Nothing to do : AWD1 not supported */
  }
  else
  {
    /* Set pointer to register of selected analog watchdog */
    preg = LL_ADC_PTR_REG_OFFSET(p_adc->AWD2CR,
                                 (((awd_y & LL_ADC_AWD_CRX_REGOFFSET_MASK)) >> (LL_ADC_AWD_CRX_REGOFFSET_POS)) - 1UL);

    if (channel_ll == LL_ADC_CHANNEL_ALL)
    {
      awd_group_channel_monitored = LL_ADC_CHANNEL_ALL_BITFIELD;
    }
    else if (channel_ll == LL_ADC_CHANNEL_NONE)
    {
      awd_group_channel_monitored = 0;
    }
    else
    {
      /* Compute channel monitored as bitfield */
      awd_group_channel_monitored = (LL_ADC_CHANNEL_LUT[ichannel] & LL_ADC_CHANNEL_ID_BITFIELD_MASK);
    }

    STM32_CLEAR_BIT(*preg, awd_group_channel_monitored);
  }
}

/**
  * @brief  Get ADC analog watchdog monitored channels:
  *         ADC group (regular and-or injected).
  * @rmtoll
  *  CFGR1    AWD1CH         LL_ADC_GetAnalogWDScopeGroup\n
  *  CFGR1    AWD1SGL        LL_ADC_GetAnalogWDScopeGroup\n
  *  CFGR1    AWD1EN         LL_ADC_GetAnalogWDScopeGroup\n
  *  CFGR1    JAWD1EN        LL_ADC_GetAnalogWDScopeGroup\n
  *  AWD2CR   AWDCH          LL_ADC_GetAnalogWDScopeGroup\n
  *  AWD3CR   AWDCH          LL_ADC_GetAnalogWDScopeGroup
  * @param  p_adc Pointer to ADC instance
  * @param  awd_y AWD instance. This parameter can be one of the following values:
  *         @arg @ref LL_ADC_AWD_1
  *         @arg @ref LL_ADC_AWD_2
  *         @arg @ref LL_ADC_AWD_3
  * @note   Configuration done by @ref LL_ADC_SetAnalogWDScope(), refer to description of this function for more details
  *         on parameters.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_ADC_GROUP_REGULAR
  *         @arg @ref LL_ADC_GROUP_INJECTED
  *         @arg @ref LL_ADC_GROUP_REGULAR_INJECTED
  *         @arg @ref LL_ADC_GROUP_NONE
  */
__STATIC_INLINE uint32_t LL_ADC_GetAnalogWDScopeGroup(ADC_TypeDef *p_adc, uint32_t awd_y)
{
  const __IO uint32_t *preg;
  uint32_t awd_group_monitored;

  if (awd_y == LL_ADC_AWD_1)
  {
    /* Set pointer to register of selected analog watchdog */
    preg = LL_ADC_PTR_REG_OFFSET(p_adc->CFGR1, 0UL);
  }
  else
  {
    /* Set pointer to register of selected analog watchdog */
    preg = LL_ADC_PTR_REG_OFFSET(p_adc->AWD2CR,
                                 (((awd_y & LL_ADC_AWD_CRX_REGOFFSET_MASK)) >> (LL_ADC_AWD_CRX_REGOFFSET_POS)) - 1UL);
  }

  awd_group_monitored = STM32_READ_BIT(*preg, awd_y) & awd_y;

  if (awd_y == LL_ADC_AWD_1)
  {
    awd_group_monitored = ((awd_group_monitored & (ADC_CFGR1_JAWD1EN | ADC_CFGR1_AWD1EN)) >> ADC_CFGR1_AWD1EN_Pos);
  }
  else
  {
    if (awd_group_monitored != LL_ADC_GROUP_NONE)
    {
      awd_group_monitored = LL_ADC_GROUP_REGULAR_INJECTED;
    }
  }

  return awd_group_monitored;
}

/**
  * @brief  Get ADC analog watchdog monitored channels:
  *         ADC channel (single, multiple or all channels).
  * @rmtoll
  *  CFGR1    AWD1CH         LL_ADC_GetAnalogWDScopeChannel\n
  *  CFGR1    AWD1SGL        LL_ADC_GetAnalogWDScopeChannel\n
  *  CFGR1    AWD1EN         LL_ADC_GetAnalogWDScopeChannel\n
  *  CFGR1    JAWD1EN        LL_ADC_GetAnalogWDScopeChannel\n
  *  AWD2CR   AWDCH          LL_ADC_GetAnalogWDScopeChannel\n
  *  AWD3CR   AWDCH          LL_ADC_GetAnalogWDScopeChannel
  * @param  p_adc Pointer to ADC instance
  * @param  awd_y AWD instance. This parameter can be one of the following values:
  *         @arg @ref LL_ADC_AWD_1
  *         @arg @ref LL_ADC_AWD_2
  *         @arg @ref LL_ADC_AWD_3
  * @note   Configuration done by @ref LL_ADC_SetAnalogWDScope(), refer to description of this function for more details
  *         on parameters.
  * @note   This function does not support specific case of multiple channels monitored (only on
  *         analog watchdog instances: AWD2, AWD3).
  *         In case of multiple channels monitored, return value of this function is not relevant,
  *         use @ref LL_ADC_IsAnalogWDChannelMonitored() instead.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_ADC_CHANNEL_0
  *         @arg @ref LL_ADC_CHANNEL_1
  *         @arg @ref LL_ADC_CHANNEL_2
  *         @arg @ref LL_ADC_CHANNEL_3
  *         @arg @ref LL_ADC_CHANNEL_4
  *         @arg @ref LL_ADC_CHANNEL_5
  *         @arg @ref LL_ADC_CHANNEL_6
  *         @arg @ref LL_ADC_CHANNEL_7
  *         @arg @ref LL_ADC_CHANNEL_8
  *         @arg @ref LL_ADC_CHANNEL_9
  *         @arg @ref LL_ADC_CHANNEL_10
  *         @arg @ref LL_ADC_CHANNEL_11
  *         @arg @ref LL_ADC_CHANNEL_12
  *         @arg @ref LL_ADC_CHANNEL_13
  *         @arg @ref LL_ADC_CHANNEL_VREFINT         (1)(5)
  *         @arg @ref LL_ADC_CHANNEL_TEMPSENSOR      (1)(5)
  *         @arg @ref LL_ADC_CHANNEL_VDDCORE         (1)(5)
  *         @arg @ref LL_ADC_CHANNEL_OPAMP1_OUT      (1)(5)
  *         @arg @ref LL_ADC_CHANNEL_OPAMP2_OUT      (1)(5)
  *         @arg @ref LL_ADC_CHANNEL_OPAMP3_OUT      (1)(5)
  *         @arg @ref LL_ADC_CHANNEL_VREFINT_ALT     (2)(5)
  *         @arg @ref LL_ADC_CHANNEL_VDDCORE_ALT     (2)(5)
  *         @arg @ref LL_ADC_CHANNEL_OPAMP1_OUT_ALT  (2)(5)
  *         @arg @ref LL_ADC_CHANNEL_OPAMP2_OUT_ALT  (2)(5)
  *         @arg @ref LL_ADC_CHANNEL_VREFINT_ALT2    (3)(5)
  *         @arg @ref LL_ADC_CHANNEL_VDDCORE_ALT2    (3)(5)
  *         @arg @ref LL_ADC_CHANNEL_OPAMP3_OUT_ALT  (3)(5)
  *
  *         (1) On this STM32 series, parameter available only on ADC instance: ADC1.\n
  *         (2) On this STM32 series, parameter available only on ADC instance: ADC2.\n
  *         (3) On this STM32 series, parameter available only on ADC instance: ADC3.\n
  *         (5) For ADC channel read back from ADC register,
  *             comparison with internal channel parameter to be done
  *             using helper macro @ref LL_ADC_CHANNEL_INTERNAL_TO_EXTERNAL().
  *
  */
__STATIC_INLINE uint32_t LL_ADC_GetAnalogWDScopeChannel(const ADC_TypeDef *p_adc, uint32_t awd_y)
{
  const __IO uint32_t *preg;
  uint32_t awd_channel_monitored;

