MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_adc.h
  if (awd_y == LL_ADC_AWD_1)
  {
    /* Set pointer to register of selected analog watchdog */
    preg = LL_ADC_PTR_REG_OFFSET(p_adc->CFGR1, 0UL);
  }
  else
  {
    /* Set pointer to register of selected analog watchdog */
    preg = LL_ADC_PTR_REG_OFFSET(p_adc->AWD2CR,
                                 (((awd_y & LL_ADC_AWD_CRX_REGOFFSET_MASK)) >> (LL_ADC_AWD_CRX_REGOFFSET_POS)) - 1UL);
  }

  awd_channel_monitored = STM32_READ_BIT(*preg, awd_y) & awd_y;

  if (awd_y == LL_ADC_AWD_1)
  {
    if ((awd_channel_monitored & (ADC_CFGR1_JAWD1EN | ADC_CFGR1_AWD1EN)) == 0UL)
    {
      /* Case analog watchdog disabled (no channel) */
      awd_channel_monitored = LL_ADC_CHANNEL_NONE;
    }
    else if ((awd_channel_monitored & ADC_CFGR1_AWD1SGL) == 0UL)
    {
      /* Case all channels */
      awd_channel_monitored = LL_ADC_CHANNEL_ALL;
    }
    else
    {
      /* Case unitary channel */
      awd_channel_monitored = (awd_channel_monitored & ADC_CFGR1_AWD1CH) >> ADC_CFGR1_AWD1CH_Pos;
    }
  }
  else
  {
    if ((awd_channel_monitored & ADC_AWD2CR_AWDCH) == 0UL)
    {
      awd_channel_monitored = LL_ADC_CHANNEL_NONE;
    }
    else if ((awd_channel_monitored & ADC_AWD2CR_AWDCH) == ADC_AWD2CR_AWDCH)
    {
      /* Case all channels */
      awd_channel_monitored = LL_ADC_CHANNEL_ALL;
    }
    else
    {
      /* In case of multiple channel return value of first monitored channel */
      awd_channel_monitored = STM32_POSITION_VAL(awd_channel_monitored);
    }
  }

  return awd_channel_monitored;
}

/**
  * @brief  Check if ADC analog watchdog is monitoring a channel.
  * @rmtoll
  *  CFGR1    AWD1CH         LL_ADC_IsAnalogWDChannelMonitored\n
  *  CFGR1    AWD1SGL        LL_ADC_IsAnalogWDChannelMonitored\n
  *  CFGR1    AWD1EN         LL_ADC_IsAnalogWDChannelMonitored\n
  *  CFGR1    JAWD1EN        LL_ADC_IsAnalogWDChannelMonitored\n
  *  AWD2CR   AWDCH          LL_ADC_IsAnalogWDChannelMonitored\n
  *  AWD3CR   AWDCH          LL_ADC_IsAnalogWDChannelMonitored
  * @param  p_adc Pointer to ADC instance
  * @param  awd_y AWD instance. This parameter can be one of the following values:
  *         @arg @ref LL_ADC_AWD_1
  *         @arg @ref LL_ADC_AWD_2
  *         @arg @ref LL_ADC_AWD_3
  * @param  channel This parameter can be one of the following values:
  *         @arg @ref LL_ADC_CHANNEL_0
  *         @arg @ref LL_ADC_CHANNEL_1
  *         @arg @ref LL_ADC_CHANNEL_2
  *         @arg @ref LL_ADC_CHANNEL_3
  *         @arg @ref LL_ADC_CHANNEL_4
  *         @arg @ref LL_ADC_CHANNEL_5
  *         @arg @ref LL_ADC_CHANNEL_6
  *         @arg @ref LL_ADC_CHANNEL_7
  *         @arg @ref LL_ADC_CHANNEL_8
  *         @arg @ref LL_ADC_CHANNEL_9
  *         @arg @ref LL_ADC_CHANNEL_10
  *         @arg @ref LL_ADC_CHANNEL_11
  *         @arg @ref LL_ADC_CHANNEL_12
  *         @arg @ref LL_ADC_CHANNEL_13
  *         @arg @ref LL_ADC_CHANNEL_VREFINT         (1)
  *         @arg @ref LL_ADC_CHANNEL_TEMPSENSOR      (1)
  *         @arg @ref LL_ADC_CHANNEL_VDDCORE         (1)
  *         @arg @ref LL_ADC_CHANNEL_OPAMP1_OUT      (1)
  *         @arg @ref LL_ADC_CHANNEL_OPAMP2_OUT      (1)
  *         @arg @ref LL_ADC_CHANNEL_OPAMP3_OUT      (1)
  *         @arg @ref LL_ADC_CHANNEL_VREFINT_ALT     (2)
  *         @arg @ref LL_ADC_CHANNEL_VDDCORE_ALT     (2)
  *         @arg @ref LL_ADC_CHANNEL_OPAMP1_OUT_ALT  (2)
  *         @arg @ref LL_ADC_CHANNEL_OPAMP2_OUT_ALT  (2)
  *         @arg @ref LL_ADC_CHANNEL_VREFINT_ALT2    (3)
  *         @arg @ref LL_ADC_CHANNEL_VDDCORE_ALT2    (3)
  *         @arg @ref LL_ADC_CHANNEL_OPAMP3_OUT_ALT  (3)
  *
  *         (1) On this STM32 series, parameter available only on ADC instance: ADC1.\n
  *         (2) On this STM32 series, parameter available only on ADC instance: ADC2.\n
  *         (3) On this STM32 series, parameter available only on ADC instance: ADC3.\n
  * @note   Configuration done by @ref LL_ADC_SetAnalogWDScope(), refer to description of this function for more details
  *         on parameters.
  * @retval 0: channel is not monitored by analog watchdog, 1: channel is monitored by analog watchdog
  */
__STATIC_INLINE uint32_t LL_ADC_IsAnalogWDChannelMonitored(ADC_TypeDef *p_adc, uint32_t awd_y, uint32_t channel)
{
  const __IO uint32_t *preg;
  uint32_t awd_channel_monitored;
  uint32_t is_monitored;

  const uint32_t channel_ll = LL_ADC_REMAP_CHANNEL_INTERNAL_SET(p_adc, channel);

  /* Set pointer to register of selected analog watchdog */
  if (awd_y == LL_ADC_AWD_1)
  {
    preg = LL_ADC_PTR_REG_OFFSET(p_adc->CFGR1, 0UL);
  }
  else
  {
    preg = LL_ADC_PTR_REG_OFFSET(p_adc->AWD2CR,
                                 (((awd_y & LL_ADC_AWD_CRX_REGOFFSET_MASK)) >> (LL_ADC_AWD_CRX_REGOFFSET_POS)) - 1UL);
  }

  awd_channel_monitored = STM32_READ_BIT(*preg, awd_y);

  if (awd_y == LL_ADC_AWD_1)
  {
    if (channel_ll == LL_ADC_CHANNEL_NONE)
    {
      is_monitored = ((awd_channel_monitored & (ADC_CFGR1_JAWD1EN | ADC_CFGR1_AWD1EN)) == 0UL) ? 1UL : 0UL;
    }
    else if (channel_ll == LL_ADC_CHANNEL_ALL)
    {
      is_monitored = ((awd_channel_monitored & ADC_CFGR1_AWD1SGL) == 0UL) ? 1UL : 0UL;
    }
    else
    {
      /* Case of single channel */
      is_monitored = (((awd_channel_monitored & ADC_CFGR1_AWD1CH)
                       == (LL_ADC_CHANNEL_TO_DECIMAL_NB(channel_ll) << ADC_CFGR1_AWD1CH_Pos))) ? 1UL : 0UL;
    }
  }
  else
  {
    if (channel_ll == LL_ADC_CHANNEL_NONE)
    {
      is_monitored = (awd_channel_monitored == 0UL) ? 1UL : 0UL;
    }
    else if (channel_ll == LL_ADC_CHANNEL_ALL)
    {
      is_monitored = ((awd_channel_monitored & ADC_AWD2CR_AWDCH) == ADC_AWD2CR_AWDCH) ? 1UL : 0UL;
    }
    else
    {
      is_monitored = ((awd_channel_monitored & (0x1UL << LL_ADC_CHANNEL_TO_DECIMAL_NB(channel_ll))) != 0UL) ? 1UL : 0UL;
    }
  }

  return is_monitored;
}

/**
  * @brief  Set ADC analog watchdog threshold value of threshold
  *         high or low.
  * @rmtoll
  *  AWD1LTR  LTR            LL_ADC_SetAnalogWDThresholds\n
  *  AWD1HTR  HTR            LL_ADC_SetAnalogWDThresholds\n
  *  AWD2LTR  LTR            LL_ADC_SetAnalogWDThresholds\n
  *  AWD2HTR  HTR            LL_ADC_SetAnalogWDThresholds\n
  *  AWD3LTR  LTR            LL_ADC_SetAnalogWDThresholds\n
  *  AWD3HTR  HTR            LL_ADC_SetAnalogWDThresholds
  * @param  p_adc Pointer to ADC instance
  * @param  awd_y AWD instance. This parameter can be one of the following values:
  *         @arg @ref LL_ADC_AWD_1
  *         @arg @ref LL_ADC_AWD_2
  *         @arg @ref LL_ADC_AWD_3
  * @param  awd_thresholds_high_low This parameter can be one of the following values:
  *         @arg @ref LL_ADC_AWD_THRESHOLD_HIGH
  *         @arg @ref LL_ADC_AWD_THRESHOLD_LOW
  * @param  awd_threshold_value Analog watchdog threshold value. Value is signed and can exceed ADC resolution
  *         with post-processing computation (offset, oversampling, data shift, ...).
  *         Value between Min_Data=-4194304 (two's complement 0xFFC00000) and Max_Data=+4194303 (0x003FFFFF)
  * @note   In case of ADC resolution different of 12 bits,
  *         analog watchdog thresholds data require a specific shift.
  *         Use helper macro @ref LL_ADC_ANALOGWD_SET_THRESHOLD_RES().
  * @note   On this STM32 series, there are 2 kinds of analog watchdog
  *         instance:
  *         - AWD standard (instance AWD1):
  *           - channels monitored: can monitor 1 channel or all channels.
  *           - groups monitored: ADC groups regular and-or injected.
  *         - AWD flexible (instances AWD2, AWD3):
  *           - channels monitored: flexible on channels monitored, selection is
  *             channel wise, from from 1 to all channels.
  *             Specificity of this analog watchdog: Multiple channels can
  *             be selected. For example:
  *             (LL_ADC_AWD_CHANNEL4_REG_INJ | LL_ADC_AWD_CHANNEL5_REG_INJ | ...)
  *           - groups monitored: not selection possible (monitoring on both
  *             groups regular and injected).
  *             Channels selected are monitored on groups regular and injected:
  *             LL_ADC_AWD_CHANNELxx_REG_INJ (do not use parameters
  *             LL_ADC_AWD_CHANNELxx_REG and LL_ADC_AWD_CHANNELxx_INJ)
  * @note   If ADC oversampling is enabled, ADC analog watchdog thresholds are
  *         impacted: the comparison of analog watchdog thresholds is done
  *         on oversampling intermediate computation (after ratio, before shift
  *         application): intermediate register bitfield [32:7]
  *         (26 most significant bits).
  * @note   On this STM32 series, setting of this feature is conditioned to
  *         ADC state:
  *         ADC must be disabled or enabled without conversion ongoing
  *         on either ADC groups regular or injected.
  */
__STATIC_INLINE void LL_ADC_SetAnalogWDThresholds(ADC_TypeDef *p_adc, uint32_t awd_y, uint32_t awd_thresholds_high_low,
                                                  int32_t awd_threshold_value)
{
  __IO uint32_t *preg;

  /* Set bits with content of parameter "awd_threshold_value" with bits       */
  /* position in register and register position depending on parameters       */
  /* "awd_thresholds_high_low" and "awd_y".                                   */
  /* Parameters "awd_y" and "awd_threshold_value" are used with masks because */
  /* containing other bits reserved for other purpose.                        */
  if (awd_y == LL_ADC_AWD_1)
  {
    preg = LL_ADC_PTR_REG_OFFSET(p_adc->AWD1LTR, (awd_thresholds_high_low));
  }
  else
  {
    preg = LL_ADC_PTR_REG_OFFSET(p_adc->AWD1LTR,
                                 (((awd_y & LL_ADC_AWD_TRX_REGOFFSET_MASK) >> LL_ADC_AWD_TRX_REGOFFSET_POS) * 2UL)
                                 + (awd_thresholds_high_low));
  }

