MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_adc.h
  /* Mask with ADC_LTR_LT for case of negative value, to exclude two's complement exceeding "1" left bits */
  STM32_MODIFY_REG(*preg, ADC_AWD1LTR_LTR, ((uint32_t)awd_threshold_value & ADC_AWD1LTR_LTR));
}

/**
  * @brief  Get ADC analog watchdog threshold value of threshold high,
  *         threshold low or raw data with ADC thresholds high and low
  *         concatenated.
  * @rmtoll
  *  AWD1LTR  LTR            LL_ADC_GetAnalogWDThresholds\n
  *  AWD1HTR  HTR            LL_ADC_GetAnalogWDThresholds\n
  *  AWD2LTR  LTR            LL_ADC_GetAnalogWDThresholds\n
  *  AWD2HTR  HTR            LL_ADC_GetAnalogWDThresholds\n
  *  AWD3LTR  LTR            LL_ADC_GetAnalogWDThresholds\n
  *  AWD3HTR  HTR            LL_ADC_GetAnalogWDThresholds
  * @param  p_adc Pointer to ADC instance
  * @param  awd_y AWD instance. This parameter can be one of the following values:
  *         @arg @ref LL_ADC_AWD_1
  *         @arg @ref LL_ADC_AWD_2
  *         @arg @ref LL_ADC_AWD_3
  * @param  awd_thresholds_high_low This parameter can be one of the following values:
  *         @arg @ref LL_ADC_AWD_THRESHOLD_HIGH
  *         @arg @ref LL_ADC_AWD_THRESHOLD_LOW
  * @note   In case of ADC resolution different of 12 bits,
  *         analog watchdog thresholds data require a specific shift.
  *         Use helper macro @ref LL_ADC_ANALOGWD_GET_THRESHOLD_RES().
  * @retval Value between Min_Data=0x000 and Max_Data=0xFFF
  */
__STATIC_INLINE int32_t LL_ADC_GetAnalogWDThresholds(const ADC_TypeDef *p_adc,
                                                     uint32_t awd_y, uint32_t awd_thresholds_high_low)
{
  const __IO uint32_t *preg;
  uint32_t threshold_raw;

  if (awd_y == LL_ADC_AWD_1)
  {
    preg = LL_ADC_PTR_REG_OFFSET(p_adc->AWD1LTR, (awd_thresholds_high_low));
  }
  else
  {
    preg = LL_ADC_PTR_REG_OFFSET(p_adc->AWD1LTR,
                                 (((awd_y & LL_ADC_AWD_TRX_REGOFFSET_MASK) >> LL_ADC_AWD_TRX_REGOFFSET_POS) * 2UL)
                                 + (awd_thresholds_high_low));
  }

  threshold_raw = STM32_READ_BIT(*preg, ADC_AWD1LTR_LTR);
  /* In case of negative number (identified by bitfield MSB (bit 22)): update threshold value to negative
     value on 32 bits */
  if ((threshold_raw & (1UL << 22U)) != 0UL)
  {
    threshold_raw |= ~ADC_AWD1LTR_LTR;
  }

  return (int32_t)threshold_raw;
}

/**
  * @brief  Set ADC analog watchdog thresholds value of both thresholds
  *         high and low.
  * @rmtoll
  *  TR1      HT1            LL_ADC_ConfigAnalogWDThresholds\n
  *  TR2      HT2            LL_ADC_ConfigAnalogWDThresholds\n
  *  TR3      HT3            LL_ADC_ConfigAnalogWDThresholds\n
  *  TR1      LT1            LL_ADC_ConfigAnalogWDThresholds\n
  *  TR2      LT2            LL_ADC_ConfigAnalogWDThresholds\n
  *  TR3      LT3            LL_ADC_ConfigAnalogWDThresholds
  * @param  p_adc Pointer to ADC instance
  * @param  awd_y AWD instance. This parameter can be one of the following values:
  *         @arg @ref LL_ADC_AWD_1
  *         @arg @ref LL_ADC_AWD_2
  *         @arg @ref LL_ADC_AWD_3
  * @param  awd_threshold_high_value Analog watchdog threshold high value. Value is signed and can exceed ADC resolution
  *         with post-processing computation (offset, oversampling, data shift, ...).
  *         Value between Min_Data=-4194304 (two's complement 0xFFC00000) and Max_Data=+4194303 (0x003FFFFF)
  * @param  awd_threshold_low_value Analog watchdog threshold low value. Value is signed and can exceed ADC resolution
  *         with post-processing computation (offset, oversampling, data shift, ...).
  *         Value between Min_Data=-4194304 (two's complement 0xFFC00000) and Max_Data=+4194303 (0x003FFFFF)
  * @note   If value of only one threshold high or low must be set,
  *         use function @ref LL_ADC_SetAnalogWDThresholds().
  * @note   In case of ADC resolution different of 12 bits,
  *         analog watchdog thresholds data require a specific shift.
  *         Use helper macro @ref LL_ADC_ANALOGWD_SET_THRESHOLD_RES().
  * @note   On this STM32 series, there are 2 kinds of analog watchdog
  *         instance:
  *         - AWD standard (instance AWD1):
  *           - channels monitored: can monitor 1 channel or all channels.
  *           - groups monitored: ADC group regular.
  *           - resolution: resolution is not limited (corresponds to
  *             ADC resolution configured).
  *         - AWD flexible (instances AWD2, AWD3):
  *           - channels monitored: flexible on channels monitored, selection is
  *             channel wise, from 1 to all channels.
  *             Specificity of this analog watchdog: Multiple channels can
  *             be selected. For example:
  *             (LL_ADC_AWD_CHANNEL4_REG_INJ | LL_ADC_AWD_CHANNEL5_REG_INJ | ...)
  *           - groups monitored: not selection possible (monitoring on both
  *             groups regular and injected).
  *             Channels selected are monitored on groups regular and injected:
  *             LL_ADC_AWD_CHANNELxx_REG_INJ (do not use parameters
  *             LL_ADC_AWD_CHANNELxx_REG and LL_ADC_AWD_CHANNELxx_INJ)
  *           - resolution: resolution is not limited (corresponds to
  *             ADC resolution configured).
  * @note   If ADC oversampling is enabled, ADC analog watchdog thresholds are
  *         impacted: the comparison of analog watchdog thresholds is done on
  *         oversampling final computation (after ratio and shift application):
  *         ADC data register bitfield [15:4] (12 most significant bits).
  *         Examples:
  *         - Oversampling ratio and shift selected to have ADC conversion data
  *           on 12 bits (ratio 16 and shift 4, or ratio 32 and shift 5, ...):
  *           ADC analog watchdog thresholds must be divided by 16.
  *         - Oversampling ratio and shift selected to have ADC conversion data
  *           on 14 bits (ratio 16 and shift 2, or ratio 32 and shift 3, ...):
  *           ADC analog watchdog thresholds must be divided by 4.
  *         - Oversampling ratio and shift selected to have ADC conversion data
  *           on 16 bits (ratio 16 and shift none, or ratio 32 and shift 1, ...):
  *           ADC analog watchdog thresholds match directly to ADC data register.
  * @note   On this STM32 series, setting of this feature is conditioned to
  *         ADC state:
  *         ADC must be disabled or enabled without conversion ongoing
  *         on group regular.
  */
__STATIC_INLINE void LL_ADC_ConfigAnalogWDThresholds(ADC_TypeDef *p_adc, uint32_t awd_y,
                                                     uint32_t awd_threshold_high_value,
                                                     uint32_t awd_threshold_low_value)
{
  __IO uint32_t *preg;
  __IO uint32_t *preg2;
  /* Set bits with content of parameter "AWDThresholdxxxValue" with bits      */
  /* position in register and register position depending on parameter        */
  /* "awd_y".                                                                  */
  /* Parameters "awd_y" and "AWDThresholdxxxValue" are used with masks because */
  /* containing other bits reserved for other purpose.                        */
  if (awd_y == LL_ADC_AWD_1)
  {
    preg = LL_ADC_PTR_REG_OFFSET(p_adc->AWD1LTR, (LL_ADC_AWD_THRESHOLD_LOW));
    preg2 = LL_ADC_PTR_REG_OFFSET(p_adc->AWD1LTR, (LL_ADC_AWD_THRESHOLD_HIGH));
  }
  else
  {
    preg = LL_ADC_PTR_REG_OFFSET(p_adc->AWD1LTR, (((awd_y & LL_ADC_AWD_TRX_REGOFFSET_MASK) \
                                                   >> (LL_ADC_AWD_TRX_REGOFFSET_POS - 1UL)))
                                 + (LL_ADC_AWD_THRESHOLD_LOW));
    preg2 = LL_ADC_PTR_REG_OFFSET(p_adc->AWD1LTR, (((awd_y & LL_ADC_AWD_TRX_REGOFFSET_MASK) \
                                                    >> (LL_ADC_AWD_TRX_REGOFFSET_POS - 1UL)))
                                  + (LL_ADC_AWD_THRESHOLD_HIGH));
  }

  STM32_MODIFY_REG(*preg,  ADC_AWD1LTR_LTR, awd_threshold_low_value);
  STM32_MODIFY_REG(*preg2, ADC_AWD1HTR_HTR, awd_threshold_high_value);
}

/**
  * @brief  Set ADC analog watchdog filtering configuration.
  * @rmtoll
  *  AWD1HTR  AWDFILT        LL_ADC_SetAnalogWDFiltering
  * @param  p_adc Pointer to ADC instance
  * @param  awd_y AWD instance. This parameter can be one of the following values:
  *         @arg @ref LL_ADC_AWD_1
  * @param  awd_filtering This parameter can be one of the following values:
  *         @arg @ref LL_ADC_AWD_FILTERING_NONE
  *         @arg @ref LL_ADC_AWD_FILTERING_2SAMPLES
  *         @arg @ref LL_ADC_AWD_FILTERING_3SAMPLES
  *         @arg @ref LL_ADC_AWD_FILTERING_4SAMPLES
  *         @arg @ref LL_ADC_AWD_FILTERING_5SAMPLES
  *         @arg @ref LL_ADC_AWD_FILTERING_6SAMPLES
  *         @arg @ref LL_ADC_AWD_FILTERING_7SAMPLES
  *         @arg @ref LL_ADC_AWD_FILTERING_8SAMPLES
  * @note   On this STM32 series, setting of this feature is conditioned to
  *         ADC state:
  *         ADC must be disabled or enabled without conversion ongoing
  *         on either groups regular or injected.
  *  @note  On this STM32 series, this feature is only available on first
  *         analog watchdog (AWD1)
  */
__STATIC_INLINE void LL_ADC_SetAnalogWDFiltering(ADC_TypeDef *p_adc, uint32_t awd_y, uint32_t awd_filtering)
{
  /* Prevent unused argument(s) compilation warning */
  (void)(awd_y);
  STM32_MODIFY_REG(p_adc->AWD1HTR, ADC_AWD1HTR_AWDFILT, awd_filtering);
}

/**
  * @brief  Get ADC analog watchdog filtering configuration.
  * @rmtoll
  *  TR1      AWDFILT        LL_ADC_GetAnalogWDFiltering
  * @param  p_adc Pointer to ADC instance
  * @param  awd_y AWD instance. This parameter can be one of the following values:
  *         @arg @ref LL_ADC_AWD_1
  * @note   On this STM32 series, this feature is only available on first
  *         analog watchdog (AWD1).
  * @retval Returned value can be:
  *         @arg @ref LL_ADC_AWD_FILTERING_NONE
  *         @arg @ref LL_ADC_AWD_FILTERING_2SAMPLES
  *         @arg @ref LL_ADC_AWD_FILTERING_3SAMPLES
  *         @arg @ref LL_ADC_AWD_FILTERING_4SAMPLES
  *         @arg @ref LL_ADC_AWD_FILTERING_5SAMPLES
  *         @arg @ref LL_ADC_AWD_FILTERING_6SAMPLES
  *         @arg @ref LL_ADC_AWD_FILTERING_7SAMPLES
  *         @arg @ref LL_ADC_AWD_FILTERING_8SAMPLES
  */
__STATIC_INLINE uint32_t LL_ADC_GetAnalogWDFiltering(const ADC_TypeDef *p_adc, uint32_t awd_y)
{
  /* Prevent unused argument(s) compilation warning */
  (void)(awd_y);
  return (uint32_t)(STM32_READ_BIT(p_adc->AWD1HTR,  ADC_AWD1HTR_AWDFILT));
}

/**
  * @}
  */

