MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_adc.h
/** @defgroup ADC_LL_EF_Configuration_ADC_oversampling Configuration of ADC transversal scope: oversampling
  * @{
  */

/**
  * @brief  Set ADC oversampling scope: ADC groups regular and-or injected
  *         (availability of ADC group injected depends on STM32 series).
  * @rmtoll
  *  CFGR2    ROVSE          LL_ADC_SetOverSamplingScope\n
  *  CFGR2    ROVSM          LL_ADC_SetOverSamplingScope\n
  *  CFGR2    JOVSE          LL_ADC_SetOverSamplingScope
  * @param  p_adc Pointer to ADC instance
  * @param  ovs_scope This parameter can be one of the following values:
  *         @arg @ref LL_ADC_OVS_DISABLE
  *         @arg @ref LL_ADC_OVS_REG_CONTINUED
  *         @arg @ref LL_ADC_OVS_REG_RESUMED
  *         @arg @ref LL_ADC_OVS_INJ
  *         @arg @ref LL_ADC_OVS_INJ_REG_RESUMED
  * @note   On this STM32 series, setting of this feature is conditioned to
  *         ADC state:
  *         ADC must be disabled or enabled without conversion ongoing
  *         on either groups regular or injected.
  */
__STATIC_INLINE void LL_ADC_SetOverSamplingScope(ADC_TypeDef *p_adc, uint32_t ovs_scope)
{
  STM32_MODIFY_REG(p_adc->CFGR2, ADC_CFGR2_ROVSE | ADC_CFGR2_JOVSE | ADC_CFGR2_ROVSM, ovs_scope);
}

/**
  * @brief  Get ADC oversampling scope: ADC groups regular and-or injected
  *         (availability of ADC group injected depends on STM32 series).
  * @rmtoll
  *  CFGR2    ROVSE          LL_ADC_GetOverSamplingScope\n
  *  CFGR2    ROVSM          LL_ADC_GetOverSamplingScope\n
  *  CFGR2    JOVSE          LL_ADC_GetOverSamplingScope
  * @param  p_adc Pointer to ADC instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_ADC_OVS_DISABLE
  *         @arg @ref LL_ADC_OVS_REG_CONTINUED
  *         @arg @ref LL_ADC_OVS_REG_RESUMED
  *         @arg @ref LL_ADC_OVS_INJ
  *         @arg @ref LL_ADC_OVS_INJ_REG_RESUMED
  */
__STATIC_INLINE uint32_t LL_ADC_GetOverSamplingScope(const ADC_TypeDef *p_adc)
{
  return (uint32_t)(STM32_READ_BIT(p_adc->CFGR2, ADC_CFGR2_ROVSE | ADC_CFGR2_JOVSE | ADC_CFGR2_ROVSM));
}

/**
  * @brief  Set ADC oversampling scope: ADC groups regular and-or injected in function of oversampling instance
  *         (availability of ADC group injected depends on STM32 series).
  * @rmtoll
  *  CFGR2    ROVSE          LL_ADC_SetOverSamplingInstScope\n
  *  CFGR2    ROVSM          LL_ADC_SetOverSamplingInstScope\n
  *  CFGR2    JOVSE          LL_ADC_SetOverSamplingInstScope
  * @param  p_adc Pointer to ADC instance
  * @param  ovs_y AWD instance. This parameter can be one of the following values:
  *         @arg @ref LL_ADC_OVS_1
  * @param  ovs_scope This parameter can be one of the following values:
  *         @arg @ref LL_ADC_OVS_DISABLE
  *         @arg @ref LL_ADC_OVS_REG_CONTINUED
  *         @arg @ref LL_ADC_OVS_REG_RESUMED
  *         @arg @ref LL_ADC_OVS_INJ
  *         @arg @ref LL_ADC_OVS_INJ_REG_RESUMED
  * @note   On this STM32 series, setting of this feature is conditioned to
  *         ADC state:
  *         ADC must be disabled or enabled without conversion ongoing
  *         on either groups regular or injected.
  */
__STATIC_INLINE void LL_ADC_SetOverSamplingInstScope(ADC_TypeDef *p_adc, uint32_t ovs_y, uint32_t ovs_scope)
{
  /* Prevent unused argument(s) compilation warning */
  (void)(ovs_y);

  STM32_MODIFY_REG(p_adc->CFGR2, ADC_CFGR2_ROVSE | ADC_CFGR2_JOVSE | ADC_CFGR2_ROVSM, ovs_scope);
}

/**
  * @brief  Get ADC oversampling scope: ADC groups regular and-or injected in function of oversampling instance
  *         (availability of ADC group injected depends on STM32 series).
  * @rmtoll
  *  CFGR2    ROVSE          LL_ADC_GetOverSamplingInstScope\n
  *  CFGR2    ROVSM          LL_ADC_GetOverSamplingInstScope\n
  *  CFGR2    JOVSE          LL_ADC_GetOverSamplingInstScope
  * @param  p_adc Pointer to ADC instance
  * @param  ovs_y AWD instance. This parameter can be one of the following values:
  *         @arg @ref LL_ADC_OVS_1
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_ADC_OVS_DISABLE
  *         @arg @ref LL_ADC_OVS_REG_CONTINUED
  *         @arg @ref LL_ADC_OVS_REG_RESUMED
  *         @arg @ref LL_ADC_OVS_INJ
  *         @arg @ref LL_ADC_OVS_INJ_REG_RESUMED
  */
__STATIC_INLINE uint32_t LL_ADC_GetOverSamplingInstScope(const ADC_TypeDef *p_adc, uint32_t ovs_y)
{
  /* Prevent unused argument(s) compilation warning */
  (void)(ovs_y);

  return (uint32_t)(STM32_READ_BIT(p_adc->CFGR2, ADC_CFGR2_ROVSE | ADC_CFGR2_JOVSE | ADC_CFGR2_ROVSM));
}

/**
  * @brief  Set ADC oversampling discontinuous mode (triggered mode).
  * @rmtoll
  *  CFGR2    TROVS          LL_ADC_SetOverSamplingDiscont
  * @param  p_adc Pointer to ADC instance
  * @param  ovs_discont This parameter can be one of the following values:
  *         @arg @ref LL_ADC_OVS_CONT
  *         @arg @ref LL_ADC_OVS_DISCONT
  * @note   On this STM32 series, setting of this feature is conditioned to
  *         ADC state:
  *         ADC must be disabled or enabled without conversion ongoing
  *         on group regular.
  */
__STATIC_INLINE void LL_ADC_SetOverSamplingDiscont(ADC_TypeDef *p_adc, uint32_t ovs_discont)
{
  STM32_MODIFY_REG(p_adc->CFGR2, ADC_CFGR2_TROVS, ovs_discont);
}

/**
  * @brief  Get ADC oversampling discontinuous mode (triggered mode).
  * @rmtoll
  *  CFGR2    TROVS          LL_ADC_GetOverSamplingDiscont
  * @param  p_adc Pointer to ADC instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_ADC_OVS_CONT
  *         @arg @ref LL_ADC_OVS_DISCONT
  */
__STATIC_INLINE uint32_t LL_ADC_GetOverSamplingDiscont(const ADC_TypeDef *p_adc)
{
  return (uint32_t)(STM32_READ_BIT(p_adc->CFGR2, ADC_CFGR2_TROVS));
}

/**
  * @brief  Set ADC oversampling (impacting both ADC groups regular and injected).
  * @rmtoll
  *  CFGR2    OVSS           LL_ADC_ConfigOverSamplingRatioShift\n
  *  CFGR2    OVSR           LL_ADC_ConfigOverSamplingRatioShift
  * @param  p_adc Pointer to ADC instance
  * @param  ratio This parameter can be in the range from 1 to 1024
  * @param  shift This parameter can be one of the following values:
  *         @arg @ref LL_ADC_OVS_SHIFT_NONE
  *         @arg @ref LL_ADC_OVS_SHIFT_RIGHT_1
  *         @arg @ref LL_ADC_OVS_SHIFT_RIGHT_2
  *         @arg @ref LL_ADC_OVS_SHIFT_RIGHT_3
  *         @arg @ref LL_ADC_OVS_SHIFT_RIGHT_4
  *         @arg @ref LL_ADC_OVS_SHIFT_RIGHT_5
  *         @arg @ref LL_ADC_OVS_SHIFT_RIGHT_6
  *         @arg @ref LL_ADC_OVS_SHIFT_RIGHT_7
  *         @arg @ref LL_ADC_OVS_SHIFT_RIGHT_8
  *         @arg @ref LL_ADC_OVS_SHIFT_RIGHT_9
  *         @arg @ref LL_ADC_OVS_SHIFT_RIGHT_10
  *         or numerical value for right shift value in range from 0 to 10 (value "0" for LL_ADC_OVS_SHIFT_NONE)
  * @note   This function set the 2 items of oversampling configuration:
  *         - ratio
  *         - shift
  * @note   On this STM32 series, setting of this feature is conditioned to
  *         ADC state:
  *         ADC must be disabled or enabled without conversion ongoing
  *         on either groups regular or injected.
  */
__STATIC_INLINE void LL_ADC_ConfigOverSamplingRatioShift(ADC_TypeDef *p_adc, uint32_t ratio, uint32_t shift)
{
  STM32_MODIFY_REG(p_adc->CFGR2,
                   (ADC_CFGR2_OVSS | ADC_CFGR2_OVSR),
                   ((shift << ADC_CFGR2_OVSS_Pos) | (((ratio - 1UL) << ADC_CFGR2_OVSR_Pos))));
}

/**
  * @brief  Get ADC oversampling ratio.
  * @rmtoll
  *  CFGR2    OVSR           LL_ADC_GetOverSamplingRatio
  * @param  p_adc Pointer to ADC instance
  * @retval ovs_ratio This parameter can be a value from 1 to 1024
  */
__STATIC_INLINE uint32_t LL_ADC_GetOverSamplingRatio(const ADC_TypeDef *p_adc)
{
  return (((uint32_t)(STM32_READ_BIT(p_adc->CFGR2, ADC_CFGR2_OVSR)) \
           + (1UL << ADC_CFGR2_OVSR_Pos)) >> ADC_CFGR2_OVSR_Pos);
}

/**
  * @brief  Get ADC oversampling shift.
  * @rmtoll
  *  CFGR2    OVSS           LL_ADC_GetOverSamplingShift
  * @param  p_adc Pointer to ADC instance
  * @retval shift This parameter can be one of the following values:
  *         @arg @ref LL_ADC_OVS_SHIFT_NONE
  *         @arg @ref LL_ADC_OVS_SHIFT_RIGHT_1
  *         @arg @ref LL_ADC_OVS_SHIFT_RIGHT_2
  *         @arg @ref LL_ADC_OVS_SHIFT_RIGHT_3
  *         @arg @ref LL_ADC_OVS_SHIFT_RIGHT_4
  *         @arg @ref LL_ADC_OVS_SHIFT_RIGHT_5
  *         @arg @ref LL_ADC_OVS_SHIFT_RIGHT_6
  *         @arg @ref LL_ADC_OVS_SHIFT_RIGHT_7
  *         @arg @ref LL_ADC_OVS_SHIFT_RIGHT_8
  *         @arg @ref LL_ADC_OVS_SHIFT_RIGHT_9
  *         @arg @ref LL_ADC_OVS_SHIFT_RIGHT_10
  *         or numerical value for right shift value in range from 0 to 10 (value "0" for LL_ADC_OVS_SHIFT_NONE)
  */
__STATIC_INLINE uint32_t LL_ADC_GetOverSamplingShift(const ADC_TypeDef *p_adc)
{
  return (uint32_t)(STM32_READ_BIT(p_adc->CFGR2, ADC_CFGR2_OVSS) >> ADC_CFGR2_OVSS_Pos);
}

/**
  * @}
  */

/** @defgroup ADC_LL_EF_Configuration_ADC_offset Configuration of ADC transversal scope: offset
  * @{
  */

/**
  * @brief  Set ADC selected offset number 1, 2, 3 or 4.
  * @rmtoll
  *  OFCFGR1     OFFSET_CH      LL_ADC_SetOffsetChannel\n
  *  OFCFGR2     OFFSET_CH      LL_ADC_SetOffsetChannel\n
  *  OFCFGR3     OFFSET_CH      LL_ADC_SetOffsetChannel\n
  *  OFCFGR4     OFFSET_CH      LL_ADC_SetOffsetChannel
  * @param  p_adc Pointer to ADC instance
  * @param  offset_y Offset instance. This parameter can be one of the following values:
  *         @arg @ref LL_ADC_OFFSET_1
  *         @arg @ref LL_ADC_OFFSET_2
  *         @arg @ref LL_ADC_OFFSET_3
  *         @arg @ref LL_ADC_OFFSET_4
  * @param  channel This parameter can be one of the following values:
  *         @arg @ref LL_ADC_CHANNEL_0
  *         @arg @ref LL_ADC_CHANNEL_1
  *         @arg @ref LL_ADC_CHANNEL_2
  *         @arg @ref LL_ADC_CHANNEL_3
  *         @arg @ref LL_ADC_CHANNEL_4
  *         @arg @ref LL_ADC_CHANNEL_5
  *         @arg @ref LL_ADC_CHANNEL_6
  *         @arg @ref LL_ADC_CHANNEL_7
  *         @arg @ref LL_ADC_CHANNEL_8
  *         @arg @ref LL_ADC_CHANNEL_9
  *         @arg @ref LL_ADC_CHANNEL_10
  *         @arg @ref LL_ADC_CHANNEL_11
  *         @arg @ref LL_ADC_CHANNEL_12
  *         @arg @ref LL_ADC_CHANNEL_13
$FILE_LL_ADC_CHANNELS_INTERNAL_SET
  * @note   This function set the item of offset configuration:
  *         ADC channel to which the offset programmed will be applied
  *         (independently of channel mapped on ADC group regular
  *         or group injected)
  *         For the other item of offset level, refer to @ref LL_ADC_SetOffsetLevel().
  * @note   Offset value can be subtracted or added using separate sign configuration,
  *         refer to @ref LL_ADC_SetOffsetSign().
  * @note   In case of ADC resolution different of default resolution,
  *         offset level data requires a specific shift.
  *         Use helper macro @ref LL_ADC_OFFSET_SET_LEVEL_RES().
  * @note   If a channel is mapped on several offsets numbers, only the offset
  *         with the lowest value is considered for the subtraction.
  * @note   On this STM32 series, setting of this feature is conditioned to
  *         ADC state:
  *         ADC must be disabled or enabled without conversion ongoing
  *         on either groups regular or injected.
  */
__STATIC_INLINE void LL_ADC_SetOffsetChannel(ADC_TypeDef *p_adc, uint32_t offset_y, uint32_t channel)
{
  __IO uint32_t *preg = LL_ADC_PTR_REG_OFFSET(p_adc->OFCFGR[0], offset_y);

