MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_adc.h
  const uint32_t channel_ll = LL_ADC_REMAP_CHANNEL_INTERNAL_SET(p_adc, channel);

  /* Note: Value shift for correspondence with channel definition using LL_ADC_CH_NUMBER_MASK */
  STM32_MODIFY_REG(*preg,
                   ADC_OFCFGR_OFFSET_CH,
                   LL_ADC_CHANNEL_TO_DECIMAL_NB(channel_ll) << ADC_OFCFGR_OFFSET_CH_Pos);
}

/**
  * @brief  Get for the ADC selected offset number 1, 2, 3 or 4:
  *         Channel to which the offset programmed will be applied
  *         (independently of channel mapped on ADC group regular
  *         or group injected).
  * @rmtoll
  *  OFCFGR1     OFFSET1_CH     LL_ADC_GetOffsetChannel\n
  *  OFCFGR2     OFFSET2_CH     LL_ADC_GetOffsetChannel\n
  *  OFCFGR3     OFFSET3_CH     LL_ADC_GetOffsetChannel\n
  *  OFCFGR4     OFFSET4_CH     LL_ADC_GetOffsetChannel
  * @param  p_adc Pointer to ADC instance
  * @param  offset_y Offset instance. This parameter can be one of the following values:
  *         @arg @ref LL_ADC_OFFSET_1
  *         @arg @ref LL_ADC_OFFSET_2
  *         @arg @ref LL_ADC_OFFSET_3
  *         @arg @ref LL_ADC_OFFSET_4
  * @note   Usage of the returned channel number:
  *         - To reinject this channel into another function LL_ADC_xxx:
  *           the returned channel number is only partly formatted on definition
  *           of literals LL_ADC_CHANNEL_x. Therefore, it has to be compared
  *           with parts of literals LL_ADC_CHANNEL_x or using
  *           helper macro @ref LL_ADC_CHANNEL_TO_DECIMAL_NB().
  *           Then the selected literal LL_ADC_CHANNEL_x can be used
  *           as parameter for another function.
  *         - To get the channel number in decimal format:
  *           process the returned value with the helper macro
  *           @ref LL_ADC_CHANNEL_TO_DECIMAL_NB().
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_ADC_CHANNEL_0
  *         @arg @ref LL_ADC_CHANNEL_1
  *         @arg @ref LL_ADC_CHANNEL_2
  *         @arg @ref LL_ADC_CHANNEL_3
  *         @arg @ref LL_ADC_CHANNEL_4
  *         @arg @ref LL_ADC_CHANNEL_5
  *         @arg @ref LL_ADC_CHANNEL_6
  *         @arg @ref LL_ADC_CHANNEL_7
  *         @arg @ref LL_ADC_CHANNEL_8
  *         @arg @ref LL_ADC_CHANNEL_9
  *         @arg @ref LL_ADC_CHANNEL_10
  *         @arg @ref LL_ADC_CHANNEL_11
  *         @arg @ref LL_ADC_CHANNEL_12
  *         @arg @ref LL_ADC_CHANNEL_13
  *         @arg @ref LL_ADC_CHANNEL_VREFINT         (1)(5)
  *         @arg @ref LL_ADC_CHANNEL_TEMPSENSOR      (1)(5)
  *         @arg @ref LL_ADC_CHANNEL_VDDCORE         (1)(5)
  *         @arg @ref LL_ADC_CHANNEL_OPAMP1_OUT      (1)(5)
  *         @arg @ref LL_ADC_CHANNEL_OPAMP2_OUT      (1)(5)
  *         @arg @ref LL_ADC_CHANNEL_OPAMP3_OUT      (1)(5)
  *         @arg @ref LL_ADC_CHANNEL_VREFINT_ALT     (2)(5)
  *         @arg @ref LL_ADC_CHANNEL_VDDCORE_ALT     (2)(5)
  *         @arg @ref LL_ADC_CHANNEL_OPAMP1_OUT_ALT  (2)(5)
  *         @arg @ref LL_ADC_CHANNEL_OPAMP2_OUT_ALT  (2)(5)
  *         @arg @ref LL_ADC_CHANNEL_VREFINT_ALT2    (3)(5)
  *         @arg @ref LL_ADC_CHANNEL_VDDCORE_ALT2    (3)(5)
  *         @arg @ref LL_ADC_CHANNEL_OPAMP3_OUT_ALT  (3)(5)
  *
  *         (1) On this STM32 series, parameter available only on ADC instance: ADC1.\n
  *         (2) On this STM32 series, parameter available only on ADC instance: ADC2.\n
  *         (3) On this STM32 series, parameter available only on ADC instance: ADC3.\n
  *         (5) For ADC channel read back from ADC register,
  *             comparison with internal channel parameter to be done
  *             using helper macro @ref LL_ADC_CHANNEL_INTERNAL_TO_EXTERNAL().
  *
  *         (1, 2) For ADC channel read back from ADC register,
  *                comparison with internal channel parameter to be done
  *                using helper macro @ref LL_ADC_CHANNEL_INTERNAL_TO_EXTERNAL().
  */
__STATIC_INLINE uint32_t LL_ADC_GetOffsetChannel(const ADC_TypeDef *p_adc, uint32_t offset_y)
{
  const __IO uint32_t *preg = LL_ADC_PTR_REG_OFFSET(p_adc->OFCFGR[0], offset_y);

  return (uint32_t) LL_ADC_DECIMAL_NB_TO_CHANNEL(STM32_READ_BIT(*preg, ADC_OFCFGR_OFFSET_CH) \
                                                 >> ADC_OFCFGR_OFFSET_CH_Pos);
}

/**
  * @brief  Set for the ADC selected offset number 1, 2, 3 or 4:
  *         Offset level (offset to be subtracted from the raw
  *         converted data).
  * @rmtoll
  *  OFR1     OFFSET1        LL_ADC_SetOffsetLevel\n
  *  OFR2     OFFSET2        LL_ADC_SetOffsetLevel\n
  *  OFR3     OFFSET3        LL_ADC_SetOffsetLevel\n
  *  OFR4     OFFSET4        LL_ADC_SetOffsetLevel
  * @param  p_adc Pointer to ADC instance
  * @param  offset_y Offset instance. This parameter can be one of the following values:
  *         @arg @ref LL_ADC_OFFSET_1
  *         @arg @ref LL_ADC_OFFSET_2
  *         @arg @ref LL_ADC_OFFSET_3
  *         @arg @ref LL_ADC_OFFSET_4
  * @param  offset_level Value between Min_Data=0x000 and Max_Data=0x003FFFFF
  * @note   Offset value can be subtracted or added using separate sign configuration,
  *         refer to @ref LL_ADC_SetOffsetSign().
  * @note   This function set the item of offset configuration:
  *         Offset level (offset to be computed from the raw converted data).
  *         ADC channel to which the offset programmed will be applied
  *         For the other item of ADC channel to which the offset programmed will be applied,
  *         refer to @ref LL_ADC_SetOffsetChannel().
  * @note   Caution: Offset format is dependent to ADC resolution:
  *         offset has to be left-aligned on bit 11, the LSB (right bits)
  *         are set to 0.
  * @note   On this STM32 series, setting of this feature is conditioned to
  *         ADC state:
  *         ADC must be disabled or enabled without conversion ongoing
  *         on either groups regular or injected.
  */
__STATIC_INLINE void LL_ADC_SetOffsetLevel(ADC_TypeDef *p_adc, uint32_t offset_y, uint32_t offset_level)
{
  __IO uint32_t *preg_offset_val = LL_ADC_PTR_REG_OFFSET(p_adc->OFR[0], offset_y);

