MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_adc.h
/**
  * @brief  Get the selected ADC instance internal voltage regulator state.
  * @rmtoll
  *  CR       ADVREGEN       LL_ADC_IsInternalRegulatorEnabled
  * @param  p_adc Pointer to ADC instance
  * @retval 0: internal regulator is disabled, 1: internal regulator is enabled.
  */
__STATIC_INLINE uint32_t LL_ADC_IsInternalRegulatorEnabled(const ADC_TypeDef *p_adc)
{
  return ((STM32_READ_BIT(p_adc->CR, ADC_CR_ADVREGEN) == (ADC_CR_ADVREGEN)) ? 1UL : 0UL);
}

/**
  * @brief  Enable the selected ADC instance.
  * @rmtoll
  *  CR       ADEN           LL_ADC_Enable
  * @param  p_adc Pointer to ADC instance
  * @note   On this STM32 series, after ADC enable, a delay for
  *         ADC internal analog stabilization is required before performing a
  *         ADC conversion start.
  *         Refer to device datasheet, parameter tSTAB.
  * @note   ADC enable is a part of ADC activation.
  *         ADC activation procedure requires several necessary steps:
  *         - RCC to provide ADC bus clock (refer to LL bus driver)
  *         - ADC internal voltage regulator enable (refer to @ref LL_ADC_DisableDeepPowerDown(),
  *           LL_ADC_EnableInternalRegulator())
  *         - RCC to provide ADC kernel clock (refer to LL RCC driver). Can be done at any step.
  *         - ADC enable (this function @ref LL_ADC_Enable())
  *         - Check ADC ready flag (refer to @ref LL_ADC_IsActiveFlag_ADRDY())
  * @note   On this STM32 series, setting of this feature is conditioned to
  *         ADC state:
  *         ADC must be ADC disabled and ADC internal voltage regulator enabled.
  */
__STATIC_INLINE void LL_ADC_Enable(ADC_TypeDef *p_adc)
{
  /* Note: Write register with some additional bits forced to state reset     */
  /*       instead of modifying only the selected bit for this function,      */
  /*       to not interfere with bits with HW property "rs".                  */
  STM32_MODIFY_REG(p_adc->CR, LL_ADC_CR_BITS_PROPERTY_RS, ADC_CR_ADEN);
}

/**
  * @brief  Disable the selected ADC instance.
  * @rmtoll
  *  CR       ADDIS          LL_ADC_Disable
  * @param  p_adc Pointer to ADC instance
  * @note   On this STM32 series, setting of this feature is conditioned to
  *         ADC state:
  *         ADC must be not disabled. Must be enabled without conversion ongoing
  *         on either groups regular or injected.
  */
__STATIC_INLINE void LL_ADC_Disable(ADC_TypeDef *p_adc)
{
  /* Note: Write register with some additional bits forced to state reset     */
  /*       instead of modifying only the selected bit for this function,      */
  /*       to not interfere with bits with HW property "rs".                  */
  STM32_MODIFY_REG(p_adc->CR, LL_ADC_CR_BITS_PROPERTY_RS, ADC_CR_ADDIS);
}

/**
  * @brief  Get the selected ADC instance enable state.
  * @rmtoll
  *  CR       ADEN           LL_ADC_IsEnabled
  * @param  p_adc Pointer to ADC instance
  * @note   ADC enable is a part of ADC activation.
  *         ADC activation procedure requires several necessary steps:
  *         refer to description of @ref LL_ADC_Enable().
  * @retval 0: ADC is disabled, 1: ADC is enabled.
  */
__STATIC_INLINE uint32_t LL_ADC_IsEnabled(const ADC_TypeDef *p_adc)
{
  return ((STM32_READ_BIT(p_adc->CR, ADC_CR_ADEN) == (ADC_CR_ADEN)) ? 1UL : 0UL);
}

/**
  * @brief  Get the selected ADC instance disable state.
  * @rmtoll
  *  CR       ADDIS          LL_ADC_IsDisableOngoing
  * @param  p_adc Pointer to ADC instance
  * @retval 0: no ADC disable command ongoing.
  */
__STATIC_INLINE uint32_t LL_ADC_IsDisableOngoing(const ADC_TypeDef *p_adc)
{
  return ((STM32_READ_BIT(p_adc->CR, ADC_CR_ADDIS) == (ADC_CR_ADDIS)) ? 1UL : 0UL);
}

/**
  * @brief  Start ADC calibration in the mode single-ended
  *         or differential (for devices with differential mode available).
  * @rmtoll
  *  CR       ADCAL          LL_ADC_StartCalibration\n
  *  CR       ADCALDIF       LL_ADC_StartCalibration\n
  *  CR       ADCALDIF       LL_ADC_StartCalibration
  * @param  p_adc Pointer to ADC instance
  * @param  input_mode This parameter can be one of the following values:
  *         @arg @ref LL_ADC_IN_SINGLE_ENDED
  * @note   On this STM32 series, a minimum number of ADC clock cycles
  *         are required between ADC end of calibration and ADC enable.
  *         Refer to literal @ref LL_ADC_DELAY_CALIB_ENABLE_ADC_CYCLES.
  * @note   On this STM32 series, setting of this feature is conditioned to
  *         ADC state:
  *         ADC must be ADC disabled.
  */
__STATIC_INLINE void LL_ADC_StartCalibration(ADC_TypeDef *p_adc, uint32_t input_mode)
{
  /* Prevent unused argument(s) compilation warning */
  (void)(input_mode);

  STM32_SET_BIT(p_adc->CR, ADC_CR_ADCAL);
}

/**
  * @brief  Get ADC calibration state.
  * @rmtoll
  *  CR       ADCAL          LL_ADC_IsCalibrationOnGoing
  * @param  p_adc Pointer to ADC instance
  * @retval 0: calibration complete, 1: calibration in progress.
  */
__STATIC_INLINE uint32_t LL_ADC_IsCalibrationOnGoing(const ADC_TypeDef *p_adc)
{
  return ((STM32_READ_BIT(p_adc->CR, ADC_CR_ADCAL) == (ADC_CR_ADCAL)) ? 1UL : 0UL);
}

/**
  * @}
  */

/** @defgroup ADC_LL_EF_Operation_ADC_Group_Regular Operation on ADC hierarchical scope: group regular
  * @{
  */

/**
  * @brief  Start ADC group regular conversion.
  * @rmtoll
  *  CR       ADSTART        LL_ADC_REG_StartConversion
  * @param  p_adc Pointer to ADC instance
  * @note   On this STM32 series, this function is relevant for both
  *         internal trigger (SW start) and external trigger:
  *         - If ADC trigger has been set to software start, ADC conversion
  *           starts immediately.
  *         - If ADC trigger has been set to external trigger, ADC conversion
  *           will start at next trigger event (on the selected trigger edge)
  *           following the ADC start conversion command.
  * @note   On this STM32 series, setting of this feature is conditioned to
  *         ADC state:
  *         ADC must be enabled without conversion ongoing on group regular,
  *         without conversion stop command ongoing on group regular,
  *         without ADC disable command ongoing.
  */
__STATIC_INLINE void LL_ADC_REG_StartConversion(ADC_TypeDef *p_adc)
{
  /* Note: Write register with some additional bits forced to state reset     */
  /*       instead of modifying only the selected bit for this function,      */
  /*       to not interfere with bits with HW property "rs".                  */
  STM32_MODIFY_REG(p_adc->CR, LL_ADC_CR_BITS_PROPERTY_RS, ADC_CR_ADSTART);
}

/**
  * @brief  Stop ADC group regular conversion.
  * @rmtoll
  *  CR       ADSTP          LL_ADC_REG_StopConversion
  * @param  p_adc Pointer to ADC instance
  * @note   On this STM32 series, setting of this feature is conditioned to
  *         ADC state:
  *         ADC must be enabled with conversion ongoing on group regular,
  *         without ADC disable command ongoing.
  */
__STATIC_INLINE void LL_ADC_REG_StopConversion(ADC_TypeDef *p_adc)
{
  /* Note: Write register with some additional bits forced to state reset     */
  /*       instead of modifying only the selected bit for this function,      */
  /*       to not interfere with bits with HW property "rs".                  */
  STM32_MODIFY_REG(p_adc->CR,
                   LL_ADC_CR_BITS_PROPERTY_RS,
                   ADC_CR_ADSTP);
}

/**
  * @brief  Get ADC group regular conversion state.
  * @rmtoll
  *  CR       ADSTART        LL_ADC_REG_IsConversionOngoing
  * @param  p_adc Pointer to ADC instance
  * @retval 0: no conversion is ongoing on ADC group regular.
  */
__STATIC_INLINE uint32_t LL_ADC_REG_IsConversionOngoing(const ADC_TypeDef *p_adc)
{
  return ((STM32_READ_BIT(p_adc->CR, ADC_CR_ADSTART) == (ADC_CR_ADSTART)) ? 1UL : 0UL);
}

/**
  * @brief  Get ADC group regular command of conversion stop state.
  * @rmtoll
  *  CR       ADSTP          LL_ADC_REG_IsStopConversionOngoing
  * @param  p_adc Pointer to ADC instance
  * @retval 0: no command of conversion stop is ongoing on ADC group regular.
  */
__STATIC_INLINE uint32_t LL_ADC_REG_IsStopConversionOngoing(const ADC_TypeDef *p_adc)
{
  return ((STM32_READ_BIT(p_adc->CR, ADC_CR_ADSTP) == (ADC_CR_ADSTP)) ? 1UL : 0UL);
}

/**
  * @brief  Get ADC group regular conversion data, range fit for all ADC configurations:
  *         all ADC resolutions, features extending data width (oversampling, data shift, ...)
  *         and features changing data sign (offset).
  * @rmtoll
  *  DR       RDATA          LL_ADC_REG_ReadConversionData
  * @param  p_adc Pointer to ADC instance
  * @retval Signed value (can be negative after post-processing computation: offset feature)
  *         between Min_Data=-4194304 (two's complement 0xFFC00000) and Max_Data=+4194303 (0x003FFFFF)
  */
__STATIC_INLINE int32_t LL_ADC_REG_ReadConversionData(const ADC_TypeDef *p_adc)
{
  return (int32_t)((uint32_t)STM32_READ_BIT(p_adc->DR, ADC_DR_RDATA));
}

/**
  * @brief  Get ADC group regular conversion data, range fit for ADC configurations with
  *         all ADC resolutions, features extending data width (oversampling, data shift, ...)
  *         but not features changing data sign (offset).
  * @rmtoll
  *  DR       RDATA          LL_ADC_REG_ReadConversionData32
  * @param  p_adc Pointer to ADC instance
  * @note   To get data handling all ADC configurations, use default function @ref LL_ADC_REG_ReadConversionData().
  * @retval Value between Min_Data=0x00000000 and Max_Data=0xFFFFFFFF
  */
__STATIC_INLINE uint32_t LL_ADC_REG_ReadConversionData32(const ADC_TypeDef *p_adc)
{
  return (uint32_t)(STM32_READ_BIT(p_adc->DR, ADC_DR_RDATA));
}

/**
  * @brief  Get ADC group regular conversion data, range fit for data width 12 bits and unsigned.
  * @rmtoll
  *  DR       RDATA          LL_ADC_REG_ReadConversionData12
  * @param  p_adc Pointer to ADC instance
  * @note   To get data handling all ADC configurations, use default function @ref LL_ADC_REG_ReadConversionData().
  * @retval Value between Min_Data=0x000 and Max_Data=0xFFF
  */
__STATIC_INLINE uint16_t LL_ADC_REG_ReadConversionData12(const ADC_TypeDef *p_adc)
{
  return (uint16_t)(STM32_READ_BIT(p_adc->DR, ADC_DR_RDATA));
}

/**
  * @brief  Get ADC group regular conversion data, range fit for data width 10 bits and unsigned.
  * @rmtoll
  *  DR       RDATA          LL_ADC_REG_ReadConversionData10
  * @param  p_adc Pointer to ADC instance
  * @note   To get data handling all ADC configurations, use default function @ref LL_ADC_REG_ReadConversionData().
  * @retval Value between Min_Data=0x000 and Max_Data=0x3FF
  */
__STATIC_INLINE uint16_t LL_ADC_REG_ReadConversionData10(const ADC_TypeDef *p_adc)
{
  return (uint16_t)(STM32_READ_BIT(p_adc->DR, ADC_DR_RDATA));
}

/**
  * @brief  Get ADC group regular conversion data, range fit for data width 8 bits and unsigned.
  * @rmtoll
  *  DR       RDATA          LL_ADC_REG_ReadConversionData8
  * @param  p_adc Pointer to ADC instance
  * @note   To get data handling all ADC configurations, use default function @ref LL_ADC_REG_ReadConversionData().
  * @retval Value between Min_Data=0x00 and Max_Data=0xFF
  */
__STATIC_INLINE uint8_t LL_ADC_REG_ReadConversionData8(const ADC_TypeDef *p_adc)
{
  return (uint8_t)(STM32_READ_BIT(p_adc->DR, ADC_DR_RDATA));
}

/**
  * @brief  Get ADC group regular conversion data, range fit for data width 6 bits and unsigned.
  * @rmtoll
  *  DR       RDATA          LL_ADC_REG_ReadConversionData6
  * @param  p_adc Pointer to ADC instance
  * @note   To get data handling all ADC configurations, use default function @ref LL_ADC_REG_ReadConversionData().
  * @retval Value between Min_Data=0x00 and Max_Data=0x3F
  */
__STATIC_INLINE uint8_t LL_ADC_REG_ReadConversionData6(const ADC_TypeDef *p_adc)
{
  return (uint8_t)(STM32_READ_BIT(p_adc->DR, ADC_DR_RDATA));
}

#if defined(ADC_MULTIMODE_SUPPORT)
/**
  * @brief  Get ADC multimode conversion data of ADC master, ADC slave
  *         or raw data with ADC master and slave concatenated.
  * @rmtoll
  *  CDR      RDATA_MST      LL_ADC_REG_ReadMultiConversionData32\n
  *  CDR      RDATA_SLV      LL_ADC_REG_ReadMultiConversionData32
  * @param  p_adc_common Pointer to ADC common instance
  *         (can be set directly from CMSIS definition ADCxy_COMMON or using macro ADC_COMMON_INSTANCE())
  * @param  ConversionData This parameter can be one of the following values:
  *         @arg @ref LL_ADC_MULTI_MASTER       (1)
  *         @arg @ref LL_ADC_MULTI_SLAVE        (1)
  *         @arg @ref LL_ADC_MULTI_MASTER_SLAVE
  *
  *         (1) Parameter available only if ADC multimode group regular data format with packing option on 32 bits
  *             (refer to @ref LL_ADC_MULTI_REG_DMA_RES_32_16B).
  * @note   This function is relevant only for ADC multimode group regular data format with packing: each ADC conversion
  *         data concatenated in a single register (refer to @ref LL_ADC_MULTI_REG_DMA_RES_32_16B,
  *         @ref LL_ADC_MULTI_REG_DMA_RES_8B).
  * @note   Each ADC conversion data width is limited to 8 or 16 bits depending on data packing setting.
  *         If expected data width is wider (this can be the case with features extending data width (oversampling,
  *         data shift,...), others services must be used:
  *         - function "LL_ADC_REG_ReadConversionData()" for each ADC instance part of multimode.
  *         - multimode functions with data transfer by DMA.
  * @note   Returned value is unsigned, due to concatenation of multiple data.
  *         In case of signed data expected (with features changing data sign: offset),
  *         use function "LL_ADC_REG_ReadConversionData()" for each ADC instance part of multimode.
  * @note   If raw data with ADC master and slave concatenated is retrieved,
  *         a macro is available to get the conversion data of
  *         ADC master or ADC slave: see helper macro
  *         @ref LL_ADC_MULTI_CONV_DATA_MASTER_SLAVE().
  *         (however this macro is mainly intended for multimode
  *         transfer by DMA, because this function can do the same
  *         by getting multimode conversion data of ADC master or ADC slave
  *         separately).
  * @retval Value between Min_Data=0x00000000 and Max_Data=0xFFFFFFFF
  */
__STATIC_INLINE uint32_t LL_ADC_REG_ReadMultiConversionData32(const ADC_Common_TypeDef *p_adc_common,
                                                              uint32_t ConversionData)
{
  return (uint32_t)(STM32_READ_BIT(p_adc_common->CDR, ConversionData) >> (STM32_POSITION_VAL(ConversionData) & 0x1FUL));
}
#endif /* ADC_MULTIMODE_SUPPORT */
/**
  * @}
  */

/** @defgroup ADC_LL_EF_Operation_ADC_Group_Injected Operation on ADC hierarchical scope: group injected
  * @{
  */

/**
  * @brief  Start ADC group injected conversion.
  * @rmtoll
  *  CR       JADSTART       LL_ADC_INJ_StartConversion
  * @param  p_adc Pointer to ADC instance
  * @note   On this STM32 series, this function is relevant for both
  *         internal trigger (SW start) and external trigger:
  *         - If ADC trigger has been set to software start, ADC conversion
  *           starts immediately.
  *         - If ADC trigger has been set to external trigger, ADC conversion
  *           will start at next trigger event (on the selected trigger edge)
  *           following the ADC start conversion command.
  * @note   On this STM32 series, setting of this feature is conditioned to
  *         ADC state:
  *         ADC must be enabled without conversion ongoing on group injected,
  *         without conversion stop command ongoing on group injected,
  *         without ADC disable command ongoing.
  */
__STATIC_INLINE void LL_ADC_INJ_StartConversion(ADC_TypeDef *p_adc)
{
  /* Note: Write register with some additional bits forced to state reset     */
  /*       instead of modifying only the selected bit for this function,      */
  /*       to not interfere with bits with HW property "rs".                  */
  STM32_MODIFY_REG(p_adc->CR, LL_ADC_CR_BITS_PROPERTY_RS, ADC_CR_JADSTART);
}

/**
  * @brief  Stop ADC group injected conversion.
  * @rmtoll
  *  CR       JADSTP         LL_ADC_INJ_StopConversion
  * @param  p_adc Pointer to ADC instance
  * @note   On this STM32 series, setting of this feature is conditioned to
  *         ADC state:
  *         ADC must be enabled with conversion ongoing on group injected,
  *         without ADC disable command ongoing.
  */
__STATIC_INLINE void LL_ADC_INJ_StopConversion(ADC_TypeDef *p_adc)
{
  /* Note: Write register with some additional bits forced to state reset     */
  /*       instead of modifying only the selected bit for this function,      */
  /*       to not interfere with bits with HW property "rs".                  */
  STM32_MODIFY_REG(p_adc->CR, LL_ADC_CR_BITS_PROPERTY_RS, ADC_CR_JADSTP);
}

/**
  * @brief  Get ADC group injected conversion state.
  * @rmtoll
  *  CR       JADSTART       LL_ADC_INJ_IsConversionOngoing
  * @param  p_adc Pointer to ADC instance
  * @retval 0: no conversion is ongoing on ADC group injected.
  */
__STATIC_INLINE uint32_t LL_ADC_INJ_IsConversionOngoing(const ADC_TypeDef *p_adc)
{
  return ((STM32_READ_BIT(p_adc->CR, ADC_CR_JADSTART) == (ADC_CR_JADSTART)) ? 1UL : 0UL);
}

/**
  * @brief  Get ADC group injected command of conversion stop state.
  * @rmtoll
  *  CR       JADSTP         LL_ADC_INJ_IsStopConversionOngoing
  * @param  p_adc Pointer to ADC instance
  * @retval 0: no command of conversion stop is ongoing on ADC group injected.
  */
__STATIC_INLINE uint32_t LL_ADC_INJ_IsStopConversionOngoing(const ADC_TypeDef *p_adc)
{
  return ((STM32_READ_BIT(p_adc->CR, ADC_CR_JADSTP) == (ADC_CR_JADSTP)) ? 1UL : 0UL);
}

/**
  * @brief  Get ADC group injected conversion data, range fit for all ADC configurations:
  *         all ADC resolutions, features extending data width (oversampling, data shift, ...)
  *         and features changing data sign (offset).
  * @rmtoll
  *  JDR1     JDATA          LL_ADC_INJ_ReadConversionDataRank\n
  *  JDR2     JDATA          LL_ADC_INJ_ReadConversionDataRank\n
  *  JDR3     JDATA          LL_ADC_INJ_ReadConversionDataRank\n
  *  JDR4     JDATA          LL_ADC_INJ_ReadConversionDataRank
  * @param  p_adc Pointer to ADC instance
  * @param  rank ADC group injected sequencer rank.
  *         This parameter can be one of the following values:
  *         @arg @ref LL_ADC_INJ_RANK_1
  *         @arg @ref LL_ADC_INJ_RANK_2
  *         @arg @ref LL_ADC_INJ_RANK_3
  *         @arg @ref LL_ADC_INJ_RANK_4
  * @retval Signed value (can be negative after post-processing computation: offset feature)
  *         between Min_Data=-2147483648 (two's complement 0x80000000) and Max_Data=+2147483647 (0x7FFFFFFF)
  */
__STATIC_INLINE int32_t LL_ADC_INJ_ReadConversionDataRank(const ADC_TypeDef *p_adc, uint32_t rank)
{
  const __IO uint32_t *preg = LL_ADC_PTR_REG_OFFSET(p_adc->JDR[0], ((rank & LL_ADC_INJ_JDRX_REGOFFSET_MASK)
                                                                    >> LL_ADC_JDRX_REGOFFSET_POS));

  return (int32_t)((uint32_t)STM32_READ_BIT(*preg, ADC_JDR_JDATA));
}

/**
  * @brief  Get ADC group injected conversion data, range fit for ADC configurations with
  *         all ADC resolutions, features extending data width (oversampling, data shift, ...)
  *         but not features changing data sign (offset).
  * @rmtoll
  *  JDR1     JDATA          LL_ADC_INJ_ReadConversionData32Rank\n
  *  JDR2     JDATA          LL_ADC_INJ_ReadConversionData32Rank\n
  *  JDR3     JDATA          LL_ADC_INJ_ReadConversionData32Rank\n
  *  JDR4     JDATA          LL_ADC_INJ_ReadConversionData32Rank
  * @param  p_adc Pointer to ADC instance
  * @param  rank ADC group injected sequencer rank.
  *         This parameter can be one of the following values:
  *         @arg @ref LL_ADC_INJ_RANK_1
  *         @arg @ref LL_ADC_INJ_RANK_2
  *         @arg @ref LL_ADC_INJ_RANK_3
  *         @arg @ref LL_ADC_INJ_RANK_4
  * @note   To get data handling all ADC configurations, use default function @ref LL_ADC_INJ_ReadConversionDataRank().
  * @retval Value between Min_Data=0x00000000 and Max_Data=0xFFFFFFFF
  */
__STATIC_INLINE uint32_t LL_ADC_INJ_ReadConversionData32Rank(const ADC_TypeDef *p_adc, uint32_t rank)
{
  const __IO uint32_t *preg = LL_ADC_PTR_REG_OFFSET(p_adc->JDR[0], ((rank & LL_ADC_INJ_JDRX_REGOFFSET_MASK)
                                                                    >> LL_ADC_JDRX_REGOFFSET_POS));

  return (uint32_t)STM32_READ_BIT(*preg, ADC_JDR_JDATA);
}

/**
  * @brief  Get ADC group injected conversion data, range fit for data width 12 bits and unsigned.
  * @rmtoll
  *  JDR1     JDATA          LL_ADC_INJ_ReadConversionData12Rank\n
  *  JDR2     JDATA          LL_ADC_INJ_ReadConversionData12Rank\n
  *  JDR3     JDATA          LL_ADC_INJ_ReadConversionData12Rank\n
  *  JDR4     JDATA          LL_ADC_INJ_ReadConversionData12Rank
  * @param  p_adc Pointer to ADC instance
  * @param  rank ADC group injected sequencer rank.
  *         This parameter can be one of the following values:
  *         @arg @ref LL_ADC_INJ_RANK_1
  *         @arg @ref LL_ADC_INJ_RANK_2
  *         @arg @ref LL_ADC_INJ_RANK_3
  *         @arg @ref LL_ADC_INJ_RANK_4
  * @note   To get data handling all ADC configurations, use default function @ref LL_ADC_INJ_ReadConversionDataRank().
  * @retval Value between Min_Data=0x000 and Max_Data=0xFFF
  */
__STATIC_INLINE uint16_t LL_ADC_INJ_ReadConversionData12Rank(const ADC_TypeDef *p_adc, uint32_t rank)
{
  const __IO uint32_t *preg = LL_ADC_PTR_REG_OFFSET(p_adc->JDR[0], ((rank & LL_ADC_INJ_JDRX_REGOFFSET_MASK)
                                                                    >> LL_ADC_JDRX_REGOFFSET_POS));

  return (uint16_t)STM32_READ_BIT(*preg, ADC_JDR_JDATA);
}

/**
  * @brief  Get ADC group injected conversion data, range fit for data width 10 bits and unsigned.
  * @rmtoll
  *  JDR1     JDATA          LL_ADC_INJ_ReadConversionData10Rank\n
  *  JDR2     JDATA          LL_ADC_INJ_ReadConversionData10Rank\n
  *  JDR3     JDATA          LL_ADC_INJ_ReadConversionData10Rank\n
  *  JDR4     JDATA          LL_ADC_INJ_ReadConversionData10Rank
  * @param  p_adc Pointer to ADC instance
  * @param  rank ADC group injected sequencer rank.
  *         This parameter can be one of the following values:
  *         @arg @ref LL_ADC_INJ_RANK_1
  *         @arg @ref LL_ADC_INJ_RANK_2
  *         @arg @ref LL_ADC_INJ_RANK_3
  *         @arg @ref LL_ADC_INJ_RANK_4
  * @note   To get data handling all ADC configurations, use default function @ref LL_ADC_INJ_ReadConversionDataRank().
  * @retval Value between Min_Data=0x000 and Max_Data=0x3FF
  */
__STATIC_INLINE uint16_t LL_ADC_INJ_ReadConversionData10Rank(const ADC_TypeDef *p_adc, uint32_t rank)
{
  const __IO uint32_t *preg = LL_ADC_PTR_REG_OFFSET(p_adc->JDR[0], ((rank & LL_ADC_INJ_JDRX_REGOFFSET_MASK)
                                                                    >> LL_ADC_JDRX_REGOFFSET_POS));

  return (uint16_t)STM32_READ_BIT(*preg, ADC_JDR_JDATA);
}

