MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_adc.h
/**
  * @brief  Get ADC group injected conversion data, range fit for data width 8 bits and unsigned.
  * @rmtoll
  *  JDR1     JDATA          LL_ADC_INJ_ReadConversionData8Rank\n
  *  JDR2     JDATA          LL_ADC_INJ_ReadConversionData8Rank\n
  *  JDR3     JDATA          LL_ADC_INJ_ReadConversionData8Rank\n
  *  JDR4     JDATA          LL_ADC_INJ_ReadConversionData8Rank
  * @param  p_adc Pointer to ADC instance
  * @param  rank ADC group injected sequencer rank.
  *         This parameter can be one of the following values:
  *         @arg @ref LL_ADC_INJ_RANK_1
  *         @arg @ref LL_ADC_INJ_RANK_2
  *         @arg @ref LL_ADC_INJ_RANK_3
  *         @arg @ref LL_ADC_INJ_RANK_4
  * @note   To get data handling all ADC configurations, use default function @ref LL_ADC_INJ_ReadConversionDataRank().
  * @retval Value between Min_Data=0x00 and Max_Data=0xFF
  */
__STATIC_INLINE uint8_t LL_ADC_INJ_ReadConversionData8Rank(const ADC_TypeDef *p_adc, uint32_t rank)
{
  const __IO uint32_t *preg = LL_ADC_PTR_REG_OFFSET(p_adc->JDR[0], ((rank & LL_ADC_INJ_JDRX_REGOFFSET_MASK)
                                                                    >> LL_ADC_JDRX_REGOFFSET_POS));

  return (uint8_t)STM32_READ_BIT(*preg, ADC_JDR_JDATA);
}

/**
  * @brief  Get ADC group injected conversion data, range fit for data width 6 bits and unsigned.
  * @rmtoll
  *  JDR1     JDATA          LL_ADC_INJ_ReadConversionData6Rank\n
  *  JDR2     JDATA          LL_ADC_INJ_ReadConversionData6Rank\n
  *  JDR3     JDATA          LL_ADC_INJ_ReadConversionData6Rank\n
  *  JDR4     JDATA          LL_ADC_INJ_ReadConversionData6Rank
  * @param  p_adc Pointer to ADC instance
  * @param  rank ADC group injected sequencer rank.
  *         This parameter can be one of the following values:
  *         @arg @ref LL_ADC_INJ_RANK_1
  *         @arg @ref LL_ADC_INJ_RANK_2
  *         @arg @ref LL_ADC_INJ_RANK_3
  *         @arg @ref LL_ADC_INJ_RANK_4
  * @note   To get data handling all ADC configurations, use default function @ref LL_ADC_INJ_ReadConversionDataRank().
  * @retval Value between Min_Data=0x00 and Max_Data=0x3F
  */
__STATIC_INLINE uint8_t LL_ADC_INJ_ReadConversionData6Rank(const ADC_TypeDef *p_adc, uint32_t rank)
{
  const __IO uint32_t *preg = LL_ADC_PTR_REG_OFFSET(p_adc->JDR[0], ((rank & LL_ADC_INJ_JDRX_REGOFFSET_MASK)
                                                                    >> LL_ADC_JDRX_REGOFFSET_POS));

  return (uint8_t)STM32_READ_BIT(*preg, ADC_JDR_JDATA);
}

/**
  * @brief  Legacy function of @ref LL_ADC_INJ_ReadConversionDataRank().
  * @rmtoll
  *  JDRx     JDATA          LL_ADC_INJ_ReadConversionDataRank
  * @param  p_adc Pointer to ADC instance
  * @param  rank This parameter can be one of the following values:
  *         @arg @ref LL_ADC_INJ_RANK_1
  *         @arg @ref LL_ADC_INJ_RANK_2
  *         @arg @ref LL_ADC_INJ_RANK_3
  *         @arg @ref LL_ADC_INJ_RANK_4
  * @retval Signed value, refer to description of @ref LL_ADC_INJ_ReadConversionDataRank()
  */
__STATIC_INLINE int32_t LL_ADC_INJ_ReadConversionData(const ADC_TypeDef *p_adc, uint32_t rank)
{
  return LL_ADC_INJ_ReadConversionDataRank(p_adc, rank);
}

/**
  * @brief  Legacy function of @ref LL_ADC_INJ_ReadConversionData32Rank().
  * @rmtoll
  *  JDRx     JDATA          LL_ADC_INJ_ReadConversionData32Rank
  * @param  p_adc Pointer to ADC instance
  * @param  rank This parameter can be one of the following values:
  *         @arg @ref LL_ADC_INJ_RANK_1
  *         @arg @ref LL_ADC_INJ_RANK_2
  *         @arg @ref LL_ADC_INJ_RANK_3
  *         @arg @ref LL_ADC_INJ_RANK_4
  * @retval Signed value, refer to description of @ref LL_ADC_INJ_ReadConversionData32Rank().
  */
__STATIC_INLINE uint32_t LL_ADC_INJ_ReadConversionData32(const ADC_TypeDef *p_adc, uint32_t rank)
{
  return LL_ADC_INJ_ReadConversionData32Rank(p_adc, rank);
}

/**
  * @brief  Legacy function of @ref LL_ADC_INJ_ReadConversionData12Rank().
  * @rmtoll
  *  JDRx     JDATA          LL_ADC_INJ_ReadConversionData12Rank
  * @param  p_adc Pointer to ADC instance
  * @param  rank This parameter can be one of the following values:
  *         @arg @ref LL_ADC_INJ_RANK_1
  *         @arg @ref LL_ADC_INJ_RANK_2
  *         @arg @ref LL_ADC_INJ_RANK_3
  *         @arg @ref LL_ADC_INJ_RANK_4
  * @retval Signed value, refer to description of @ref LL_ADC_INJ_ReadConversionData12Rank()
  */
__STATIC_INLINE uint16_t LL_ADC_INJ_ReadConversionData12(const ADC_TypeDef *p_adc, uint32_t rank)
{
  return LL_ADC_INJ_ReadConversionData12Rank(p_adc, rank);
}

/**
  * @brief  Legacy function of @ref LL_ADC_INJ_ReadConversionData10Rank().
  * @rmtoll
  *  JDRx     JDATA          LL_ADC_INJ_ReadConversionData10Rank
  * @param  p_adc Pointer to ADC instance
  * @param  rank This parameter can be one of the following values:
  *         @arg @ref LL_ADC_INJ_RANK_1
  *         @arg @ref LL_ADC_INJ_RANK_2
  *         @arg @ref LL_ADC_INJ_RANK_3
  *         @arg @ref LL_ADC_INJ_RANK_4
  * @retval Signed value, refer to description of @ref LL_ADC_INJ_ReadConversionData10Rank()
  */
__STATIC_INLINE uint16_t LL_ADC_INJ_ReadConversionData10(const ADC_TypeDef *p_adc, uint32_t rank)
{
  return LL_ADC_INJ_ReadConversionData10Rank(p_adc, rank);
}

/**
  * @brief  Legacy function of @ref LL_ADC_INJ_ReadConversionData8Rank().
  * @rmtoll
  *  JDRx     JDATA          LL_ADC_INJ_ReadConversionData8Rank
  * @param  p_adc Pointer to ADC instance
  * @param  rank This parameter can be one of the following values:
  *         @arg @ref LL_ADC_INJ_RANK_1
  *         @arg @ref LL_ADC_INJ_RANK_2
  *         @arg @ref LL_ADC_INJ_RANK_3
  *         @arg @ref LL_ADC_INJ_RANK_4
  * @retval Signed value, refer to description of @ref LL_ADC_INJ_ReadConversionData8Rank()
  */
__STATIC_INLINE uint8_t LL_ADC_INJ_ReadConversionData8(const ADC_TypeDef *p_adc, uint32_t rank)
{
  return LL_ADC_INJ_ReadConversionData8Rank(p_adc, rank);
}

/**
  * @brief  Legacy function of @ref LL_ADC_INJ_ReadConversionData6Rank().
  * @rmtoll
  *  JDRx     JDATA          LL_ADC_INJ_ReadConversionData6Rank
  * @param  p_adc Pointer to ADC instance
  * @param  rank This parameter can be one of the following values:
  *         @arg @ref LL_ADC_INJ_RANK_1
  *         @arg @ref LL_ADC_INJ_RANK_2
  *         @arg @ref LL_ADC_INJ_RANK_3
  *         @arg @ref LL_ADC_INJ_RANK_4
  * @retval Signed value, refer to description of @ref LL_ADC_INJ_ReadConversionData6Rank()
  */
__STATIC_INLINE uint8_t LL_ADC_INJ_ReadConversionData6(const ADC_TypeDef *p_adc, uint32_t rank)
{
  return LL_ADC_INJ_ReadConversionData6Rank(p_adc, rank);
}

/**
  * @}
  */

/** @defgroup ADC_LL_EF_FLAG_Management ADC flag management
  * @{
  */

/**
  * @brief  Get ADC flag.
  * @rmtoll
  *  ISR      ADRDY          LL_ADC_IsActiveFlag\n
  *  ISR      EOC            LL_ADC_IsActiveFlag\n
  *  ISR      EOS            LL_ADC_IsActiveFlag\n
  *  ISR      OVR            LL_ADC_IsActiveFlag\n
  *  ISR      EOSMP          LL_ADC_IsActiveFlag\n
  *  ISR      JEOC           LL_ADC_IsActiveFlag\n
  *  ISR      JEOS           LL_ADC_IsActiveFlag\n
  *  ISR      AWD1           LL_ADC_IsActiveFlag\n
  *  ISR      AWD2           LL_ADC_IsActiveFlag\n
  *  ISR      AWD3           LL_ADC_IsActiveFlag\n
  *  ISR      LDORDY         LL_ADC_IsActiveFlag
  * @param  p_adc Pointer to ADC instance
  * @param  flag This parameter can one of the following values:
  *         @arg @ref LL_ADC_FLAG_ADRDY
  *         @arg @ref LL_ADC_FLAG_EOC
  *         @arg @ref LL_ADC_FLAG_EOS
  *         @arg @ref LL_ADC_FLAG_OVR
  *         @arg @ref LL_ADC_FLAG_EOSMP
  *         @arg @ref LL_ADC_FLAG_JEOC
  *         @arg @ref LL_ADC_FLAG_JEOS
  *         @arg @ref LL_ADC_FLAG_AWD1
  *         @arg @ref LL_ADC_FLAG_AWD2
  *         @arg @ref LL_ADC_FLAG_AWD3
  *         @arg @ref LL_ADC_FLAG_LDORDY
  * @note   Generic function with flag selected as parameter.
  *         Optimized functions for each flag are available.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_ADC_IsActiveFlag(const ADC_TypeDef *p_adc, uint32_t flag)
{
  return ((STM32_READ_BIT(p_adc->ISR, flag) == (flag)) ? 1UL : 0UL);
}

/**
  * @brief  Get flag ADC ready.
  * @rmtoll
  *  ISR      ADRDY          LL_ADC_IsActiveFlag_ADRDY
  * @param  p_adc Pointer to ADC instance
  * @note   ADC ready flag must be checked to ensure ADC activation is effective.
  *         ADC activation procedure requires several necessary steps:
  *         refer to description of @ref LL_ADC_Enable().
  * @note   ADC ready flag is latched at level 1: in case of ADC activation procedure new
  *         iteration or kernel clock update, it must be cleared before new check.
  *         Refer to @ref LL_ADC_IsActiveFlag_ADRDY().
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_ADC_IsActiveFlag_ADRDY(const ADC_TypeDef *p_adc)
{
  return ((STM32_READ_BIT(p_adc->ISR, LL_ADC_FLAG_ADRDY) == (LL_ADC_FLAG_ADRDY)) ? 1UL : 0UL);
}

/**
  * @brief  Get flag ADC group regular end of unitary conversion.
  * @rmtoll
  *  ISR      EOC            LL_ADC_IsActiveFlag_EOC
  * @param  p_adc Pointer to ADC instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_ADC_IsActiveFlag_EOC(const ADC_TypeDef *p_adc)
{
  return ((STM32_READ_BIT(p_adc->ISR, LL_ADC_FLAG_EOC) == (LL_ADC_FLAG_EOC)) ? 1UL : 0UL);
}

/**
  * @brief  Get flag ADC group regular end of sequence conversions.
  * @rmtoll
  *  ISR      EOS            LL_ADC_IsActiveFlag_EOS
  * @param  p_adc Pointer to ADC instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_ADC_IsActiveFlag_EOS(const ADC_TypeDef *p_adc)
{
  return ((STM32_READ_BIT(p_adc->ISR, LL_ADC_FLAG_EOS) == (LL_ADC_FLAG_EOS)) ? 1UL : 0UL);
}

/**
  * @brief  Get flag ADC group regular overrun.
  * @rmtoll
  *  ISR      OVR            LL_ADC_IsActiveFlag_OVR
  * @param  p_adc Pointer to ADC instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_ADC_IsActiveFlag_OVR(const ADC_TypeDef *p_adc)
{
  return ((STM32_READ_BIT(p_adc->ISR, LL_ADC_FLAG_OVR) == (LL_ADC_FLAG_OVR)) ? 1UL : 0UL);
}

/**
  * @brief  Get flag ADC group regular end of sampling phase.
  * @rmtoll
  *  ISR      EOSMP          LL_ADC_IsActiveFlag_EOSMP
  * @param  p_adc Pointer to ADC instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_ADC_IsActiveFlag_EOSMP(const ADC_TypeDef *p_adc)
{
  return ((STM32_READ_BIT(p_adc->ISR, LL_ADC_FLAG_EOSMP) == (LL_ADC_FLAG_EOSMP)) ? 1UL : 0UL);
}

/**
  * @brief  Get flag ADC group injected end of unitary conversion.
  * @rmtoll
  *  ISR      JEOC           LL_ADC_IsActiveFlag_JEOC
  * @param  p_adc Pointer to ADC instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_ADC_IsActiveFlag_JEOC(const ADC_TypeDef *p_adc)
{
  return ((STM32_READ_BIT(p_adc->ISR, LL_ADC_FLAG_JEOC) == (LL_ADC_FLAG_JEOC)) ? 1UL : 0UL);
}

/**
  * @brief  Get flag ADC group injected end of sequence conversions.
  * @rmtoll
  *  ISR      JEOS           LL_ADC_IsActiveFlag_JEOS
  * @param  p_adc Pointer to ADC instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_ADC_IsActiveFlag_JEOS(const ADC_TypeDef *p_adc)
{
  return ((STM32_READ_BIT(p_adc->ISR, LL_ADC_FLAG_JEOS) == (LL_ADC_FLAG_JEOS)) ? 1UL : 0UL);
}

/**
  * @brief  Get flag ADC analog watchdog 1 flag.
  * @rmtoll
  *  ISR      AWD1           LL_ADC_IsActiveFlag_AWD1
  * @param  p_adc Pointer to ADC instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_ADC_IsActiveFlag_AWD1(const ADC_TypeDef *p_adc)
{
  return ((STM32_READ_BIT(p_adc->ISR, LL_ADC_FLAG_AWD1) == (LL_ADC_FLAG_AWD1)) ? 1UL : 0UL);
}

/**
  * @brief  Get flag ADC analog watchdog 2 flag.
  * @rmtoll
  *  ISR      AWD2           LL_ADC_IsActiveFlag_AWD2
  * @param  p_adc Pointer to ADC instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_ADC_IsActiveFlag_AWD2(const ADC_TypeDef *p_adc)
{
  return ((STM32_READ_BIT(p_adc->ISR, LL_ADC_FLAG_AWD2) == (LL_ADC_FLAG_AWD2)) ? 1UL : 0UL);
}

/**
  * @brief  Get flag ADC analog watchdog 3 flag.
  * @rmtoll
  *  ISR      AWD3           LL_ADC_IsActiveFlag_AWD3
  * @param  p_adc Pointer to ADC instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_ADC_IsActiveFlag_AWD3(const ADC_TypeDef *p_adc)
{
  return ((STM32_READ_BIT(p_adc->ISR, LL_ADC_FLAG_AWD3) == (LL_ADC_FLAG_AWD3)) ? 1UL : 0UL);
}

/**
  * @brief  Get flag ADC internal voltage regulator (LDO) ready.
  * @rmtoll
  *  ISR      LDORDY         LL_ADC_IsActiveFlag_LDORDY
  * @param  p_adc Pointer to ADC instance
  * @note   On this STM32 series, this flag indicates LDO current state (not latched as other flags,
  *         no clear flag function)
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_ADC_IsActiveFlag_LDORDY(const ADC_TypeDef *p_adc)
{
  return ((STM32_READ_BIT(p_adc->ISR, LL_ADC_FLAG_LDORDY) == (LL_ADC_FLAG_LDORDY)) ? 1UL : 0UL);
}


/**
  * @brief  Clear ADC flag.
  * @rmtoll
  *  ISR      ADRDY          LL_ADC_ClearFlag\n
  *  ISR      EOC            LL_ADC_ClearFlag\n
  *  ISR      EOS            LL_ADC_ClearFlag\n
  *  ISR      OVR            LL_ADC_ClearFlag\n
  *  ISR      EOSMP          LL_ADC_ClearFlag\n
  *  ISR      JEOC           LL_ADC_ClearFlag\n
  *  ISR      JEOS           LL_ADC_ClearFlag\n
  *  ISR      AWD1           LL_ADC_ClearFlag\n
  *  ISR      AWD2           LL_ADC_ClearFlag\n
  *  ISR      AWD3           LL_ADC_ClearFlag\n
  *  ISR      LDORDY         LL_ADC_ClearFlag
  * @param  p_adc Pointer to ADC instance
  * @param  flag This parameter can be a combination of the following values:
  *         @arg @ref LL_ADC_FLAG_ADRDY
  *         @arg @ref LL_ADC_FLAG_EOC
  *         @arg @ref LL_ADC_FLAG_EOS
  *         @arg @ref LL_ADC_FLAG_OVR
  *         @arg @ref LL_ADC_FLAG_EOSMP
  *         @arg @ref LL_ADC_FLAG_JEOC
  *         @arg @ref LL_ADC_FLAG_JEOS
  *         @arg @ref LL_ADC_FLAG_AWD1
  *         @arg @ref LL_ADC_FLAG_AWD2
  *         @arg @ref LL_ADC_FLAG_AWD3
  *         @arg @ref LL_ADC_FLAG_LDORDY
  *         @arg @ref LL_ADC_FLAG_ALL
  * @note   Generic function with flag selected as parameter.
  *         Optimized functions for each flag are available.
  */
__STATIC_INLINE void LL_ADC_ClearFlag(ADC_TypeDef *p_adc, uint32_t flag)
{
  STM32_WRITE_REG(p_adc->ISR, flag);
}

/**
  * @brief  Clear flag ADC ready.
  * @rmtoll
  *  ISR      ADRDY          LL_ADC_ClearFlag_ADRDY
  * @param  p_adc Pointer to ADC instance
  */
__STATIC_INLINE void LL_ADC_ClearFlag_ADRDY(ADC_TypeDef *p_adc)
{
  STM32_WRITE_REG(p_adc->ISR, LL_ADC_FLAG_ADRDY);
}

/**
  * @brief  Clear flag ADC group regular end of unitary conversion.
  * @rmtoll
  *  ISR      EOC            LL_ADC_ClearFlag_EOC
  * @param  p_adc Pointer to ADC instance
  */
__STATIC_INLINE void LL_ADC_ClearFlag_EOC(ADC_TypeDef *p_adc)
{
  STM32_WRITE_REG(p_adc->ISR, LL_ADC_FLAG_EOC);
}

/**
  * @brief  Clear flag ADC group regular end of sequence conversions.
  * @rmtoll
  *  ISR      EOS            LL_ADC_ClearFlag_EOS
  * @param  p_adc Pointer to ADC instance
  */
__STATIC_INLINE void LL_ADC_ClearFlag_EOS(ADC_TypeDef *p_adc)
{
  STM32_WRITE_REG(p_adc->ISR, LL_ADC_FLAG_EOS);
}

/**
  * @brief  Clear flag ADC group regular overrun.
  * @rmtoll
  *  ISR      OVR            LL_ADC_ClearFlag_OVR
  * @param  p_adc Pointer to ADC instance
  */
__STATIC_INLINE void LL_ADC_ClearFlag_OVR(ADC_TypeDef *p_adc)
{
  STM32_WRITE_REG(p_adc->ISR, LL_ADC_FLAG_OVR);
}

/**
  * @brief  Clear flag ADC group regular end of sampling phase.
  * @rmtoll
  *  ISR      EOSMP          LL_ADC_ClearFlag_EOSMP
  * @param  p_adc Pointer to ADC instance
  */
__STATIC_INLINE void LL_ADC_ClearFlag_EOSMP(ADC_TypeDef *p_adc)
{
  STM32_WRITE_REG(p_adc->ISR, LL_ADC_FLAG_EOSMP);
}

/**
  * @brief  Clear flag ADC group injected end of unitary conversion.
  * @rmtoll
  *  ISR      JEOC           LL_ADC_ClearFlag_JEOC
  * @param  p_adc Pointer to ADC instance
  */
__STATIC_INLINE void LL_ADC_ClearFlag_JEOC(ADC_TypeDef *p_adc)
{
  STM32_WRITE_REG(p_adc->ISR, LL_ADC_FLAG_JEOC);
}

/**
  * @brief  Clear flag ADC group injected end of sequence conversions.
  * @rmtoll
  *  ISR      JEOS           LL_ADC_ClearFlag_JEOS
  * @param  p_adc Pointer to ADC instance
  */
__STATIC_INLINE void LL_ADC_ClearFlag_JEOS(ADC_TypeDef *p_adc)
{
  STM32_WRITE_REG(p_adc->ISR, LL_ADC_FLAG_JEOS);
}

/**
  * @brief  Clear flag ADC analog watchdog 1.
  * @rmtoll
  *  ISR      AWD1           LL_ADC_ClearFlag_AWD1
  * @param  p_adc Pointer to ADC instance
  */
__STATIC_INLINE void LL_ADC_ClearFlag_AWD1(ADC_TypeDef *p_adc)
{
  STM32_WRITE_REG(p_adc->ISR, LL_ADC_FLAG_AWD1);
}

/**
  * @brief  Clear flag ADC analog watchdog 2 out of window event.
  * @rmtoll
  *  ISR      AWD2           LL_ADC_ClearFlag_AWD2
  * @param  p_adc Pointer to ADC instance
  */
__STATIC_INLINE void LL_ADC_ClearFlag_AWD2(ADC_TypeDef *p_adc)
{
  STM32_WRITE_REG(p_adc->ISR, LL_ADC_FLAG_AWD2);
}

/**
  * @brief  Clear flag ADC analog watchdog 3 out of window event.
  * @rmtoll
  *  ISR      AWD3           LL_ADC_ClearFlag_AWD3
  * @param  p_adc Pointer to ADC instance
  */
__STATIC_INLINE void LL_ADC_ClearFlag_AWD3(ADC_TypeDef *p_adc)
{
  STM32_WRITE_REG(p_adc->ISR, LL_ADC_FLAG_AWD3);
}

/**
  * @brief  Clear flag ADC internal voltage regulator (LDO) ready.
  * @rmtoll
  *  ISR      LDORDY         LL_ADC_ClearFlag_LDORDY
  * @param  p_adc Pointer to ADC instance
  * @note   On this STM32 series, this flag indicates LDO current state (not latched as other flags,
  *         no clear flag function)
  */
__STATIC_INLINE void LL_ADC_ClearFlag_LDORDY(ADC_TypeDef *p_adc)
{
  STM32_WRITE_REG(p_adc->ISR, LL_ADC_FLAG_LDORDY);
}

#if defined(ADC_MULTIMODE_SUPPORT)
/**
  * @brief  Get flag multimode ADC ready of the ADC master.
  * @rmtoll
  *  CSR      ADRDY_MST      LL_ADC_IsActiveFlag_MST_ADRDY
  * @param  p_adc_common Pointer to ADC common instance
  *         (can be set directly from CMSIS definition ADCxy_COMMON or using macro ADC_COMMON_INSTANCE())
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_ADC_IsActiveFlag_MST_ADRDY(const ADC_Common_TypeDef *p_adc_common)
{
  return ((STM32_READ_BIT(p_adc_common->CSR, LL_ADC_FLAG_ADRDY_MST) == (LL_ADC_FLAG_ADRDY_MST)) ? 1UL : 0UL);
}

/**
  * @brief  Get flag multimode ADC ready of the ADC slave.
  * @rmtoll
  *  CSR      ADRDY_SLV      LL_ADC_IsActiveFlag_SLV_ADRDY
  * @param  p_adc_common Pointer to ADC common instance
  *         (can be set directly from CMSIS definition ADCxy_COMMON or using macro ADC_COMMON_INSTANCE())
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_ADC_IsActiveFlag_SLV_ADRDY(const ADC_Common_TypeDef *p_adc_common)
{
  return ((STM32_READ_BIT(p_adc_common->CSR, LL_ADC_FLAG_ADRDY_SLV) == (LL_ADC_FLAG_ADRDY_SLV)) ? 1UL : 0UL);
}

/**
  * @brief  Get flag multimode ADC group regular end of unitary conversion of the ADC master.
  * @rmtoll
  *  CSR      EOC_MST        LL_ADC_IsActiveFlag_MST_EOC
  * @param  p_adc_common Pointer to ADC common instance
  *         (can be set directly from CMSIS definition ADCxy_COMMON or using macro ADC_COMMON_INSTANCE())
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_ADC_IsActiveFlag_MST_EOC(const ADC_Common_TypeDef *p_adc_common)
{
  return ((STM32_READ_BIT(p_adc_common->CSR, LL_ADC_FLAG_EOC_MST) == (LL_ADC_FLAG_EOC_MST)) ? 1UL : 0UL);
}

/**
  * @brief  Get flag multimode ADC group regular end of unitary conversion of the ADC slave.
  * @rmtoll
  *  CSR      EOC_SLV        LL_ADC_IsActiveFlag_SLV_EOC
  * @param  p_adc_common Pointer to ADC common instance
  *         (can be set directly from CMSIS definition ADCxy_COMMON or using macro ADC_COMMON_INSTANCE())
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_ADC_IsActiveFlag_SLV_EOC(const ADC_Common_TypeDef *p_adc_common)
{
  return ((STM32_READ_BIT(p_adc_common->CSR, LL_ADC_FLAG_EOC_SLV) == (LL_ADC_FLAG_EOC_SLV)) ? 1UL : 0UL);
}

/**
  * @brief  Get flag multimode ADC group regular end of sequence conversions of the ADC master.
  * @rmtoll
  *  CSR      EOS_MST        LL_ADC_IsActiveFlag_MST_EOS
  * @param  p_adc_common Pointer to ADC common instance
  *         (can be set directly from CMSIS definition ADCxy_COMMON or using macro ADC_COMMON_INSTANCE())
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_ADC_IsActiveFlag_MST_EOS(const ADC_Common_TypeDef *p_adc_common)
{
  return ((STM32_READ_BIT(p_adc_common->CSR, LL_ADC_FLAG_EOS_MST) == (LL_ADC_FLAG_EOS_MST)) ? 1UL : 0UL);
}

/**
  * @brief  Get flag multimode ADC group regular end of sequence conversions of the ADC slave.
  * @rmtoll
  *  CSR      EOS_SLV        LL_ADC_IsActiveFlag_SLV_EOS
  * @param  p_adc_common Pointer to ADC common instance
  *         (can be set directly from CMSIS definition ADCxy_COMMON or using macro ADC_COMMON_INSTANCE())
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_ADC_IsActiveFlag_SLV_EOS(const ADC_Common_TypeDef *p_adc_common)
{
  return ((STM32_READ_BIT(p_adc_common->CSR, LL_ADC_FLAG_EOS_SLV) == (LL_ADC_FLAG_EOS_SLV)) ? 1UL : 0UL);
}

/**
  * @brief  Get flag multimode ADC group regular overrun of the ADC master.
  * @rmtoll
  *  CSR      OVR_MST        LL_ADC_IsActiveFlag_MST_OVR
  * @param  p_adc_common Pointer to ADC common instance
  *         (can be set directly from CMSIS definition ADCxy_COMMON or using macro ADC_COMMON_INSTANCE())
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_ADC_IsActiveFlag_MST_OVR(const ADC_Common_TypeDef *p_adc_common)
{
  return ((STM32_READ_BIT(p_adc_common->CSR, LL_ADC_FLAG_OVR_MST) == (LL_ADC_FLAG_OVR_MST)) ? 1UL : 0UL);
}

/**
  * @brief  Get flag multimode ADC group regular overrun of the ADC slave.
  * @rmtoll
  *  CSR      OVR_SLV        LL_ADC_IsActiveFlag_SLV_OVR
  * @param  p_adc_common Pointer to ADC common instance
  *         (can be set directly from CMSIS definition ADCxy_COMMON or using macro ADC_COMMON_INSTANCE())
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_ADC_IsActiveFlag_SLV_OVR(const ADC_Common_TypeDef *p_adc_common)
{
  return ((STM32_READ_BIT(p_adc_common->CSR, LL_ADC_FLAG_OVR_SLV) == (LL_ADC_FLAG_OVR_SLV)) ? 1UL : 0UL);
}

/**
  * @brief  Get flag multimode ADC group regular end of sampling of the ADC master.
  * @rmtoll
  *  CSR      EOSMP_MST      LL_ADC_IsActiveFlag_MST_EOSMP
  * @param  p_adc_common Pointer to ADC common instance
  *         (can be set directly from CMSIS definition ADCxy_COMMON or using macro ADC_COMMON_INSTANCE())
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_ADC_IsActiveFlag_MST_EOSMP(const ADC_Common_TypeDef *p_adc_common)
{
  return ((STM32_READ_BIT(p_adc_common->CSR, LL_ADC_FLAG_EOSMP_MST) == (LL_ADC_FLAG_EOSMP_MST)) ? 1UL : 0UL);
}

/**
  * @brief  Get flag multimode ADC group regular end of sampling of the ADC slave.
  * @rmtoll
  *  CSR      EOSMP_SLV      LL_ADC_IsActiveFlag_SLV_EOSMP
  * @param  p_adc_common Pointer to ADC common instance
  *         (can be set directly from CMSIS definition ADCxy_COMMON or using macro ADC_COMMON_INSTANCE())
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_ADC_IsActiveFlag_SLV_EOSMP(const ADC_Common_TypeDef *p_adc_common)
{
  return ((STM32_READ_BIT(p_adc_common->CSR, LL_ADC_FLAG_EOSMP_SLV) == (LL_ADC_FLAG_EOSMP_SLV)) ? 1UL : 0UL);
}

/**
  * @brief  Get flag multimode ADC group injected end of unitary conversion of the ADC master.
  * @rmtoll
  *  CSR      JEOC_MST       LL_ADC_IsActiveFlag_MST_JEOC
  * @param  p_adc_common Pointer to ADC common instance
  *         (can be set directly from CMSIS definition ADCxy_COMMON or using macro ADC_COMMON_INSTANCE())
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_ADC_IsActiveFlag_MST_JEOC(const ADC_Common_TypeDef *p_adc_common)
{
  return ((STM32_READ_BIT(p_adc_common->CSR, LL_ADC_FLAG_JEOC_MST) == (LL_ADC_FLAG_JEOC_MST)) ? 1UL : 0UL);
}

