MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_adc.h
/** @defgroup ADC_LL_EF_IT_Management ADC IT management
  * @{
  */

/**
  * @brief  Enable ADC interruption.
  * @rmtoll
  *  IER      ADRDY          LL_ADC_EnableIT\n
  *  IER      EOC            LL_ADC_EnableIT\n
  *  IER      EOS            LL_ADC_EnableIT\n
  *  IER      OVR            LL_ADC_EnableIT\n
  *  IER      EOSMP          LL_ADC_EnableIT\n
  *  IER      JEOC           LL_ADC_EnableIT\n
  *  IER      JEOS           LL_ADC_EnableIT\n
  *  IER      AWD1           LL_ADC_EnableIT\n
  *  IER      AWD2           LL_ADC_EnableIT\n
  *  IER      AWD3           LL_ADC_EnableIT\n
  *  IER      LDORDY         LL_ADC_EnableIT
  * @param  p_adc Pointer to ADC instance
  * @param  it   This parameter can be a combination of the following values:
  *         @arg @ref LL_ADC_IT_ADRDY
  *         @arg @ref LL_ADC_IT_EOC
  *         @arg @ref LL_ADC_IT_EOS
  *         @arg @ref LL_ADC_IT_OVR
  *         @arg @ref LL_ADC_IT_EOSMP
  *         @arg @ref LL_ADC_IT_JEOC
  *         @arg @ref LL_ADC_IT_JEOS
  *         @arg @ref LL_ADC_IT_AWD1
  *         @arg @ref LL_ADC_IT_AWD2
  *         @arg @ref LL_ADC_IT_AWD3
  *         @arg @ref LL_ADC_IT_LDORDY
  *         @arg @ref LL_ADC_IT_ALL
  * @note   Generic function with flag selected as parameter.
  *         Optimized functions for each flag are available.
  */
__STATIC_INLINE void LL_ADC_EnableIT(ADC_TypeDef *p_adc, uint32_t it)
{
  STM32_SET_BIT(p_adc->IER, it);
}

/**
  * @brief  Enable ADC ready.
  * @rmtoll
  *  IER      ADRDYIE        LL_ADC_EnableIT_ADRDY
  * @param  p_adc Pointer to ADC instance
  */
__STATIC_INLINE void LL_ADC_EnableIT_ADRDY(ADC_TypeDef *p_adc)
{
  STM32_SET_BIT(p_adc->IER, LL_ADC_IT_ADRDY);
}

/**
  * @brief  Enable interruption ADC group regular end of unitary conversion.
  * @rmtoll
  *  IER      EOCIE          LL_ADC_EnableIT_EOC
  * @param  p_adc Pointer to ADC instance
  */
__STATIC_INLINE void LL_ADC_EnableIT_EOC(ADC_TypeDef *p_adc)
{
  STM32_SET_BIT(p_adc->IER, LL_ADC_IT_EOC);
}

/**
  * @brief  Enable interruption ADC group regular end of sequence conversions.
  * @rmtoll
  *  IER      EOSIE          LL_ADC_EnableIT_EOS
  * @param  p_adc Pointer to ADC instance
  */
__STATIC_INLINE void LL_ADC_EnableIT_EOS(ADC_TypeDef *p_adc)
{
  STM32_SET_BIT(p_adc->IER, LL_ADC_IT_EOS);
}

/**
  * @brief  Enable ADC group regular interruption overrun.
  * @rmtoll
  *  IER      OVRIE          LL_ADC_EnableIT_OVR
  * @param  p_adc Pointer to ADC instance
  */
__STATIC_INLINE void LL_ADC_EnableIT_OVR(ADC_TypeDef *p_adc)
{
  STM32_SET_BIT(p_adc->IER, LL_ADC_IT_OVR);
}

/**
  * @brief  Enable interruption ADC group regular end of sampling.
  * @rmtoll
  *  IER      EOSMPIE        LL_ADC_EnableIT_EOSMP
  * @param  p_adc Pointer to ADC instance
  */
__STATIC_INLINE void LL_ADC_EnableIT_EOSMP(ADC_TypeDef *p_adc)
{
  STM32_SET_BIT(p_adc->IER, LL_ADC_IT_EOSMP);
}

/**
  * @brief  Enable interruption ADC group injected end of unitary conversion.
  * @rmtoll
  *  IER      JEOCIE         LL_ADC_EnableIT_JEOC
  * @param  p_adc Pointer to ADC instance
  */
__STATIC_INLINE void LL_ADC_EnableIT_JEOC(ADC_TypeDef *p_adc)
{
  STM32_SET_BIT(p_adc->IER, LL_ADC_IT_JEOC);
}

/**
  * @brief  Enable interruption ADC group injected end of sequence conversions.
  * @rmtoll
  *  IER      JEOSIE         LL_ADC_EnableIT_JEOS
  * @param  p_adc Pointer to ADC instance
  */
__STATIC_INLINE void LL_ADC_EnableIT_JEOS(ADC_TypeDef *p_adc)
{
  STM32_SET_BIT(p_adc->IER, LL_ADC_IT_JEOS);
}

/**
  * @brief  Enable interruption ADC analog watchdog 1.
  * @rmtoll
  *  IER      AWD1IE         LL_ADC_EnableIT_AWD1
  * @param  p_adc Pointer to ADC instance
  */
__STATIC_INLINE void LL_ADC_EnableIT_AWD1(ADC_TypeDef *p_adc)
{
  STM32_SET_BIT(p_adc->IER, LL_ADC_IT_AWD1);
}

/**
  * @brief  Enable interruption ADC analog watchdog 2.
  * @rmtoll
  *  IER      AWD2IE         LL_ADC_EnableIT_AWD2
  * @param  p_adc Pointer to ADC instance
  */
__STATIC_INLINE void LL_ADC_EnableIT_AWD2(ADC_TypeDef *p_adc)
{
  STM32_SET_BIT(p_adc->IER, LL_ADC_IT_AWD2);
}

/**
  * @brief  Enable interruption ADC analog watchdog 3.
  * @rmtoll
  *  IER      AWD3IE         LL_ADC_EnableIT_AWD3
  * @param  p_adc Pointer to ADC instance
  */
__STATIC_INLINE void LL_ADC_EnableIT_AWD3(ADC_TypeDef *p_adc)
{
  STM32_SET_BIT(p_adc->IER, LL_ADC_IT_AWD3);
}

/**
  * @brief  Disable ADC interruption.
  * @rmtoll
  *  IER      ADRDY          LL_ADC_DisableIT\n
  *  IER      EOC            LL_ADC_DisableIT\n
  *  IER      EOS            LL_ADC_DisableIT\n
  *  IER      OVR            LL_ADC_DisableIT\n
  *  IER      EOSMP          LL_ADC_DisableIT\n
  *  IER      JEOC           LL_ADC_DisableIT\n
  *  IER      JEOS           LL_ADC_DisableIT\n
  *  IER      AWD1           LL_ADC_DisableIT\n
  *  IER      AWD2           LL_ADC_DisableIT\n
  *  IER      AWD3           LL_ADC_DisableIT\n
  *  IER      LDORDY         LL_ADC_DisableIT
  * @param  p_adc Pointer to ADC instance
  * @param  it   This parameter can be a combination of the following values:
  *         @arg @ref LL_ADC_IT_ADRDY
  *         @arg @ref LL_ADC_IT_EOC
  *         @arg @ref LL_ADC_IT_EOS
  *         @arg @ref LL_ADC_IT_OVR
  *         @arg @ref LL_ADC_IT_EOSMP
  *         @arg @ref LL_ADC_IT_JEOC
  *         @arg @ref LL_ADC_IT_JEOS
  *         @arg @ref LL_ADC_IT_AWD1
  *         @arg @ref LL_ADC_IT_AWD2
  *         @arg @ref LL_ADC_IT_AWD3
  *         @arg @ref LL_ADC_IT_LDORDY
  *         @arg @ref LL_ADC_IT_ALL
  * @note   Generic function with flag selected as parameter.
  *         Optimized functions for each flag are also available.
  */
__STATIC_INLINE void LL_ADC_DisableIT(ADC_TypeDef *p_adc, uint32_t it)
{
  STM32_CLEAR_BIT(p_adc->IER, it);
}

/**
  * @brief  Disable interruption ADC ready.
  * @rmtoll
  *  IER      ADRDYIE        LL_ADC_DisableIT_ADRDY
  * @param  p_adc Pointer to ADC instance
  */
__STATIC_INLINE void LL_ADC_DisableIT_ADRDY(ADC_TypeDef *p_adc)
{
  STM32_CLEAR_BIT(p_adc->IER, LL_ADC_IT_ADRDY);
}

/**
  * @brief  Disable interruption ADC group regular end of unitary conversion.
  * @rmtoll
  *  IER      EOCIE          LL_ADC_DisableIT_EOC
  * @param  p_adc Pointer to ADC instance
  */
__STATIC_INLINE void LL_ADC_DisableIT_EOC(ADC_TypeDef *p_adc)
{
  STM32_CLEAR_BIT(p_adc->IER, LL_ADC_IT_EOC);
}

/**
  * @brief  Disable interruption ADC group regular end of sequence conversions.
  * @rmtoll
  *  IER      EOSIE          LL_ADC_DisableIT_EOS
  * @param  p_adc Pointer to ADC instance
  */
__STATIC_INLINE void LL_ADC_DisableIT_EOS(ADC_TypeDef *p_adc)
{
  STM32_CLEAR_BIT(p_adc->IER, LL_ADC_IT_EOS);
}

/**
  * @brief  Disable interruption ADC group regular overrun.
  * @rmtoll
  *  IER      OVRIE          LL_ADC_DisableIT_OVR
  * @param  p_adc Pointer to ADC instance
  */
__STATIC_INLINE void LL_ADC_DisableIT_OVR(ADC_TypeDef *p_adc)
{
  STM32_CLEAR_BIT(p_adc->IER, LL_ADC_IT_OVR);
}

/**
  * @brief  Disable interruption ADC group regular end of sampling.
  * @rmtoll
  *  IER      EOSMPIE        LL_ADC_DisableIT_EOSMP
  * @param  p_adc Pointer to ADC instance
  */
__STATIC_INLINE void LL_ADC_DisableIT_EOSMP(ADC_TypeDef *p_adc)
{
  STM32_CLEAR_BIT(p_adc->IER, LL_ADC_IT_EOSMP);
}

/**
  * @brief  Disable interruption ADC group regular end of unitary conversion.
  * @rmtoll
  *  IER      JEOCIE         LL_ADC_DisableIT_JEOC
  * @param  p_adc Pointer to ADC instance
  */
__STATIC_INLINE void LL_ADC_DisableIT_JEOC(ADC_TypeDef *p_adc)
{
  STM32_CLEAR_BIT(p_adc->IER, LL_ADC_IT_JEOC);
}

/**
  * @brief  Disable interruption ADC group injected end of sequence conversions.
  * @rmtoll
  *  IER      JEOSIE         LL_ADC_DisableIT_JEOS
  * @param  p_adc Pointer to ADC instance
  */
__STATIC_INLINE void LL_ADC_DisableIT_JEOS(ADC_TypeDef *p_adc)
{
  STM32_CLEAR_BIT(p_adc->IER, LL_ADC_IT_JEOS);
}

/**
  * @brief  Disable interruption ADC analog watchdog 1.
  * @rmtoll
  *  IER      AWD1IE         LL_ADC_DisableIT_AWD1
  * @param  p_adc Pointer to ADC instance
  */
__STATIC_INLINE void LL_ADC_DisableIT_AWD1(ADC_TypeDef *p_adc)
{
  STM32_CLEAR_BIT(p_adc->IER, LL_ADC_IT_AWD1);
}

/**
  * @brief  Disable interruption ADC analog watchdog 2.
  * @rmtoll
  *  IER      AWD2IE         LL_ADC_DisableIT_AWD2
  * @param  p_adc Pointer to ADC instance
  */
__STATIC_INLINE void LL_ADC_DisableIT_AWD2(ADC_TypeDef *p_adc)
{
  STM32_CLEAR_BIT(p_adc->IER, LL_ADC_IT_AWD2);
}

/**
  * @brief  Disable interruption ADC analog watchdog 3.
  * @rmtoll
  *  IER      AWD3IE         LL_ADC_DisableIT_AWD3
  * @param  p_adc Pointer to ADC instance
  */
__STATIC_INLINE void LL_ADC_DisableIT_AWD3(ADC_TypeDef *p_adc)
{
  STM32_CLEAR_BIT(p_adc->IER, LL_ADC_IT_AWD3);
}

/**
  * @brief  Get state of ADC interruption.
  * @rmtoll
  *  IER      ADRDY          LL_ADC_IsEnabledIT\n
  *  IER      EOC            LL_ADC_IsEnabledIT\n
  *  IER      EOS            LL_ADC_IsEnabledIT\n
  *  IER      OVR            LL_ADC_IsEnabledIT\n
  *  IER      EOSMP          LL_ADC_IsEnabledIT\n
  *  IER      JEOC           LL_ADC_IsEnabledIT\n
  *  IER      JEOS           LL_ADC_IsEnabledIT\n
  *  IER      AWD1           LL_ADC_IsEnabledIT\n
  *  IER      AWD2           LL_ADC_IsEnabledIT\n
  *  IER      AWD3           LL_ADC_IsEnabledIT\n
  *  IER      LDORDY         LL_ADC_IsEnabledIT
  * @param  p_adc Pointer to ADC instance
  * @param  it   This parameter can be one of the following values:
  *         @arg @ref LL_ADC_IT_ADRDY
  *         @arg @ref LL_ADC_IT_EOC
  *         @arg @ref LL_ADC_IT_EOS
  *         @arg @ref LL_ADC_IT_OVR
  *         @arg @ref LL_ADC_IT_EOSMP
  *         @arg @ref LL_ADC_IT_JEOC
  *         @arg @ref LL_ADC_IT_JEOS
  *         @arg @ref LL_ADC_IT_AWD1
  *         @arg @ref LL_ADC_IT_AWD2
  *         @arg @ref LL_ADC_IT_AWD3
  *         @arg @ref LL_ADC_IT_LDORDY
  *         @arg @ref LL_ADC_IT_ALL
  * @note   Generic function with flag selected as parameter.
  *         Optimized functions for each flag are available.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_ADC_IsEnabledIT(ADC_TypeDef *p_adc, uint32_t it)
{
  return ((STM32_READ_BIT(p_adc->IER, it) == (it)) ? 1UL : 0UL);
}

/**
  * @brief  Get state of interruption ADC ready
  *         (0: interrupt disabled, 1: interrupt enabled).
  * @rmtoll
  *  IER      ADRDYIE        LL_ADC_IsEnabledIT_ADRDY
  * @param  p_adc Pointer to ADC instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_ADC_IsEnabledIT_ADRDY(const ADC_TypeDef *p_adc)
{
  return ((STM32_READ_BIT(p_adc->IER, LL_ADC_IT_ADRDY) == (LL_ADC_IT_ADRDY)) ? 1UL : 0UL);
}

/**
  * @brief  Get state of interruption ADC group regular end of unitary conversion
  *         (0: interrupt disabled, 1: interrupt enabled).
  * @rmtoll
  *  IER      EOCIE          LL_ADC_IsEnabledIT_EOC
  * @param  p_adc Pointer to ADC instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_ADC_IsEnabledIT_EOC(const ADC_TypeDef *p_adc)
{
  return ((STM32_READ_BIT(p_adc->IER, LL_ADC_IT_EOC) == (LL_ADC_IT_EOC)) ? 1UL : 0UL);
}

/**
  * @brief  Get state of interruption ADC group regular end of sequence conversions
  *         (0: interrupt disabled, 1: interrupt enabled).
  * @rmtoll
  *  IER      EOSIE          LL_ADC_IsEnabledIT_EOS
  * @param  p_adc Pointer to ADC instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_ADC_IsEnabledIT_EOS(const ADC_TypeDef *p_adc)
{
  return ((STM32_READ_BIT(p_adc->IER, LL_ADC_IT_EOS) == (LL_ADC_IT_EOS)) ? 1UL : 0UL);
}

/**
  * @brief  Get state of interruption ADC group regular overrun
  *         (0: interrupt disabled, 1: interrupt enabled).
  * @rmtoll
  *  IER      OVRIE          LL_ADC_IsEnabledIT_OVR
  * @param  p_adc Pointer to ADC instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_ADC_IsEnabledIT_OVR(const ADC_TypeDef *p_adc)
{
  return ((STM32_READ_BIT(p_adc->IER, LL_ADC_IT_OVR) == (LL_ADC_IT_OVR)) ? 1UL : 0UL);
}

/**
  * @brief  Get state of interruption ADC group regular end of sampling
  *         (0: interrupt disabled, 1: interrupt enabled).
  * @rmtoll
  *  IER      EOSMPIE        LL_ADC_IsEnabledIT_EOSMP
  * @param  p_adc Pointer to ADC instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_ADC_IsEnabledIT_EOSMP(const ADC_TypeDef *p_adc)
{
  return ((STM32_READ_BIT(p_adc->IER, LL_ADC_IT_EOSMP) == (LL_ADC_IT_EOSMP)) ? 1UL : 0UL);
}

/**
  * @brief  Get state of interruption ADC group injected end of unitary conversion
  *         (0: interrupt disabled, 1: interrupt enabled).
  * @rmtoll
  *  IER      JEOCIE         LL_ADC_IsEnabledIT_JEOC
  * @param  p_adc Pointer to ADC instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_ADC_IsEnabledIT_JEOC(const ADC_TypeDef *p_adc)
{
  return ((STM32_READ_BIT(p_adc->IER, LL_ADC_IT_JEOC) == (LL_ADC_IT_JEOC)) ? 1UL : 0UL);
}

/**
  * @brief  Get state of interruption ADC group injected end of sequence conversions
  *         (0: interrupt disabled, 1: interrupt enabled).
  * @rmtoll
  *  IER      JEOSIE         LL_ADC_IsEnabledIT_JEOS
  * @param  p_adc Pointer to ADC instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_ADC_IsEnabledIT_JEOS(const ADC_TypeDef *p_adc)
{
  return ((STM32_READ_BIT(p_adc->IER, LL_ADC_IT_JEOS) == (LL_ADC_IT_JEOS)) ? 1UL : 0UL);
}

/**
  * @brief  Get state of interruption ADC analog watchdog 1 out of window event.
  *         (0: interrupt disabled, 1: interrupt enabled).
  * @rmtoll
  *  IER      AWD1IE         LL_ADC_IsEnabledIT_AWD1
  * @param  p_adc Pointer to ADC instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_ADC_IsEnabledIT_AWD1(const ADC_TypeDef *p_adc)
{
  return ((STM32_READ_BIT(p_adc->IER, LL_ADC_IT_AWD1) == (LL_ADC_IT_AWD1)) ? 1UL : 0UL);
}

/**
  * @brief  Get state of interruption ADC analog watchdog 2 out of window event.
  *         (0: interrupt disabled, 1: interrupt enabled).
  * @rmtoll
  *  IER      AWD2IE         LL_ADC_IsEnabledIT_AWD2
  * @param  p_adc Pointer to ADC instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_ADC_IsEnabledIT_AWD2(const ADC_TypeDef *p_adc)
{
  return ((STM32_READ_BIT(p_adc->IER, LL_ADC_IT_AWD2) == (LL_ADC_IT_AWD2)) ? 1UL : 0UL);
}

/**
  * @brief  Get state of interruption ADC analog watchdog 3 out of window event.
  *         (0: interrupt disabled, 1: interrupt enabled).
  * @rmtoll
  *  IER      AWD3IE         LL_ADC_IsEnabledIT_AWD3
  * @param  p_adc Pointer to ADC instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_ADC_IsEnabledIT_AWD3(const ADC_TypeDef *p_adc)
{
  return ((STM32_READ_BIT(p_adc->IER, LL_ADC_IT_AWD3) == (LL_ADC_IT_AWD3)) ? 1UL : 0UL);
}

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */
#endif /* ADC1 || ADC2 || ADC3 */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* STM32C5XX_LL_ADC_H */
